[{"about":"Concerning. \"Let's read a story about animals.\"","above":"Over, higher than. \"The plane flew above the clouds.\"","all":"Every single one. \"All the kids got a prize.\"","an":"One, any. \"An apple a day keeps the doctor away.\"","and":"Also, in addition to. \"I like apples and oranges.\"","animal":"A living thing that moves, like a dog. \"My favorite animal is a dog.\"","ant":"Tiny black insect that lives in hills. \"The ant carried a crumb back to the ant hill.\"","are":"Existing or taking place now. \"Here are my toys.\"","as":"Similar to, like. \"Big as a house.\"","at":"In or near a place. \"The party is at my house.\"","back":"Rear or reverse side. \"The writing is on the back.\"","bad":"Not good, naughty. \"It's bad to hit.\"","bat":"Animal that flies and sees at night. \"The bat swooped through the cave.\"","be":"Exist. \"I want to be a teacher someday.\"","bed":"Place you sleep. \"She lay in bed and read books.\"","been":"Have done action in past. \"I've been to Disney World.\"","bell":"Something that rings. \"The bell rang to start school.\"","below":"Under or lower than. \"My shoes were below the bed.\"","big":"Of great size. \"An elephant is big.\"","bit":"Small piece or amount. \"Eat a bit of your lunch now.\"","black":"Darkest color. \"Her hair was black.\"","block":"Square toy brick. \"He built a tower out of blocks.\"","blow":"To move air. \"The wind will blow the balloon away.\"","boat":"A ship on water. \"They rowed the boat across the lake.\"","bone":"What gives bodies shape. \"The dog hid the bone for later.\"","brick":"Baked clay building block. \"The bricks made a strong wall.\"","broom":"Tool for sweeping floors. \"She used the broom to clean up.\"","brown":"Color like dirt or bark. \"Chocolate is brown.\"","bug":"Tiny creepy crawly thing. \"Look at that beetle bug!\"","bun":"Sweet bread roll. \"I ate a sticky cinnamon bun.\"","bus":"Vehicle that takes people places. \"The school bus was yellow.\"","but":"However, in contrast. \"I wanted to play but had no time.\"","by":"Near, past by. \"She walked by my house.\"","called":"Named. \"My brother is called Mike.\"","can":"To be able to do something. \"I can hop on one foot.\"","cap":"Kind of small hat. \"He wore a baseball cap.\"","cat":"House pet with soft fur. \"The cat purred in my lap.\"","chop":"Cut into pieces. \"Dad will chop the carrots.\"","clay":"Doughy earth good for sculpting. \"She molded clay into a bowl shape.\"","clock":"Shows the time numbers. \"The clock said three o'clock.\"","clown":"Someone who makes you laugh. \"The birthday clown had a red nose.\"","coat":"Outer garment worn outdoors. \"Put on your coat when it's cold.\"","cob":"Center part of corn. \"We grilled sweet corn cobs.\"","code":"Signals to send messages. \"Morse code uses dots and dashes.\"","come":"To move closer. \"Come over to my house to play.\"","could":"Was possible to. \"I could hear the birds chirping.\"","cow":"Farm animal that says moo. \"The cow gave us milk.\"","cry":"Shed tears when sad. \"The baby will cry when she needs something.\"","cup":"Drinking vessel with handle. \"He drank milk from a plastic cup.\"","cut":"Slice into with a blade. \"Please cut the cake into slices.\"","day":"When the sun is out. \"We play soccer during the day.\"","deep":"Goes far down. \"The pool was too deep for me.\"","did":"To have done something. \"Yesterday I did my homework.\"","dig":"Move dirt with a shovel. \"We dig to make a hole.\"","dime":"Type of coin money. \"A dime is worth 10 cents.\"","do":"To perform and action. \"I do my homework every day.\"","dog":"Common household pet. \"The happy dog wagged his tail.\"","down":"Towards the ground. \"The ball rolled down the hill.\"","drive":"Operate a vehicle. \"My dad will drive the car.\"","drop":"To fall suddenly. \"Oops, I dropped the plate but didn't break it.\"","dry":"Free from wetness or dampness. \"Hang clothes out to dry when washed.\"","duck":"Water bird that says quack. \"We fed bread crumbs to the ducks.\"","each":"Every one individually. \"Each student got a prize.\"","fed":"Provided food to eat. \"The mom fed the baby with a bottle.\"","feel":"Use hands to touch. \"I feel the cat's soft fur.\"","fell":"To drop down suddenly. \"She fell off her bike but wasn't hurt.\"","find":"Discover or locate something. \"Let's find shells at the beach.\"","first":"Coming before all others. \"My friend was first in line.\"","fit":"Properly sized to one's body. \"These shoes fit my feet just right.\"","five":"The number after four. \"I have five dolls.\"","float":"Stay on top of water. \"The rubber duck will float in the bath.\"","flow":"Move smoothly like water. \"The river flows to the ocean.\"","foot":"Body part used for standing and walking. \"I hurt my foot and limped home.\"","for":"Because, as a result of. \"I studied hard for the test.\"","fox":"Red/orange wild dog-like animal. \"The fox had a fluffy tail.\"","free":"Without cost. \"The concert was free.\"","from":"Indicating a starting point. \"We drove here from home.\"","fun":"Enjoyable, makes you happy. \"Playing is fun!\"","game":"Activity with rules for fun. \"Soccer is my favorite game.\"","gas":"Fuel that makes cars go. \"We fill up the car's gas tank.\"","get":"Receive, acquire, obtain. \"I will get a puppy for my birthday.\"","glad":"Happy, pleased, joyful. \"I'm glad that school is over.\"","go":"To move or travel. \"It's time to go home now.\"","good":"Fine, excellent, great. \"You did a good job.\"","grass":"Green plants in yards and fields. \"Cows eat grass in the meadow.\"","green":"Color like fresh leaves. \"We made green handprints for art.\"","grow":"Become bigger over time. \"Babies grow quickly.\"","had":"Did something in the past. \"Yesterday I had such fun!\"","has":"Now owns something. \"My friend has a new lunchbox.\"","hat":"Head covering worn outdoors. \"Her hat kept the sun out of her eyes.\"","have":"To possess something. \"I have a pet cat named Fluffy.\"","he":"That boy or man. \"He helped me.\"","heat":"High temperature warmth. \"The sun gives heat to the earth.\"","hen":"Adult female chicken. \"The hen sat on the eggs.\"","her":"Belonging to that female. \"Give her the ball.\"","him":"That male person. \"Pass to him.\"","his":"Belonging to that male. \"His shoes were untied.\"","hit":"Strike forcefully with hand. \"She hit the ball with the bat.\"","hole":"Cavity that goes through something. \"There's a hole in my sock.\"","hook":"Curved piece to catch or hold things. \"Hang your coat on the hook.\"","hop":"Quick little jump. \"Bunnies hop with big back legs.\"","hot":"Having high temperature. \"The stove was hot and burned my hand.\"","how":"Question asking about a way. \"How can I help you?\"","hug":"Put arms around to embrace. \"Hug your little sister goodbye.\"","huge":"Of great size. \"An elephant is huge.\"","hut":"Small rough shelter. \"They stayed in a hut made of sticks.\"","ice":"Frozen water. \"We went ice skating on the frozen lake.\"","if":"Introducing a condition. \"I'll go swimming if it's hot out.\"","in":"Inside or within. \"The toys are in the closet.\"","into":"To inside or within. \"She jumped into the pile of leaves.\"","is":"Existing right now. \"Today is Monday.\"","it":"Used to refer to something. \"Where is it?\"","job":"A piece of work or task. \"My job is to feed the dog.\"","kick":"Strike forcefully with foot. \"I kicked the soccer ball down the field.\"","kid":"Young person, child. \"That kid is about my age.\"","legs":"Limbs used for standing and walking. \"My legs were tired after hiking.\"","less":"Smaller amount of something. \"Three is less than five.\"","let":"Allow or permit something. \"Let me try riding your bike.\"","light":"Brightness that lets you see. \"Turn on the light so it's not dark.\"","like":"Enjoy or appreciate. \"I like rainbows.\"","lime":"Sour green fruit. \"Key lime pie is tasty but tart.\"","lip":"Edge part of the mouth. \"She applied lip balm to soften her lips.\"","load":"Quantity carried at one time. \"The movers used a truck to load our furniture.\"","long":"Measuring great distance. \"A snake can grow very long.\"","look":"Use eyes to see. \"Look for shapes in the clouds.\"","lot":"Large number of things. \"She had lots of toys in her room.\"","low":"Not high up from the ground. \"The plane flew low over the water.\"","luck":"Events happening by chance. \"Wish me luck before the race!\"","mad":"Angry. \"Sara is mad when her brother takes her toys.\"","made":"Created or built something. \"Dad made me a bookshelf.\"","make":"Create, build or form something. \"Let's make a cardboard castle.\"","man":"Adult male person. \"That man is my teacher.\"","many":"A lot of something. \"So many stars in the sky!\"","map":"Picture showing places and their names. \"The map shows our town.\"","mat":"Piece put on floor for protection. \"Wipe feet to dry shoes on the mat.\"","may":"Possibly could, perhaps. \"It may rain this weekend.\"","men":"More than one adult male. \"Those men are firefighters.\"","mine":"Belonging to me. \"This blue bike is mine.\"","mob":"Large disorderly crowd of people. \"The mob of ants carried bread crumbs away.\"","mom":"Mother, female parent. \"My mom takes care of me.\"","moon":"Natural object orbiting Earth. \"The moon circles the Earth.\"","mop":"Tool for washing floors. \"Use the mop to clean the spills.\"","more":"Additional or extra. \"I ate one cookie and wanted more.\"","mug":"Drinking cup with handle. \"Hot chocolate is delicious in a big mug.\"","must":"Required, mandatory. \"You must try your best at school.\"","my":"Belonging to me. \"This toy is my favorite.\"","name":"Word by which someone is known. \"My name is Amanda.\"","nap":"Short period of sleep. \"The baby takes a nap each afternoon.\"","need":"Require something. \"All plants need water to live.\"","nest":"Bird's home up in a tree. \"The nest was carefully built with twigs.\"","nice":"Kind, good, pleasant. \"My teacher is really nice.\"","no":"Negative response, not any. \"There are no clouds in the sky.\"","nose":"Body part used for smelling. \"My nose runs when I have a cold.\"","not":"Expressing denial or refusal. \"Do not enter.\"","note":"Short written message. \"I wrote myself a note to buy milk.\"","now":"At the present moment. \"Eat lunch now, play later.\"","number":"An amount or quantity. \"Count to the number twenty.\"","nut":"Dry fruit with a hard shell. \"Squirrels hide nuts for winter.\"","of":"Relating to, belonging to. \"That box of crayons is mine.\"","oil":"Slippery liquid that doesn't mix with water. \"Olive oil is good for cooking.\"","on":"Touching the surface. \"The book is on the table.\"","one":"Single thing or person. \"I ate one cookie from the plate.\"","or":"Either one or the other. \"Would you like an apple or an orange?\"","other":"Different one. \"I'll wear those shoes and you wear the other ones.\"","out":"Outside. \"The kids played outside out of the house.\"","page":"One side of paper in a book or notebook. \"Turn the page to continue reading.\"","pan":"Metal pot for cooking foods. \"We baked a cake in a round pan.\"","part":"Piece or portion of something. \"This big sandwich is just part of my lunch.\"","pay":"Give money for items bought. \"I'll pay the cashier for my candy bar.\"","pen":"Writing tool that uses ink. \"Write neatly using your pen.\"","people":"More than one person. \"Many people visited the zoo.\"","pet":"Tame animal kept for enjoyment. \"My pet bunny lives in a cage.\"","pig":"Farm animal with snout that says oink. \"We saw pigs roll in mud to stay cool.\"","pin":"Pointed piece of metal. \"Use a pin to hang up the poster.\"","pit":"Hole or hollow area in something. \"There's a pit in the center of a peach.\"","play":"Take part in a sport or game. \"Let's go play on the swings.\"","plow":"Farm tool to turn soil over. \"The tractor will plow the fields.\"","pool":"Area of standing water for swimming. \"Let's swim in the pool.\"","pop":"Make a quick, bursting sound. \"The balloon popped loudly.\"","pot":"Cooking container made of metal or ceramic. \"The soup simmered in the pot.\"","race":"Running contest for speed. \"I won first place in the race!\"","ran":"Past tense of run. \"He ran down the street.\"","red":"Color of apples and fire trucks. \"Her dress was bright red.\"","rob":"Steal things illegally. \"The bank robber took the money.\"","rock":"Hard lump formed in nature. \"The lake had smooth rocks to skip.\"","roof":"Covering structure on top of building. \"Rain runs off the slanted roof.\"","roots":"Parts anchoring plant underground. \"The roots kept the tree upright in the wind.\"","rose":"Type of flower known for thorns and scent. \"He picked a red rose for his wife.\"","rug":"Woven floor covering made of fabric. \"Wipe feet on the rug by the door.\"","run":"Move with quick strides. \"I can run fast.\"","sack":"Large bag for holding things. \"The sack of potatoes was heavy.\"","said":"Past tense of say. \"She said hello to her friend.\"","sat":"Past tense of sit. \"I sat on the floor while playing blocks.\"","see":"Use one's eyes to perceive something. \"I can see words written on the chalkboard.\"","seed":"Small object that grows into new plants. \"The bird ate the seed from the ground.\"","sell":"Give or transfer goods for money. \"My friend will sell lemonade at the corner.\"","set":"Put something down. \"Set the plate gently on the table.\"","shake":"Jostle back and forth or up and down. \"Shake the present gently to guess what's inside.\"","she":"That female person or animal. \"She is my sister.\"","shell":"Hard protective cover of some creatures. \"We found a seashell along the sandy beach.\"","ship":"Large boat that transports people or goods by water. \"The ship sailed across the ocean.\"","shop":"Place where goods and services are sold. \"We stopped at the bike shop in town.\"","show":"Allow to be seen, display something. \"Let me show you my new toys!\"","shut":"Close something. \"Shut the door please and keep the cold air out.\"","shy":"Slow to begin or avoid others. \"The shy fawn hid behind its mother deer.\"","sick":"Unwell, not healthy. \"I feel sick with the flu and have to stay home.\"","sit":"Rest weight on bottom. \"Come sit next to me please.\"","skin":"Outer covering of an animal or human body. \"Use lotion so skin doesn't get too dry.\"","sky":"Space above the earth. \"Fluffy clouds floated across the blue sky.\"","sled":"Vehicle for sliding over snow or ice. \"We zoomed down hills on our sled.\"","snack":"Small amount of food eaten between meals. \"An apple makes a healthy snack.\"","snow":"Soft white flakes falling from sky. \"A foot of snow fell last night.\"","so":"Therefore, consequently. \"It was raining so we played inside.\"","soak":"Absorb liquid. \"The sponge will soak up the spill.\"","soap":"Cleaning product that makes bubbles. \"Use soap to wash hands.\"","sock":"Soft shoe worn on foot. \"Wear warm wool socks in winter.\"","soil":"dirt or earth. \"Worms burrow through damp soil.\"","some":"Amount that is not specific. \"Would you like some candy?\"","spin":"Turn in circles rapidly. \"The toy top will spin across the floor.\"","spoke":"Talked, said words. \"My friend spoke to me on the phone for an hour!\"","spoon":"Utensil with shallow bowl for scooping and lifting liquids. \"Stir sugar into your tea with a spoon.\"","spy":"Secretly watch others. \"We'll spy on our sister to see what her surprise is!\"","stay":"Continue in place, not leave. \"Stay in your seat until the teacher says to line up.\"","stick":"Thin piece of wood. \"We roasted marshmallows on sticks over the fire.\"","stood":"Past tense of stand, was upright. \"My sister stood on her tiptoes to see.\"","stop":"Cease movement. \"Stop at the corner and look for cars.\"","stuck":"Wedged or trapped so something cannot be moved. \"I got stuck in the tree until my dad helped me down.\"","suck":"Draw something in by vacuum force. \"Don't suck your thumb.\"","summer":"Warmest season between spring and autumn. \"We swim a lot in the summer.\"","sun":"Star at center of our solar system. \"The bright sun helps plants grow.\"","sure":"Definitely, without doubt. \"I'm sure I turned in my homework already.\"","tame":"Trained to be friendly with people. \"The horse is tame and likes people.\"","tap":"Lightly strike with finger or object. \"Tap your pencil if you need help.\"","tape":"Sticky flat material that binds things. \"Use tape to wrap the gift.\"","tell":"Say something to communicate information. \"I'll tell you a funny story.\"","ten":"Number coming after nine. \"I have ten fingers and ten toes.\"","than":"Introducing something being compared. \"This crayon box has more colors than that one.\"","that":"Referring to a certain one. \"That book is mine, not this one.\"","the":"That one. \"The dog barked at the cat.\"","their":"Belonging to them. \"Put their bags over there please.\"","them":"Those people. \"Give them the snacks please.\"","then":"Next, afterwards. \"First get dressed, then eat breakfast.\"","there":"In, at, or to that place or position. \"Put the cup there on the counter.\"","these":"Referring to certain ones close by. \"These stickers are mine to use.\"","they":"Referring to those people or animals. \"Where are they going?\"","thin":"Narrow in width or diameter. \"Pancakes cooking got thin in the middle.\"","this":"Referring to the one here. \"Can I play with this ball?\"","time":"Period during which something occurs. \"Story time is my favorite time of day.\"","to":"In the direction of somewhere. \"Let's go to the park.\"","took":"Past tense of take. \"She took the puppy home.\"","tooth":"Hard structures in mouth for chewing. \"Brush your teeth twice a day.\"","top":"Highest or uppermost point. \"The star goes on top of the Christmas tree.\"","tower":"Very tall, narrow building or structure. \"The tower was the tallest building in the kingdom.\"","town":"Small urban area with homes and businesses. \"Our town has a post office, church and town hall.\"","tray":"Flat container for carrying items. \"She balanced the tray of glasses carefully.\"","tree":"Tall plant with branches and leaves. \"The apple tree gives us fruit.\"","trip":"Go somewhere and return. \"We took a trip to the grandparents' house last weekend.\"","truck":"Large motor vehicle for transporting heavy loads. \"The moving truck carried our furniture.\"","try":"Attempt to do something. \"I will try my best.\"","two":"Number after one. \"I have two eyes to see.\"","up":"Toward a higher place. \"The balloon floated up into the sky.\"","use":"Utilize for some purpose. \"You use a pencil to write.\"","vote":"Choose between options to make a decision. \"We will vote for class president.\"","was":"Past tense of be verb is. \"Yesterday was fun!\"","water":"Clear liquid needed for life. \"We drink water when thirsty.\"","way":"Route for getting somewhere. \"This way is the fastest way home.\"","we":"Referring to oneself along with others. \"Will you play with we kids?\"","weather":"Conditions like rain or sun. \"The weather helps plants grow.\"","web":"What spiders spin to catch bugs. \"The spider's web caught flies.\"","well":"In good or proper way. \"You did well on your spelling test.\"","were":"Past tense of are. \"My friends were at school yesterday.\"","wet":"Covered or soaked with water or another liquid. \"The sidewalk was wet after the rain.\"","what":"Asking about something. \"What book are we reading today?\"","when":"At what time. \"When is lunch time?\"","which":"Asking about a choice. \"Which game should we play?\"","who":"Asking what person. \"Who wants a snack?\"","wig":"Fake hairpiece worn on head. \"The clown wore a funny green wig.\"","will":"Going to in the future. \"I will help you with your project.\"","win":"Be victorious, finish first. \"Our team will win the race!\"","wise":"Having much knowledge and good judgment. \"A wise elder gave helpful advice.\"","with":"Accompanying someone or something. \"Come play with us!\"","wood":"Hard material trees are made of. \"We burned wood in the fireplace.\"","words":"Things people say or write. \"I learned new words at school today.\"","would":"Used to talk about things that could happen. \"He told us he would be here soon.\"","write":"Put down words on paper. \"I will write a story about my summer.\"","you":"Referring to the person spoken to. \"Do you want to share?\"","your":"Belonging to you. \"Your book is on the floor.\""},{"able":"Having the skills needed. \"She is able to ride a bike.\"","acceptable":"OK or allowed. \"That behavior is acceptable here.\"","act":"Do something. \"I will act in the school play.\"","add":"Join things to increase. \"We can add more books to our collection.\"","addition":"The math operation of combining numbers. \"Three plus two is an addition problem.\"","adorable":"Very cute or sweet. \"The new puppy is so adorable.\"","affect":"To change or influence. \"The rain may affect our picnic plans.\"","after":"Later or following. \"We will play soccer after lunch.\"","again":"Another time, once more. \"Can you read me that story again?\"","age":"How old someone is. \"His age is seven years old.\"","ago":"In the past, before now. \"We went to the zoo long ago.\"","agreeable":"Willing to accept something. \"Tom was agreeable to sharing his toys.\"","air":"The mix of gases around us. \"The morning air was crisp and cool.\"","also":"In addition, too. \"I like pizza and I also like salad.\"","America":"The USA, from Canada to Mexico. \"America has 50 states.\"","animal":"A living creature that moves, like a dog. \"A horse is a large animal.\"","another":"One more, an extra. \"Can I have another cookie?\"","answer":"A reply or response. \"Do you know the answer?\"","any":"Some, even one. \"Do you have any candy?\"","apart":"Separate, not touching. \"The two books fell apart on the shelf.\"","apple":"Round fruit that is red, green or yellow. \"An apple a day keeps the doctor away.\"","apply":"Put on or submit a request. \"You need to apply glue to both sides.\"","argue":"Disagree or quarrel. \"Please do not argue, but talk nicely.\"","arms":"Upper limbs on the human body. \"He carried the books in his arms.\"","art":"Creative works like paintings or crafts. \"Her art project is very colorful.\"","ask":"Say a question to get information. \"May I ask a question?\"","attention":"Focus and be attentive. \"Please pay attention in school.\"","away":"Distant, at a distance. \"We drove away to the countryside.\"","baby":"A very young child. \"The baby slept in the crib.\"","badly":"Poorly, not doing well. \"She felt badly after falling down.\"","ball":"Round toy used in sports. \"We played catch with the ball.\"","bank":"Place to store money safely. \"I opened a savings account at the bank.\"","barn":"A farm building for animals and storage. \"The cows lived in the big red barn.\"","bath":"Washing the body in water. \"I took a nice warm bath and got squeaky clean.\"","beach":"Land along an ocean or lake shore. \"We built sandcastles at the beach.\"","bearable":"Able to accept, tolerate. \"The noise was just bearable enough for me to study.\"","beat":"Hit repeatedly to inflict pain. \"Please don't beat your little brother.\"","because":"For this reason, why. \"I came inside because it started raining.\"","before":"Earlier, prior to. \"Brush your teeth before bedtime.\"","belt":"Strip worn around the waist. \"He put on his seat belt before driving.\"","bend":"Curve or angle something. \"Be careful not to bend the card too much.\"","biggest":"Largest in size. \"An elephant is the biggest animal in the zoo.\"","bill":"Paper stating what money is owed. \"My dad paid the water bill online.\"","birth":"When someone is born. \"His birth day is March 17.\"","blank":"Empty space with nothing written. \"Please fill in the blank on the form.\"","blast":"Sudden loud noise. \"The loud horn let out a blast when the ship left port.\"","blue":"A primary color like the sky. \"That crayon is colored blue.\"","body":"A person or animal's physical self. \"I used soap to wash my whole body.\"","bolt":"A fastener that screws into a nut. \"The loose bolt caused the machine to wobble.\"","bones":"Hard parts inside that form the skeleton. \"My bones help me stand up straight and tall.\"","box":"Container often made of cardboard. \"I keep my toys tidied up in a box.\"","boxes":"More than one box. \"Those large moving boxes are very heavy.\"","boy":"A young male person. \"'Boy, stop running in the hallway!'\" said the teacher.","bravely":"With courage, not afraid. \"The hero acted bravely, saving the cat from the fire.\"","bravest":"Most courageous. \"The soldier was the bravest man in the troop.\"","bread":"Food made from flour. \"We made sandwiches with bread.\"","break":"Split into pieces. \"Be careful not to break the glass vase!\"","breath":"Air taken into lungs. \"I was out of breath after running.\"","brew":"Heat liquid to extract flavor. \"We brewed coffee by steeping ground beans in hot water.\"","bright":"Full of light, shining strongly. \"The bright sunshine hurt my eyes.\"","brightest":"Very intense, glowing. \"The flashlight was the brightest of all.\"","brightness":"The quality of being luminous. \"I adjusted the brightness on my device.\"","bring":"Take an object to a place or person. \"Please bring your permission slip to school.\"","brushes":"Cleans by rubbing or sweeping. \"I brush my hair and teeth daily.\"","build":"Construct by putting parts together. \"Let's build a tower out of blocks!\"","built":"Constructed, made functional. \"My dad built our house himself.\"","bump":"Knock or hit with force. \"Don't bump your head on the low ceiling.\"","burn":"Damage something with fire. \"The food will burn if you don't stir it.\"","bushes":"Short, woody plants. \"Blueberries grow on small bushes.\"","came":"Arrived, showed up. \"My cousins came over to visit.\"","camp":"Temporary lodging outdoors. \"We camped in tents during our hike.\"","car":"Motor vehicle with four wheels. \"We drove to grandma's in our car.\"","card":"A stiff paper rectangle for messages. \"I sent her a birthday card in the mail.\"","care":"Be concerned about something. \"I care about you and want you to feel better.\"","careful":"Cautious to avoid danger. \"Be careful with those scissors please!\"","case":"An container or event. \"The saxophone is kept safe in its case.\"","cast":"Throw out, send forth. \"The boy could cast his fishing line far out into the water.\"","cause":"Reason why something happened. \"Cold weather can cause people to get sick.\"","cents":"100 cents make $1 dollar. \"This candy costs 75 cents.\"","change":"Become different. \"Caterpillars change into butterflies.\"","chant":"Say or shout repeatedly. \"The crowd chanted the team's name.\"","chart":"Table, graph or diagram. \"The height chart showed how tall I was.\"","check":"Look over carefully for mistakes. \"Please check your work.\"","chew":"Bite and mash food with teeth. \"Chew your food slowly and do not gulp it down.\"","chewable":"Safe to chew, not a choking hazard. \"This chewable vitamin tablet tastes like oranges.\"","circle":"Round plane figure that has no corners. \"Draw a big circle on the paper.\"","citizen":"Person living in a place with rights there. \"A good citizen follows laws and helps others.\"","clamp":"Device used to hold things tightly together. \"We used a large clamp to fix the shelves to the wall.\"","clean":"Free of dirt, tidy. \"I like my room nice and clean.\"","clerk":"Store worker who helps customers. \"The grocery clerk helped me find the bread.\"","cling":"Hold on tightly, stick to something. \"The baby monkey clung to its mother tightly.\"","cloth":"A pliable woven textile or fabric. \"I dusted with a soft cloth.\"","clue":"Hint or evidence about something unknown. \"The footprints were a clue to what animal passed by.\"","clump":"Lump or cluster together. \"Wet sand will clump if you squeeze it in your fist.\"","coin":"Round, flat money made of metal. \"I got a dime coin in my change at the store.\"","cold":"Having little warmth, chilly. \"The cold wind made me shiver.\"","color":"A hue, like red or green. \"My favorite color is yellow.\"","colt":"A young male horse under 4 years old. \"The colt frolicked playfully around his mother.\"","comfortable":"Cozy, relaxing, peaceful. This chair is really comfortable for reading books.\"","community":"Group sharing things like values or space. \"Our school community planted a garden together.\"","compass":"Navigation tool indicating directions. \"We used a compass so we wouldn't get lost hiking.\"","confusion":"Lack of clarity or understanding. \"There was confusion about the test date.\"","consumer":"A person who buys goods or services. \"My mom is a smart consumer and compares prices.\"","context":"Words and phrases near a statement. \"If you ignore the context, words can be misunderstood.\"","cook":"Prepare food for eating. \"My dad will cook hamburgers on the grill.\"","cool":"Slightly cold. \"This lemonade is cool and refreshing.\"","core":"The centermost part. \"An apple core has seeds in its core.\"","corn":"Tall plant grown for food. \"We grilled sweet corn at the barbecue.\"","cost":"The price you pay for something. \"This toy cost 5 dollars.\"","couches":"Upholstered furniture for reclining. \"Our couches are comfortable to lounge on.\"","cough":"Force air out sharply with a harsh sound. \"Smoke made me cough and wheeze.\"","count":"Say numbers in order. \"I will count out loud to one hundred.\"","country":"Land under a government. \"Canada is a large country that has ten provinces.\"","cows":"Adult female cattle. \"The cows grazed peacefully in the meadow.\"","craft":"Handmade skill or occupation. \"Making pottery is an artistic craft.\"","curl":"Form into a spiral or coil. \"Her hair naturally curls at the ends.\"","curve":"Bend without sharp corners. \"The road had a dangerous curve ahead.\"","cycle":"A series of events that repeats. \"Night and day is a regular cycle.\"","daily":"Happening each day. \"I take medicine daily, once every morning.\"","dark":"Having little light. \"At night it got very dark outside.\"","darkness":"Absence of light, gloom. \"The darkness made it hard for me to see.\"","dash":"Quick run or short splash. \"I made a mad dash through the rain to the car.\"","dashes":"More than one dash. \"The Morse code message had dots and dashes.\"","date":"Day, month and year identified. \"Today's date is December 15, 2022.\"","dead":"No longer living. \"Unfortunately, the goldfish was dead when we found it.\"","deal":"Agree to something or cope with something. \"Let's make a deal to take turns choosing games.\"","death":"End of life. \"Dinosaurs faced death and extinction long ago.\"","desk":"Furniture piece for working. \"I did my homework at my desk last night.\"","detective":"Person who investigates crimes. \"The detective gathered clues to solve the mystery.\"","direction":"The course or path to follow. \"Can you tell me which direction is north?\"","dirt":"Dust, soil or grime. \"My uniform got dirt on it when I slid into home base.\"","discussion":"Talk about something together. \"We had a discussion about recycling in class.\"","dish":"Plate or shallow bowl for serving food. \"We ate pasta from a large round dish.\"","dishes":"Plates, bowls, cups. \"Please help dry the dishes after dinner.\"","disk":"Thin, flat, circular object. \"The cat batted the shiny metal disk across the floor.\"","distance":"Amount of space between things. \"There was a long distance between towns out west.\"","division":"Separating into parts or groups. \"In math we learned how to do division problems.\"","dock":"Place for ships and boats to load or unload. \"The big cruise ship pulled into the crowded dock.\"","does":"To carry out an action. \"The janitor does a lot of cleaning work.\"","dollars":"U.S. money or currency. \"This toy costs twenty dollars.\"","done":"Completed or finished something. \"I am done with my project now.\"","door":"Movable barrier allowing entrance. \"Open the door slowly so it won't squeak.\"","dough":"Thick, malleable baking mixture. \"We shaped dough into pretzels before baking.\"","drank":"Swallowed liquid. \"She drank a big glass of lemonade.\"","draw":"Sketch or depict with pen or pencil. \"I will draw a picture of our house.\"","dream":"Experience adventures while sleeping. \"I had a strange dream about a magical forest.\"","dreamer":"One who imagines or desires something. \"She was a day-dreamer during class.\"","drew":"Past tense of draw. \"Yesterday she drew a beautiful portrait.\"","drift":"Float slowly without control. \"The balloon drifted off into the sky.\"","drink":"Take liquid into your mouth. \"May I please have a drink of juice?\"","dryer":"Machine that removes moisture from clothing. \"After washing, our clothes go in the dryer.\"","due":"Expected at a certain time. \"My library book is due next Tuesday.\"","ears":"Organs on the head that allow hearing. \"My ears help me listen to music.\"","eat":"Consume food for nourishment. \"I eat fruits, vegetables, grains and protein to stay healthy.\"","echo":"Repetition of a sound. \"We yelled into the canyon and heard an echo.\"","edge":"The end or limit of something. \"Be careful not to fall off the cliff edge!\"","education":"Process of gaining knowledge by studying. \"A good education is important.\"","eggs":"Ovals females of birds, reptiles, fish and insects produce. \"Chickens lay eggs we cook for breakfast.\"","end":"The concluding part. \"This is the end of the story.\"","enough":"As much as required. \"I have enough pencils for everyone to use one.\"","equal":"The same in amount or value. \"Three plus three equals six.\"","even":"Flat and smooth. \"The table has an even, level surface.\"","event":"A significant happening. \"Going to the zoo was a fun event.\"","ever":"At any point in time. \"This is the tallest building I've ever seen!\"","explosion":"A loud blast. \"The explosion could be heard for miles around.\"","eyes":"Organs that allow vision. \"My eyes are brown.\"","face":"Front of the head. \"I washed my face and brushed my teeth.\"","fair":"Treating people equally. \"We took turns to be fair.\"","fall":"Descend down from a height. \"In autumn, leaves fall from trees.\"","far":"Distant, not near. \"My house is far from school.\"","farm":"Land and buildings to grow crops and raise animals. \"The farm had horses, chickens and rows of vegetables.\"","fast":"Quick, rapid pace. \"I rode my bike very fast down the hill.\"","fastest":"Most speedy. \"My dog is the fastest runner in the whole neighborhood!\"","fear":"Being afraid or scared. \"Loud noises give me fear.\"","feather":"Light, flat growth on wings and bodies of birds. \"The goose had big white feathers.\"","feet":"Plural of foot. \"I have two feet and ten toes.\"","felt":"Soft cloth made by pressing fibers together. \"My mittens are made of warm wool felt.\"","fern":"Flowerless, seed bearing plants. \"The forest floor was covered in green ferns.\"","few":"Small number of something. \"I only ate a few fries, not all of them.\"","fiction":"Made up, not factual stories. \"The wizard battling a dragon is complete fiction.\"","fig":"Sweet purple fruit that grows on trees. \"We picked ripe figs in the orchard.\"","fight":"Argue or struggle against. Don't fight with your sister.\"","find":"Discover or locate something. \"I hope we can find our lost dog soon.\"","fire":"Burning fuel and gases. \"The campfire kept us warm all night.\"","fish":"Water creatures with gills. \"We caught a big fish at the lake.\"","flat":"Smooth, level surface. \"Kansas prairie is very flat.\"","flight":"Trip in an aircraft or spaceship. \"The flight to Paris takes 8 hours.\"","flutter":"Flap wings rapidly. \"The butterfly's wings fluttered slowly.\"","flyer":"One who travels by air, aviator. \"The brave flyer piloted alone across the Atlantic.\"","fold":"Bend over on itself. \"Please fold your hands in your lap.\"","food":"Edible nutritious substances. \"Pizza is my favorite food!\"","force":"Strength or power. \"Magnets have a strong magnetic force.\"","forgetful":"Having poor memory. \"I am quite forgetful and missed my appointment.\"","form":"The shape or structure of something. \"A spider web has a circular form.\"","found":"Discovered something. \"I found a shiny new penny on the ground.\"","four":"The number after three. \"I have four brothers.\"","fourth":"Coming after third. \"I came in fourth place in the race.\"","foxes":"Plural of fox, small wild canines. \"The red foxes lived in dens underground.\"","freedom":"The right to make your own choices. \"In some places, people fight for freedom.\"","fruit":"Sweet, edible produce from plants. \"Apples are my favorite fruit!\"","fuel":"A material burned to create power. \"Gasoline is a type of fuel for cars.\"","full":"Containing as much as possible. \"Her glass was full of lemonade.\"","funnel":"Tool to help pour liquid into a small opening. \"We used a plastic funnel to add oil to the engine.\"","funniest":"Most humorous. \"That joke was the funniest!\"","gave":"Handed over to someone else. \"My mom gave me a slice of cake.\"","germ":"Tiny organism that causes disease. \"Washing your hands kills harmful germs.\"","gift":"Something nice that is given. \"I received many lovely gifts for my birthday.\"","girl":"Female child. \"The little girl wore a blue dress.\"","give":"Present or hand over to another. \"I will give you this pencil to use.\"","gladly":"With happiness or gratitude. \"I will gladly help clean up after dinner.\"","glass":"Hard, transparent material that can break. \"Please don't knock over that glass vase.\"","glue":"Sticky paste to bond things. \"We used white glue to make our art collages.\"","gold":"Yellow precious metal. \"The winner's medal is made of real gold.\"","gone":"Departed, no longer present. \"After the show was over, the circus was gone.\"","goodness":"Being good, moral and just. \"Thank goodness you are alright after the accident.\"","goods":"Things that can be sold. \"The ship carried valuable goods like tea and spices.\"","got":"Obtained or received something. \"I got new markers for my birthday.\"","graph":"Chart or diagram showing data. \"The graph displayed rainfall over 12 months.\"","grateful":"Thankful and appreciative. \"We are grateful for your help.\"","gravity":"Force that pulls objects toward each other. \"Gravity keeps my feet on the ground.\"","great":"Very good. \"You did a great job on your science fair project!\"","greater":"More excellent or superior. \"The blue whale is greater in size than dolphins.\"","grew":"Developed and increased through natural process over time. \"The oak tree grew very tall in 50 years.\"","group":"Collection of people or objects. \"Our group met at the library to study.\"","growth":"Process of increasing and developing. \"The town saw much new growth and construction.\"","guess":"Try to answer without knowing for sure. \"Let me guess - is your favorite food pizza?\"","guide":"Lead or direct someone. \"The usher will guide you to your theater seats.\"","hand":"Body part at the end of your arm with fingers for grasping. \"I used my right hand to throw the ball.\"","happiness":"Feeling joy and contentment. \"Laughter brings me happiness.\"","hard":"Solid, firm, stiff. \"The sidewalk was cold and hard to sit on.\"","head":"Uppermost body part, above the neck. \"I have brown hair and green eyes on my head.\"","height":"Tallness, from bottom to top. \"The bookshelf was over my height so I couldn't reach the top shelf.\"","help":"Assist, aid, make easier. \"May I help you carry that heavy box?\"","helpful":"Giving help, useful. \"The tutors were very helpful in explaining the hard math problems.\"","helpfulness":"Quality of providing assistance. \"We appreciate your helpfulness - thank you!\"","herd":"A large group of animals. \"A herd of buffalo roamed across the plains.\"","here":"this place. \"Here is the book you asked for.\"","hero":"Person noted for brave deeds. \"The brave firefighter was a true hero, rescuing the little kitten.\"","hexagon":"Flat shape with six equal straight sides. \"A hexagon has six corners and angles.\"","hill":"Raised area of land, smaller than a mountain. \"It was a steep hill to pedal up on my bike.\"","himself":"Refers back to a male person previously mentioned. \"The prince dressed himself in his royal robes.\"","hold":"Grasp or grip firmly. \"Please hold my hand when we cross the street.\"","holiday":"Special day of festivity or celebration. \"My favorite holiday is my birthday party.\"","home":"Where someone lives. \"I was glad to return home after our long vacation.\"","honk":"Loud noise like a goose or horn. \"We heard geese honking overhead as they migrated north.\"","hopeful":"Feeling optimistic. \"I am hopeful the weather stays nice for our hike.\"","hour":"Unit of time equal to 60 minutes. \"Cartoons are on TV for one hour every Saturday.\"","house":"Building where people live. \"I live in a yellow house on Oak Street.\"","hush":"Be very quiet. \"Hush everyone! The show is starting!\"","jar":"Glass container used to preserve foods. \"We stored jam in a jar for the winter.\"","jolt":"Sudden shock or surge. \"The rollercoaster took off with a jolt!\"","joyful":"Feeling great happiness. \"The children were joyful when school was cancelled.\"","just":"Exactly, precisely. \"I arrived just in time for dinner.\"","key":"Metal tool to open locks. \"Use this key to open the front door.\"","kind":"Friendly, generous, nice. \"My teacher is kind and helps me learn.\"","kindness":"Quality of being nice and thoughtful. \"Random acts of kindness make the world better.\"","king":"Male ruler of a kingdom. \"The king wore a golden crown and cape.\"","knew":"Was aware of something in the past. \"I knew the answer to that quiz question.\"","know":"Have awareness or understanding. \"I know how to spell my name.\"","land":"Ground or soil. \"They got off the boat and returned to dry land\"","large":"Big in size, not small. \"An elephant is a large animal.\"","last":"At the end, final. \"I was the last runner to cross the finish line.\"","late":"After expected time. \"I was late to school because I missed the bus.\"","laugh":"Make sounds when amused. \"The puppy made me laugh by chasing its tail.\"","lava":"Hot fluid molten rock from volcanoes. \"The red hot lava flowed from the erupting volcano.\"","law":"Rules made by government. \"There is a law that says we must stop at red traffic lights.\"","lay":"Put or place something down flat. \"Please lay your book on the desk.\"","lead":"Guide others, show the way first. \"Our tour guide will lead us on our museum visit.\"","learn":"Gain knowledge through study or experience. \"We learned about cities, states and maps in geography class.\"","led":"Provided guidance by walking ahead of. \"The crossing guard led us safely across the intersection.\"","left":"On the side that is west when facing north. \"My house is on the left side of the street.\"","length":"Measurement or extent from end to end. \"What is the length of this room?\"","letter":"Alphabet character representing sound. \"The letters C-A-T spell cat.\"","lie":"Say something untrue. \"I will not lie, lying is wrong.\"","life":"Period between birth and death. \"Eating healthy foods can prolong your life.\"","lift":"Raise up to a higher position. \"Please lift up the corner while I vacuum under it.\"","likable":"Easy to like. \"My friend Jo is so likable, everyone enjoys her company.\"","likeness":"Resemblance or similarity. \"I can see a family likeness between those two sisters.\"","line":"Straight row. \"Please stand in a single file line.\"","liquid":"Not solid or gas, able to flow freely like water. \"This liquid soap makes lots of bubbly lather.\"","listen":"Pay attention to in order to hear. \"When someone is talking, it's polite to listen.\"","little":"Small size. \"That table is too little for our TV.\"","live":"Be alive, exist. \"Fish live in rivers, lakes and oceans.\"","location":"Where something is, place. \"What is your current location or address?\"","lock":"Fastener operated by a key. \"Secure buildings have locks on all doors and windows.\"","loft":"Upper room or level of a barn or warehouse. \"The loft had a nice view looking out over the countryside.\"","lost":"Unable to find one's way. \"I got lost in the huge museum and couldn't find my parents!\"","loud":"Making much noise or sound. \"The orchestra played very loud at the concert climax.\"","loudest":"Making the most noise. \"The fire engine siren was the loudest sound I'd ever heard.\"","loudly":"With a lot of volume. \"The baby cried loudly when he was hungry.\"","lovable":"Endearing, easy to care about. \"My pet rabbit Fluffy is so affectionate and lovable.\"","love":"Feel great affection for someone or something. \"I love sunny summer days at the beach.\"","madly":"Angrily or frantically. \"The bees buzzed around madly after we disturbed their nest.\"","magnet":"Object that attracts iron or steel. \"The magnet stuck firmly to the refrigerator door.\"","mail":"Letters, packages delivered to homes. \"I'm excited for new mail on my birthday!\"","mammal":"Warm-blooded vertebrate animal that produces milk to feed young. \"Dogs, humans, and whales are mammals.\"","march":"Walk with organized steady steps, often in a parade. \"We'll march in the town parade on July 4th.\"","mask":"Covering worn over part of face. \"The doctor wore a protective mask and gloves.\"","math":"Arithmetic, numbers. \"We learned how to add fractions today in math class.\"","me":"Myself, the speaker. \"Their dog bit me!\"","mean":"Define, describe, intend. \"What do you mean by that?\"","means":"Method or course of action used to accomplish something. \"Hard work and determination are the means to success.\"","meat":"Food from animal flesh. \"We grilled chicken meat on skewers over the campfire.\"","meet":"Encounter someone for the first time. \"I was happy to meet the new student.\"","melt":"Turn from solid into liquid when heated. \"The hot sun will melt the snowman.\"","messes":"More than one mess. \"Please clean your room, clothes are strewn in messy messes everywhere!\"","method":"Systematic procedure or process. \"Here is an easier method to solve this math problem.\"","might":"Possibility or uncertain chance something may happen. \"It might rain today so bring an umbrella just in case.\"","mile":"Unit of distance equal to 1,760 yards. \"Our house is ten miles from grandma's.\"","mind":"Your brain and thoughts. \"Use your mind to solve the math problem.\"","minute":"60 seconds of time. \"Only one minute until recess starts!\"","model":"Small replica or example for study. \"The model car was an exact copy of the real racecar.\"","mold":"Hollow container giving shape or form. \"We poured the liquid metal into the sword mold.\"","money":"Currency, coins, bills and checks. \"My mom paid with a ten dollar money bill.\"","months":"Plural of month. \"There are 12 months in one year.\"","monument":"Memorial statue or building. \"The tall stone monument honored soldiers lost in battle.\"","most":"Greatest amount. \"Most people like chocolate ice cream best.\"","moth":"Insect with large feathered antennae and wings. \"The moth was attracted to the light of the lamp post.\"","mother":"Female parent. \"I made a card for my mother on Mother's Day.\"","mouth":"The opening used to take in food. \"I brushed my teeth this morning with my toothbrush and toothpaste until my mouth was minty fresh.\"","move":"Shift from one area to another. \"It's tough to move to a new home in a new town.\"","much":"Great in amount or quantity. \"I didn't eat much dinner because I snacked a lot.\"","multiply":"Increase number rapidly. \"Rabbits multiply and have big families very quickly!\"","neck":"Part of body between head and shoulders. \"The necklace hung around her neck.\"","nerve":"Bundle of fibers carrying signals to and from the brain. \"I was so nervous I felt it in the pit of my stomach - I had butterflies in my nerves!\"","new":"Fresh, not existing before. \"I got a new bike for my birthday!\"","nurse":"Person trained to care for sick people. \"When I don't feel well my mom takes care of me just like a nurse.\"","observe":"To watch carefully. \"I like to observe birds for fun.\"","ocean":"A huge body of salt water. \"Whales live in the ocean.\"","off":"Not on, switched off. \"The light was off so the room was dark.\"","offend":"To insult or hurt feelings. \"I did not mean to offend anyone.\"","oh":"Exclamation showing surprise. \"Oh, I didn't know it was your birthday today!\"","old":"Having lived or existed for many years. \"My grandfather is very old.\"","only":"Just or solely. \"These candies are only for you.\"","oral":"Spoken rather than written. \"We had to give an oral presentation in class.\"","our":"Belonging to us. \"This is our house.\"","outcome":"Result or consequence. \"The outcome was better than expected.\"","over":"Above or covering. \"The plane flew over the rainbow.\"","pack":"To fill into a case. \"Let's pack our lunches for the trip.\"","paid":"You were given money. \"Dad paid for my lunch today.\"","pain":"Hurt or suffering. \"My throat has a bad pain.\"","painful":"Causing discomfort or distress. \"It was painful when I fell off my bike.\"","paint":"Colorful liquid for art. \"I will paint a nice picture.\"","painter":"One who creates paintings. \"Picasso was a famous painter.\"","pair":"Two matching or related. \"I have one pair of red shoes.\"","paragraph":"A section of writing with related sentences. \"My essay had five paragraphs.\"","parent":"A father or mother. \"My parent drove me to school.\"","park":"An outdoor place to visit. \"Let's have a picnic at the park.\"","part":"A piece or portion. \"I ate part of the pizza.\"","pass":"Go by something. \"We'll pass the library on our walk.\"","past":"Gone by before now. \"That happened in the past, long ago.\"","patch":"A small piece of material covering a spot. \"There was a patch on the worn knees of his jeans.\"","path":"A trail to walk on. \"The path led into the dark woods.\"","peak":"The top point of a mountain. \"We hiked to the peak and enjoyed the view.\"","pen":"A tool for writing in ink. \"I signed my name with a pen.\"","pentagon":"A shape with five straight sides. \"The stop sign has the shape of a pentagon.\"","picture":"A painted or photographic image. \"This lovely picture hangs on my wall.\"","pin":"A piece of metal with a point. \"Use this pin to hang up your drawing.\"","place":"A physical location. \"My favorite place is the playground.\"","plan":"An organized idea or method. \"Let's make a plan for our party.\"","plane":"A vehicle that flies. \"We traveled on an plane to visit grandma.\"","point":"To aim a finger toward something. \"Let me point out the window at that bird.\"","pole":"A long, tall stick. \"The flag waved from the tall pole.\"","port":"A town or city with a harbor. \"The ship sailed back to port before the big storm hit.\"","pot":"A metal container for cooking. \"She cooked soup in a big metal pot on the stove.\"","power":"Strength or force. \"Electricity gives a light bulb its power.\"","prediction":"A forecast or estimate of the future. \"My prediction is that it will be sunny tomorrow.\"","prefix":"Letters placed before the root of a word. \"The prefix un- means not.\"","pride":"Satisfaction from one's abilities or achievements. \"She takes pride in her drawing skills.\"","problem":"An issue that needs solving. \"This math problem is tricky to figure out.\"","producer":"One who creates a movie or play. \"Steven Spielberg is a famous Hollywood producer.\"","proud":"Feeling pleased about an achievement. \"My parents are proud that I learned to ride a bike.\"","proudly":"With pride and self-respect. \"She proudly received her first place trophy.\"","pull":"To use force to move toward you. \"Let's all pull on this big rope together.\"","purse":"A small bag for carrying money. \"Grandma kept mints in her purse for me.\"","push":"Use force to move something away. \"Let me push the toy truck over here.\"","put":"To place or set something down. \"Be sure to put on sunscreen before going out.\"","quack":"The sound a duck makes. \"I fed breadcrumbs to the ducks at the pond and heard them quack.\"","question":"A sentence that asks something. \"Please raise your hand if you have a question.\"","quick":"Moving fast, not slow. \"She is a quick runner and wins every race.\"","quickly":"At a fast pace. \"She ran quickly to catch the bus.\"","raft":"A floating platform made of logs. \"We sailed the raft down the river.\"","rain":"Water falling from clouds. Rain helps plants grow nice and tall.\"","raw":"Uncooked or unprocessed. \"Vegetables taste best when fresh and raw.\"","read":"To look at words and understand them. \"I like to read adventure stories at bedtime.\"","record":"To write down information. \"Let me record how many books I've read this year.\"","recreation":"Fun leisure activities. \"Swimming is my favorite recreation in summer.\"","rectangle":"A 4-sided shape with 4 right angles. \"A door is often in the shape of a rectangle.","red":"A primary color. \"Red is the color of apples and strawberries.\"","report":"An account about an event or topic. \"For homework I have to write a report about Abraham Lincoln.\"","rest":"Relax or rejuvenate. \"After lunch I'll rest for half an hour before chores.\"","resource":"A supply that provides benefit. \"We used online resources to do research.\"","rich":"Having a lot of money and possessions. \"The rich king lived in a huge palace.\"","ride":"Travel or be carried in a vehicle. \"My mom gave me a ride to school.\"","right":"Correct or proper. \"I gave the right answer during the quiz.\"","ring":"A circular band worn on the finger. \"Her ring had a sparkling diamond.\"","rise":"Go upward. \"Hot air rises, which makes balloons float.\"","road":"Path for traveling by vehicles or on foot. \"There are many cars on the road.\"","room":"A place in a house, like a bedroom or kitchen. \"A room has four walls, a floor, and a ceiling.\"","root":"Part of a plant under the ground. \"Carrots grow long orange roots underground.\"","rope":"Sturdy, thick cord. \"We tied up the boat using nylon rope.\"","rotate":"Turn around on an axis or center point. \"I used the handle to rotate the crank.\"","rough":"Not smooth. \"The wood was rough with splinters.\"","round":"Shaped like a ball or circle. \"The quarter is a small, round coin.\"","row":"A line of things. \"There is a row of students sitting at the cafeteria table.\"","rural":"In the countryside. \"They lived in a rural area with farms.\"","rushes":"Tall grass plants. \"The rushes grew along the pond edge.\"","sadly":"Unhappily. \"She sadly cried when her toy broke.\"","sail":"A ship's large fabric sheet to catch wind. \"The sail filled with air and moved the boat.\"","salt":"A white powder used to flavor food. \"We put salt on french fries.\"","same":"Exactly alike. \"My brother and I have the same color eyes.\"","sand":"Tiny grains found on beaches. \"We built sand castles at the beach.\"","saw":"To cut with a tool. \"My dad sawed wood with his power saw.\"","say":"To speak words. \"I will say hello when you arrive.\"","scale":"Graduations for measuring. \"The scale goes up to 200 pounds.\"","search":"To look for something. \"Let's search our room for lost toys.\"","seasons":"Times of the year like summer or winter. \"There are four seasons in the year.\"","seat":"A place to sit down. \"Please find your seat on the bus.\"","second":"The one right after first. \"She came in second place in the race.\"","seeds":"A plant's baby or start. \"These seeds will grow into tomatoes.\"","seen":"Viewed before. \"I've seen that movie already.\"","select":"To choose. \"Please select your favorite flavor of ice cream.\"","send":"To mail or deliver. \"I will send you a postcard from my trip.\"","sent":"Already mailed or delivered. \"I sent you a birthday card yesterday.\"","serve":"To give or distribute. \"May I serve you more mashed potatoes?\"","services":"Helpful tasks done. \"The plumber provides repair services.\"","seven":"The number after six. \"There are seven days in one week.\"","shape":"The form of something. \"Their yard is in the shape of a circle.\"","share":"To let others have some. \"Please share your toys with your sister.\"","shark":"A large ocean fish. \"The girl was scared of the shark at the aquarium.\"","shift":"To change or move. \"We'll shift the furniture to vacuum the rug.\"","shirt":"A top made to be worn. \"He spilled juice on his new shirt.\"","short":"Not tall. \"That boy is rather short for the basketball team.\"","shortest":"Least tall. \"My little sister is the shortest kid in her class.\"","should":"Ought to. \"You should always wear your seat belt.\"","shout":"To yell loudly. \"Please don't shout, use your inside voice.\"","shrink":"To get smaller. \"Wool clothes will shrink if washed in hot water.\"","sickness":"Ill health. \"Stay home from school if you have a sickness.\"","side":"An edge or border. \"Our house is on the left side of the road.\"","sift":"To strain powder through a sieve. \"We sifted flour to make the cake.\"","sight":"The power of vision. \"Losing my sight would be difficult.\"","silliest":"Very funny. \"That was the silliest joke I've ever heard!\"","simple":"Easy, not complex. \"Just follow these simple baking directions.\"","sing":"To make musical sounds. \"I like to sing along with the radio.\"","singer":"Someone who sings. \"Taylor Swift is a talented singer.\"","sink":"A basin to wash up at. \"I brushed my teeth at the bathroom sink.\"","six":"The number after five. \"I have six colored markers to use.\"","sizable":"Fairly large. \"We caught a sizable fish at the lake.\"","size":"How big around something is. \"These shoes are the right size for me.\"","skip":"To hop or leap. \"Let's skip stones across the pond.\"","sling":"A hanging band. \"His injured arm rested in a sling.\"","sloth":"A slow tree animal. \"The sloth clung upside down from the branch.\"","slowest":"Most sluggish. \"Of all the racers, the turtle was the slowest.\"","slush":"Partly melted snow. \"Our boots splashed in the slushy puddles.\"","small":"Little in size. \"I started reading when I was small.\"","smartest":"Most intelligent. \"Our teacher is the smartest person I know.\"","snack":"A light, small meal. \"We packed nutritious snacks for our road trip.\"","soft":"Smooth and pleasant to touch. \"This blanket feels nice and soft.\"","softest":"Very smooth and velvety. \"These slippers are the softest I've ever worn.\"","softly":"With gentle sound. \"Speak softly and use your indoor voice please.\"","soil":"Dirt or earth. \"We will grow flowers in this rich soil.\"","sold":"Exchanged for money. \"All the cookies were sold by lunchtime.\"","solid":"Hard, firm and dense. \"This table is made from solid wood.\"","song":"A musical composition. \"I really enjoy that catchy pop song.\"","soon":"In a short time. \"We'll be leaving soon to go to grandma's.\"","sound":"Something that can be heard. \"I woke up to the sound of birds chirping.\"","speak":"To say words out loud. \"Please speak one at a time during our discussion.\"","speaker":"A person talking. \"The guest speaker taught us about honesty today.\"","spell":"Write or say letter by letter. \"I know how to correctly spell my full name.\"","sport":"A game or competition. \"Soccer is my favorite sport to play after school.\"","spot":"A location. \"Let's meet at the big tree - that's our usual spot.\"","spread":"To cover over an area. \"Butter spreads easily onto warm toast.\"","spring":"When plants begin growing. \"Baby animals are born in the spring.\"","square":"A 4-sided shape with equal sides. \"I cut the cake into five equal squares.\"","stack":"To pile up. \"Let's stack up these blocks into a tall tower.\"","stages":"Periods during a process. \"Butterflies go through several life stages.\"","stamp":"A small sticker put on a letter or package. \"You need to add a postage stamp before mailing this.\"","starch":"A food thickener. \"Using starch makes this sauce nice and thick.\"","step":"To move your foot. \"Please don't step on my homework pages!\"","stew":"A chunky soup. \"Grandma simmered beef stew on the stove all afternoon.\"","still":"Not moving. \"Try to sit very still for this photo please.\"","stilt":"A pole worn to walk high up. \"It was tricky to balance on stilts at first.\"","sting":"To prick or wound. \"That nasty bee really stung my arm!\"","stink":"To have a very bad smell. \"Those dirty socks really stink - whew!\"","store":"A shop. \"We buy our groceries at the store around the corner.\"","straw":"A dried shaft of grain. \"I sipped iced tea through a plastic straw.\"","string":"A long piece of twisted thread. \"We tied the bundle with rough brown string.\"","study":"To read and memorize. \"I need to study my notes before the test Friday.\"","stump":"The base of a cut tree. \"We rested on the mossy old tree stump in the woods.\"","subtract":"To take away, remove. \"If you subtract two from ten the answer is eight.\"","subtraction":"Taking an amount away. \"Learning subtraction was tricky but I understand it now.\"","suburban":"Near but outside a city. \"Many families live in quiet suburban neighborhoods.\"","such":"Like that, similar to. \"I've never seen such a cute baby kitten!\"","suffix":"Letters added to the end of a word. \"When you add '-ed', that's the past tense suffix.\"","sun":"The star that's center of our solar system. \"We get heat and light from the bright sun.\"","sweat":"Moisture exuded through skin. \"I was dripping in sweat after running hard in gym class.\"","swift":"Very quick, rapid. \"The swift horse easily won every race.\"","take":"To grasp or pick up. \"Let me take your coat and hang it up.\"","tall":"High in height. \"Giraffes have very tall necks.\"","task":"A job to do. \"My morning task is to make my bed.\"","teacher":"A school instructor. \"My teacher helps me learn new things.\"","team":"A group organized for a purpose. \"Our soccer team works well together.\"","test":"Questions to check knowledge. \"I studied hard for the spelling test.\"","thank":"To express gratitude. \"I want to thank you for being so kind.\"","thankful":"Grateful. \"We are thankful for all our good friends.\"","thing":"An object. \"This round metal thing is actually a button.\"","things":"Multiple objects. \"So many fun things to see and do at the fair!\"","think":"To form ideas in your mind. \"Let me think carefully before answering.\"","thinker":"One who reasons. \"My dad is a great thinker and problem solver.\"","third":"After second. \"My birthday is on the third of May.\"","thirst":"Need for a drink. \"Eating salty chips made me very thirsty.\"","though":"However, but. \"Though I like spinach, my sister does not.\"","thoughtful":"Kind and caring. \"Sending get well cards is a thoughtful thing to do.\"","three":"After two. \"I have three sisters and one brother.\"","through":"From end to end. \"We walked through the long tunnel.\"","tight":"Fit snugly. \"These shoes feel too tight - my toes are pinched.\"","title":"Name given to something. \"The title of my book is 'Pets Around Town'.\"","told":"Informed someone. \"My parents told me to always work hard.\"","tone":"Quality of sound. \"Her voice had a cheerful and upbeat tone.\"","too":"Also or very. \"This backpack feels too heavy to carry all day.\"","tooth":"A hard structure in your mouth for biting and chewing. \"I brush and floss my teeth daily to keep them healthy and clean.\"","tornado":"A violently spinning storm. \"The powerful tornado uprooted trees and damaged buildings.\"","touch":"To put your hand upon. \"Please don't touch anything made of glass in the store.\"","tough":"Hard to cut or chew. \"We brought tough work gloves to help clear the weeds.\"","triumph":"A great success. \"Winning the race was a personal triumph for me.\"","true":"Accurate, not false. \"The witness told the true story about what happened.\"","try":"Attempt or test something. \"I will try my best even if it's tricky.\"","turn":"To rotate or change direction. \"Be sure to turn off lights before leaving a room.\"","tusk":"A long pointed tooth. \"The walrus used its long ivory tusks to pull itself onto the ice.\"","unit":"A single complete part. \"Our classroom is one unit in this school.\"","urban":"Of or in a city. \"New York City and Chicago are very large urban areas.\"","us":"We, me and you. \"Come play ball with us!\"","usable":"Able to be used or utilized well. \"Even with the crack, this plate is still usable.\"","useful":"Providing help or benefits. \"That sturdy little gadget is very useful in the kitchen.\"","vacation":"A holiday or time off. \"We went to the beach last summer for our vacation.\"","valuable":"Worth a lot. \"My gold watch is very precious and valuable to me.\"","value":"How much something is worth. \"Always try to get the best value when shopping.\"","very":"Really, extremely. \"I am very hungry since I skipped lunch!\"","violet":"A bluish-purple color. \"Fresh picked blackberries turn my fingertips violet.\"","volcano":"A mountain that erupts hot ash and lava. \"Bright orange lava oozed from the erupting volcano.\"","wait":"Stay until something happens. \"We will wait here until Dad picks us up.\"","wall":"A vertical structure dividing space. \"Hang your coat on the hook by the wall.\"","want":"To desire something. \"I want sprinkles on my ice cream please!\"","warm":"Somewhat hot. \"The soup is nice and warm after heating on the stove.\"","wash":"Clean something with water. \"Be sure to wash your hands before every meal.\"","washer":"A machine that cleans clothes. \"After wearing them, put dirty clothes in the washer.\"","washes":"More than one wash. \"Frequent hand washes prevent spread of germs.\"","wear":"To put on clothes. \"Please wear your red shirt for pictures today.\"","weather":"Atmospheric conditions outdoors. \"The rainy, windy weather kept us inside all day.\"","week":"Seven days. \"There are 52 weeks in one year.\"","weekly":"Happening every week. \"Our weekly allowance is five dollars.\"","weight":"How heavy something is. \"I can lift more weight than my little sister.\"","well":"In good health. \"I am feeling well again after recovering from the flu.\"","welt":"A swollen lump on skin. \"An ant bite left an itchy welt on my arm.\"","went":"Did go. \"Yesterday we went to the zoo.\"","whale":"A very large sea mammal. \"The blue whale is the biggest animal ever known.\"","what":"Which or which one. \"What day does the carnival start?\"","when":"At what time. \"When should we meet to go trick-or-treating?\"","where":"At what place. \"Where did you find that beautiful seashell?\"","which":"Indicating a choice. \"Which flavor of pie do you like best?\"","while":"During a period of time. \"Let's chat for a while before you leave.\"","whip":"To whisk rapidly. \"Please help me whip the cream so it's fluffy.\"","whirl":"To spin around. \"The ice skaters whirled gracefully around the rink.\"","whistle":"Make a high pitch tone with your mouth. \"I can whistle loud enough to call my puppy.\"","white":"The color like snow or milk. \"The bride wore a beautiful white gown.\"","whole":"Complete or full amount. \"I ate the whole plate of spaghetti and meatballs!\"","why":"For what reason. \"Why do leaves change color in the fall?\"","wide":"Extending far side to side. \"We hiked along the wide, sandy beach.\"","wilt":"Become limp or droopy. \"Don't forget to water your plants or they might wilt!\"","wind":"Moving air. \"Flying kites is fun on a breezy, windy March day.\"","wings":"Limbs birds use to fly. \"The duck flapped its feathery wings and took off from the pond.\"","wink":"Quickly close and open one eye. \"I gave a sly wink to my best friend across the room.\"","wire":"A thin metal strand. \"Be careful of the electric wire so you don't get shocked.\"","wish":"A hope or dream. \"On my birthday I made a special wish before blowing out candles.\"","wishes":"More than one wish. \"The stars know all my greatest wishes.\"","woman":"A female adult. \"That kind woman is my Aunt Virginia.\"","work":"Job, employment. \"My mom goes to work at the hospital every weekday.\"","workers":"Those who work. \"The road construction crew workers wear orange safety vests.\"","world":"The Earth and all life on it. \"Oceans cover most of the world.\"","write":"To communicate on paper. \"I will write a letter to my best friend who moved away.\"","year":"12 months. \"There are 365 days in one year.\"","years":"More than one year. \"I have lived here for three years.\"","yellow":"A bright color like a lemon. \"My favorite crayon color is yellow.\"","yes":"Correct or agreement. \"Yes, I would love to be your partner for the project.\""},{"account":"A description of events or facts. \"She gave an account of what happened at school.\"","action":"Something that someone does. \"Skateboarding is an action sport.\"","actually":"Truly, really. \"I actually dont like pizza that much.\"","adapt":"To change to fit new conditions. \"Bears adapt to the cold by growing thicker fur.\"","airplane":"Aircraft with wings that flies through the air. \"The airplane has two jet engines under the wings.\"","airy":"Open, light and breezy. \"The curtains blew in the airy room.\"","almost":"Nearly, but not completely. \"She almost finished the long race.\"","along":"Moving forward on a path or route. \"We walked along the trail by the lake.\"","aloud":"Out loud, not silently. \"The teacher read the story aloud to the class.\"","always":"At all times, constantly. \"My dog always wags his tail when I get home.\"","among":"In the midst of, surrounded by. \"The stranger sat among the group of children.\"","amount":"The number or quantity of something. \"A large amount of snow fell during the storm.\"","annoy":"Bother or irritate. \"Loud noises annoy me when Im trying to concentrate.\"","answer":"A reply or response. \"She knew the answer to the question.\"","appearance":"How someone or something looks. \"She checked her appearance before the interview.\"","apron":"Garment worn over the front of ones clothes. \"She tied on an apron before starting to cook.\"","arctic":"Relating to the North Pole region. \"Polar bears live in the Arctic.\"","area":"A part, region or section. \"The picnic area had many tables.\"","argument":"Disagreement or debate between people. \"They had an argument about where to go for lunch.\"","army":"A large group of soldiers. \"The army marched into battle.\"","around":"On all sides, encircling. \"There were trees around the pond.\"","atomic":"Relating to atoms, the smallest unit of matter. \"Splitting atomic particles releases enormous energy.\"","attention":"Careful listening or thought. \"Pay attention to the teacher during class.\"","audience":"A group of listeners or spectators. \"The audience clapped after the play.\"","author":"The writer of a book or article. \"The author signed copies of her new book.\"","available":"Ready for use, at hand. \"There were no bikes available for rent.\"","axle":"A rod wheels turn around. \"The axle on the wagon was rusty.\"","badge":"An emblem showing rank or membership. \"He proudly wore his Boy Scout badge.\"","balcony":"An outdoor platform on a building. \"We sat on the balcony and enjoyed the view.\"","balloon":"Inflatable rubber sack filled with air or gas. \"The balloon floated high up into the sky.\"","bare":"Lacking the usual covering or clothing. \"His feet were bare as he walked along the beach.\"","barter":"Trade goods or services without money. \"Many early societies bartered corn for cloth and tools.\"","base":"The bottom or lowest part. \"The vase had a sturdy base so it wouldnt tip.\"","baseball":"Game played with a bat, ball and gloves. \"Baseball is Americas favorite pastime.\"","basket":"A woven container for carrying things. \"She packed a picnic basket with sandwiches.\"","batch":"A group made at the same time. \"The baker made a fresh batch of cookies.\"","bayou":"A slow-moving creek or river. \"Alligators live in the warm bayou.\"","bear":"A large, furry mammal with claws. \"The bear fished for salmon in the river.\"","beautiful":"Pleasing to the senses. \"The rainbow was bright and beautiful.\"","began":"Started or commenced. \"The race began when the starter pistol fired.\"","begin":"To start or originate. \"Lets begin our hike up the mountain.\"","behavior":"The way one acts. \"The childs behavior was excellent all day.\"","behind":"At or toward the back. \"Please stand behind me in line.\"","being":"Existing as a person or thing. \"Human beings need food, water and shelter to survive.\"","belong":"To be the property of someone. \"That bike belongs to Sally.\"","best":"Of the highest quality or desirability. \"Getting enough sleep is best for good health.\"","better":"Of higher quality or more desirable. \"A sunny day is better than a rainy one.\"","between":"In the space separating two things. \"The ball landed between home and third base.\"","bigger":"Of great size, largeness. \"An elephant is much bigger than a mouse.\"","birds":"Animals with wings and feathers. \"The birds were singing in the trees.\"","blood":"The red fluid circulating the body. \"Blood carries oxygen to cells.\"","board":"A long, flat piece of wood or rigid material. \"She hung pictures on a bulletin board.\"","book":"Bound pages with printed text and images. \"I checked out a book from the library.\"","bookcase":"Shelves for storing books. \"The bookcase was filled with adventure stories.\"","border":"An outer edge or boundary. \"Purple flowers bordered the garden path.\"","bored":"Feeling weary from lack of interest. \"He was bored after playing video games for so long.\"","born":"Brought into life by birth. \"She was born on July 4th.\"","both":"Referring to two persons or things. \"Both Michael and Jennifer did well on the test.\"","bottles":"Containers with narrow necks for liquids. \"The empty bottles were recycled.\"","bought":"Acquired by paying money. \"I bought a bouquet of flowers at the store.\"","bountiful":"Abundant, plentiful. \"The farmers were grateful for the bountiful harvest.\"","broke":"Past tense of break; cracked or fractured. \"I accidentally broke the glass when I dropped it.\"","brother":"Male sibling or close male friend. \"I went to the movies with my big brother.\"","buffalo":"Large wild ox native to North America. \"Buffalo once roamed the Great Plains in huge herds.\"","burned":"Injured or damaged something with fire. \"She burned her hand grabbing the hot pan.\"","burst":"Exploded or broke open suddenly. \"The bubble burst with a loud pop.\"","butterfly":"Winged insect with large, patterned wings. \"The Monarch is a brightly colored orange and black butterfly.\"","buy":"Obtain something by paying money for it. \"Im going to buy some bread from the store.\"","buying":"Purchasing or acquiring things. \"We are buying new furniture for the living room.\"","cabin":"A small, simple house. \"Our log cabin was cozy in winter.\"","calculate":"Solve a problem using mathematics. \"I can calculate the total cost in my head.\"","candle":"Cylinder of wax with an embedded wick burned for light. \"The candle flickered softly on the table.\"","cant":"Cannot, unable to. \"I cant reach the top shelf, its too high up.\"","cannot":"To be unable to do something. \"I cannot reach the top shelf.\"","capable":"Having needed skills or talents. \"She is capable of lifting heavy weights.\"","carefully":"With great caution and attention. \"Drive carefully on icy roads.\"","carry":"Hold or transport someone or something. \"Ill carry this box for you.\"","cellar":"Room or space under a building, often for storage. \"The cellar kept our food cool and dry.\"","carried":"Held and transported something. \"The horse carried the supplies up the mountain.\"","carpet":"A floor covering made of thick fabric. \"The carpet was soft underfoot.\"","center":"The middle point or part. \"Sit in the center of the boat to balance it.\"","central":"Main or principal; centered. \"The library is central to the town square.\"","chance":"Possibility or likelihood of something. \"Theres a good chance it will rain today.\"","change":"Become different, transform. \"Caterpillars change into butterflies.\"","checked":"Examined or verified something. \"I checked my answers before handing in the test.\"","cheerful":"Having or showing good spirits. \"She had a cheerful smile on her face.\"","child":"A young boy or girl. \"The child played happily with his toys.\"","children":"Human offspring. \"The children played games at recess.\"","choice":"An option selected from many possibilities. \"We have a choice between chocolate and vanilla.\"","choose":"Pick out or select something. \"I choose the red T-shirt over the blue one.\"","chuckle":"Laugh quietly or inwardly. \"Reading the funny comic made me chuckle.\"","church":"Place for worship and religion. \"Many attend church services on Sunday.\"","citrus":"Relating to fruit trees like oranges. \"Citrus trees grow well in warm climates.\"","city":"A large, busy town. \"New York City has very tall buildings.\"","civil":"Relating to citizens or government. \"The civil rights movement brought important changes.\"","clarify":"Make clearer or easier to understand. \"Please clarify the instructions - Im confused.\"","class":"A group of students learning together. \"Mrs. Thompsons second grade class was very bright.\"","classroom":"A room for instruction. \"Our classroom has maps and globes for learning.\"","clear":"Easy to hear, see or understand. \"Please speak slowly and clear.\"","clerk":"Salesperson who assists customers. \"The store clerk helped me find what I was looking for.\"","climate":"Weather patterns in an area over time. \"The island had a tropical climate.\"","close":"Near, not far away. \"Keep a close eye on your little sister.\"","cloud":"A mass of water droplets in the sky. \"The cloud blocked the sun.\"","collect":"Gather items over time. \"I collect comic books and trading cards.\"","colorful":"Having bright, vivid colors. \"The peacock has colorful feathers.\"","combination":"Things joined or mixed together. \"He used the right combination to open the safe.\"","comfortable":"Providing ease and relaxation. \"These new shoes are quite comfortable.\"","common":"Ordinary, frequently occurring. \"Giraffes have long necks, which is common for the species.\"","compare":"Note similarities and differences. \"Lets compare these two backpacks.\"","complex":"Complicated, with many parts. \"Building a robot is a complex process.\"","condor":"A very large vulture-like bird. \"The California condor has a 10 foot wingspan.\"","conduct":"Direct the carrying out of something. \"The conductor will conduct the orchestra.\"","confession":"Admission of guilt or wrongdoing. \"His confession revealed what really happened.\"","constitution":"The laws and principles of a nation. \"The U.S. Constitution has seven articles.\"","continuity":"Unbroken connection or logical sequence. \"There is continuity between episodes of this TV series.\"","contrast":"State of being strikingly different. \"There is quite a contrast between lions and housecats.\"","copy":"An exact reproduction or replica. \"I made a copy of the original document.\"","correct":"Free from error or mistakes. \"What is the correct answer?\"","country":"Territory or nation with its own government. \"Canada is the second largest country in the world.\"","cowboy":"Person who tends cattle and horses in the American West. \"The cowboy rode across the open plains on horseback.\"","crash":"Smash or collide violently. \"The cymbals crashed loudly in the songs climax.\"","crawl":"Move forward on hands and knees. \"The babies crawled quickly around the playpen.\"","cried":"Shed tears in sadness or pain. \"The baby cried when her balloon floated away.\"","cross":"Go or extend across something. \"Look both ways before you cross the street.\"","crown":"Ornate headpiece worn by royalty. \"The king wore a golden crown decorated with jewels.\"","culture":"Customs, arts and social institutions of a group. \"Every nation has its own unique culture.\"","curled":"Formed into a spiraled or coiled shape. \"She curled up with a good book on the sofa.\"","current":"Belonging to the present time. \"What is the current price of gasoline?\"","curtain":"Cloth covering a window or doorway. \"The curtains blocked the bright sunlight.\"","custom":"Traditional way of doing things. \"It is our family custom to make tamales for Christmas.\"","cycle":"A repeating sequence of events or operations. \"Water goes through a continuous evaporation and precipitation cycle.\"","dance":"Move rhythmically to music. \"I like to dance to fun, upbeat songs.\"","dangerously":"In a way that risks harm or injury. \"Driving dangerously increases the chance of accidents.\"","data":"Facts or information used for calculating. \"The data helped us draw conclusions.\"","dawn":"The first light of day. \"The rooster crowed at the break of dawn.\"","decimal":"Relating to fractions with denominators of ten. \"One-tenth can be written as the decimal 0.1.\"","delta":"The area where a river meets the sea. \"The Mississippi River forms a big delta in the Gulf of Mexico.\"","denominator":"Bottom number of a fraction. \"In 1/4 the denominator is 4.\"","desert":"An extremely dry, barren region. \"Cacti thrive in the hot desert.\"","didnt":"Did not. \"I didnt mean to be late, there was heavy traffic.\"","difference":"Unlikeness between two or more things. \"Can you tell the difference between cats and dogs?\"","different":"Unlike, dissimilar. \"My opinion is different from yours.\"","direction":"The course along which something moves. \"We drove east, heading in that direction.\"","disappear":"Vanish from sight. \"The airplane disappeared into the clouds.\"","discovery":"Finding or learning something. \"The discovery of penicillin was important in medicine.\"","disposable":"Made to be used once and then thrown away. \"Many people are trying to use less disposable plastic.\"","distance":"The amount of space between things. \"Its a short distance around the park.\"","ditch":"A long, narrow trench. \"They dug a ditch to drain the floodwaters.\"","diving":"Jumping into water head first. \"Cliff diving into the ocean looks thrilling but also dangerous.\"","division":"Separating into parts or groups. \"In division you divide one number by another.\"","dont":"Do not. \"Dont touch that - its still wet!\"","dress":"Garment for a girl or woman. \"The bride wore a beautiful white wedding dress.\"","dried":"Dehydrated, moisture removed. \"We hung the wet clothes out to dry in the sun.\"","drought":"Period of abnormally dry weather. \"Cacti can survive long droughts with little water.\"","earth":"The planet we live on. \"The earth orbits around the sun.\"","east":"Cardinal direction to the right when facing north. \"The sun rises in the east.\"","easy":"Not hard or difficult. \"Solving this math problem is easy for me.\"","elapse":"Pass by or slip away. \"Many years elapsed before they met again.\"","electric":"Powered by or relating to electricity. \"The electric mixer makes baking faster.\"","elliptical":"Oval or circular shaped. \"The planets orbit the sun in elliptical paths.\"","else":"Other or additional. \"Would you like anything else with your lunch order?\"","empty":"Containing nothing inside. \"Please dont throw the empty bottle into the trash - recycle it!\"","emptied":"Poured out everything. \"She emptied her pockets looking for the lost key.\"","engine":"Machine that converts energy into motion. \"The fire engine has a powerful engine to pump water.\"","enough":"As much as required. \"I have enough pencils to share.\"","erasable":"Able to be removed. \"Pencil is erasable but pen is not.\"","especially":"Particularly, exceptionally. \"Be especially careful when driving on icy roads.\"","establish":"Set up or create something. \"They helped establish a new park.\"","every":"All, each one. \"She waters the plants every morning.\"","everyone":"All people in a group. \"Everyone must bring a permission slip to attend the field trip.\"","exact":"Precise, accurate. \"Could you give me the exact amount needed?\"","example":"Something that represents a larger whole. \"This triangle is an example of a right triangle.\"","explorer":"Someone who travels seeking unknown places. \"Christopher Columbus was an explorer who sailed across the Atlantic.\"","express":"Communicate or articulate. \"He expressed his opinion politely.\"","extinct":"No longer existing. \"Dinosaurs are extinct.\"","fairy":"Magical, mythical being with wings. \"In fairy tales, a fairy godmother uses magic to help the heroine.\"","families":"All people living in a household. \"Both of their families gathered for dinner.\"","family":"People related to one another. \"My family lives close by.\"","father":"A male parent. \"Her father drove her to the dance.\"","feature":"A major or distinctive part. \"The computer has many special features.\"","federal":"Relating to central government. \"The Canadian federal government is in Ottawa.\"","feeling":"An emotion or sensation. \"I had a sad feeling when my friend moved away.\"","fence":"Barrier enclosing an area. \"We painted the wooden fence white.\"","fever":"Higher than normal body temperature. \"Drink fluids if you have a fever.\"","final":"Coming at the end, ultimate. \"This is the final round of the spelling bee.\"","firm":"Solid, stable and unyielding. \"Make sure the table is on firm, level ground.\"","floor":"Bottom surface of a room for walking. \"The floor was made of tile.\"","flour":"Ground grain used in baking. \"We used flour, sugar and eggs to bake a cake.\"","flower":"The bloom or blossom of a plant. \"The flower garden was filled with roses and lilies.\"","fly":"Travel through air with wings. \"The plane will fly from Vancouver to Toronto.\"","focus":"Center of activity or attention. \"Please focus on your schoolwork.\"","folklore":"Stories and legends of a culture. \"Folklore is passed down through generations.\"","follow":"Go or come after someone. \"Please follow me this way.\"","football":"Game played by teams on a field. \"We tossed the football around.\"","forest":"An area with many trees growing close together. \"The deer lived in the shady green forest.\"","formally":"In a proper or official way. \"The treaty was formally signed by both kings.\"","formula":"Set of instructions for making something. \"We used a formula to mix the concrete.\"","fountain":"A jet of shooting water. \"We drank cold water from the courtyard fountain.\"","fourth":"Coming after third in order. \"My fourth child was born in September.\"","fraction":"Part of a whole expressed as a number over another. \"Two-thirds is a fraction.\"","front":"Forward part or side. \"Please walk to the front of the line.\"","funny":"Humorous, amusing. \"That joke was really funny!\"","future":"Time yet to come. \"In the future we may live on other planets.\"","garden":"Plot of ground for growing plants. \"We grow vegetables in our garden.\"","general":"Widespread, non-specific. \"Generally, flowers need sunlight and water.\"","gentle":"Kind, soft, tender. \"She had a gentle, caring nature.\"","geography":"Study of Earths surface and features. \"We studied geography and made maps.\"","giggle":"Laugh lightly in a playful, gleeful way. \"The funny joke made the kids giggle.\"","ginger":"Herb used as a spice and flavoring. \"Gingerbread cookies have a nice spicy ginger flavor.\"","giraffe":"Tall mammal with a very long neck. \"The giraffe can eat leaves high up on the tree.\"","glare":"A steady, intense gaze. \"The cats glare warned the dog away from her kittens.\"","government":"Governing body of a city, state or country. \"The US government has three branches.\"","grade":"A year of schooling. \"Next year Ill be in third grade.\"","grand":"Splendid, impressive, great. \"The castle was very grand with tall towers.\"","graph":"Diagram displaying data visually. \"The graph showed daily temperature changes.\"","gravity":"Force that pulls objects toward each other. \"Gravity keeps the moon orbiting Earth.\"","ground":"Surface of the earth. \"The tent was pitched on flat, even ground.\"","group":"Number of people or things together. \"Our study group met every Thursday after school.\"","growl":"Make a deep, rumbling snarl. \"The big dog let out a mean, scary growl.\"","guilty":"Responsible for wrongdoing. \"He felt guilty for taking the cookie.\"","gun":"A weapon that shoots bullets or projectiles. \"The hunter carried a rifle gun.\"","hair":"Fine strands growing on ones head. \"He has short blonde hair.\"","hallway":"Corridor inside a building. \"We left our coats in the hallway.\"","handle":"Part of something held with the hand. \"Please hold the handle when opening the door.\"","happiest":"Most joyful or content. \"Getting an A made me the happiest.\"","happy":"Feeling joy or pleasure. \"Giving makes me feel happy.\"","hare":"Long-eared mammal related to rabbits. \"The hare was almost invisible camouflaged in the grass.\"","harmful":"Causing damage or injury. \"Smoking can be very harmful.\"","havent":"Have not. \"I havent finished my homework yet.\"","hell":"He will. \"Hell be here soon, Im sure.\"","hes":"He is. \"Hes my favorite teacher.\"","hear":"Perceive sound through the ear. \"I hear music outside.\"","held":"Grasped, supported. \"He held his mothers hand crossing the street.\"","helpfully":"In a helpful caring manner. \"The tutor helpfully explained the concepts.\"","here":"In this place. \"Please come over here.\"","high":"Extending far upwards. \"The airplane flew very high.\"","highest":"Reaching the maximum height. \"Eagles soar at the highest altitudes.\"","highway":"Main public road between cities. \"We drove down the interstate highway.\"","history":"Record of past events relating to humans. \"We studied Canadian history.\"","hoe":"Garden tool with a long handle and flat blade. \"Use the hoe to break up the hard soil.\"","hometown":"Town where you were born or grew up. \"My mom grew up in a small hometown in Iowa.\"","honorably":"With integrity, fairness and truthfulness. \"The hero was honorably rewarded for his valor in battle.\"","hope":"Wish or desire for something. \"I hope it snows a lot this winter!\"","horse":"Large hoofed mammal with flowing mane and tail. \"Cowboys rode horses out on the open range.\"","hotter":"Higher in temperature. \"It got hotter as we descended into the canyon.\"","however":"Nevertheless, despite that. \"I was tired. However, I kept working to get the job done.\"","hug":"Put your arms around someone and hold them close. \"I gave my mom a big hug when I got home.\"","hugged":"Embraced someone tightly. \"She hugged her teddy bear while sleeping.\"","hundred":"The number 100. \"There are 100 years in a century.\"","hunting":"Searching for wild animals to capture or kill them. \"We went deer hunting in the woods.\"","hurried":"Acted swiftly and rushed. \"We hurried home before the rain.\"","Id":"I would. \"Id like to have pizza for dinner.\"","idea":"Thought, opinion, or suggestion. \"I just had a great idea for a science fair project!\"","Ill":"I will. \"Ill call you when I get home.\"","Ive":"I have. \"Ive finished all my homework already.\"","ivory":"Hard white material from animal tusks and teeth. \"The keys of the antique piano were made of ivory.\"","ice":"Frozen water. \"The lake was covered in a sheet of ice.\"","icing":"Sweet glaze or frosting. \"The cake had thick, creamy icing on top.\"","important":"Having great value or significance. \"Getting enough sleep is important.\"","improper":"Incorrect or unsuitable. \"Yelling is an improper way to handle the situation.\"","inches":"Units of length equal to twelve inches. \"There are 12 inches in 1 foot.\"","independence":"Freedom from control of others. \"The colonies declared independence from Britain.\"","interact":"Influence or act upon each other. \"The chemicals interacted and started foaming.\"","interaction":"Communicating or acting with others. \"A fun class involves lots of student interaction.\"","iron":"Strong metal used to make tools. \"The iron gate was very heavy.\"","irritably":"In an impatient, annoyed manner. \"The toddler acted irritably and had a tantrum.\"","isnt":"Is not. \"It isnt a good idea.\"","its":"It is. \"Its my favorite color.\"","jerked":"Pulled or yanked suddenly. \"She jerked back from the hot stove.\"","joyfully":"With great happiness. \"The children played joyfully in the new fallen snow.\"","jumped":"Leapt or sprang upwards. \"The excited puppy jumped up and down.\"","jury":"Group deciding the verdict in a trial. \"The jury listened carefully to the evidence.\"","keep":"Retain possession of something. \"Ill keep this seashell as a souvenir.\"","knee":"Joint between upper and lower leg. \"The baby crawled on hands and knees.\"","knife":"Tool with a sharp blade for cutting. \"Use a knife to slice the bread.\"","knot":"Fastening made by twisting rope or thread. \"Tie a strong knot so the boat wont come loose.\"","knock":"Rap with knuckles or an object. \"Knock on the door before entering please.\"","knowledge":"Facts or information acquired. \"Experience gave him farming knowledge.\"","known":"Familiar with something. \"Ive known her since kindergarten.\"","lady":"Polite term for a woman. \"Thank you maam, said the polite young lady.\"","lasso":"Rope looped into a slipknot used to catch cattle. \"The cowboy twirled his lasso above his head.\"","laughable":"Amusing, comical. \"That silly joke about the chicken crossing the road is laughable.\"","laughed":"Expressed amusement with sound. \"The funny movie made us laugh.\"","laundry":"Clothes, sheets and towels to be washed. \"Im going to do the laundry.\"","lawyer":"Person who practices law. \"The lawyer presented evidence to the jury.\"","least":"Smallest in amount. \"This is the least spicy dish on the menu.\"","leave":"Go away from a place or person. \"Its time to leave for school now.\"","leaving":"Departing from a place. \"Were leaving for vacation today!\"","lesson":"Activity that teaches something. \"In music we learned about rhythm.\"","lets":"Let us. \"Lets go to the park!\"","lightning":"Flash of light during a thunderstorm. \"Lightning was followed by loud thunder.\"","liked":"Enjoyed or appreciated something. \"I really liked the gift you gave me!\"","likely":"Probable or expected to happen. \"It likely wont snow in July here.\"","list":"Written series of items. \"I made a grocery list.\"","local":"Relating to a particular area. \"Shop at local businesses to help the community.\"","lonely":"Sad due to lack of friends or company. \"I felt lonely after my best friend moved away.\"","looked":"Used ones eyes to see. \"She looked for her lost shoe.\"","loose":"Not tight or constrained. \"Her loose tooth finally fell out.\"","louder":"Greater in volume or intensity. \"I couldnt hear over the louder music.\"","lovely":"Beautiful, very pleasing. \"The rose garden was lovely.\"","lunar":"Relating to the moon. \"A lunar eclipse occurs when the moon passes into the Earths shadow.\"","lunch":"Midday meal. \"I brought a packed lunch to school.\"","magnify":"Make something appear larger. \"A magnifying glass will magnify the words.\"","main":"Most important or largest. \"The main course is the meat or entree.\"","majority":"Greater number or part. \"The majority voted for pizza lunch.\"","marker":"Felt-tipped pen used for writing or drawing. \"Use the markers to decorate your poster board.\"","market":"Place where goods are bought and sold. \"We went to the farmers market.\"","married":"Joined in matrimony. \"The happily married couple honeymooned in Hawaii.\"","match":"Go together, correspond. \"Your socks match your shirt perfectly!\"","material":"Substance something is made from. \"Cotton is a natural fabric material.\"","measurement":"Process of determining size or amount. \"We learned how to take measurements in science.\"","middle":"Midpoint or central part. \"We sat in the middle seats.\"","migrate":"Move from one region or climate to another. \"Some birds migrate long distances.\"","milk":"White liquid produced by cows and other mammals. \"I like cold milk with my cereal.\"","mirror":"Reflective glass surface. \"I could see myself in the mirror.\"","miss":"Feel sad about someones absence. \"I miss my friend who moved away.\"","modify":"Change something partially. \"We can modify this recipe to be healthier.\"","momentum":"Impetus of a moving object. \"The train gained momentum leaving the station.\"","monarch":"King, queen or emperor who rules a kingdom. \"The new monarch was crowned at the palace.\"","moose":"Large deer species with enormous antlers. \"The moose waded in the pond eating plants.\"","morning":"Early part of day from sunrise to noon. \"We wake up in the morning and get ready for school.\"","motel":"Inn or hotel for travelers. \"Our family stayed overnight at a roadside motel.\"","mountains":"Large landforms that rise high above surroundings. \"The Rocky Mountains extend from Canada to Mexico.\"","multiplication":"Math process of multiplying numbers. \"Three times four is multiplication.\"","music":"Art of arranging vocal or instrumental sounds. \"I enjoy playing and listening to music.\"","musical":"Related to music. \"The musical play had singing and dancing.\"","mysteries":"Puzzling things that cant be easily explained. \"We learned about the mysteries of space in science class.\"","mystery":"Something unknown or not understood. \"Where the rainforest got its name remains a mystery.\"","nation":"Country, people or culture. \"Canada is a nation north of the United States.\"","national":"Relating to a nation. \"July 4th is a national holiday in the United States.\"","natural":"Existing in nature. \"A national park preserves natural wilderness.\"","navigate":"Travel through an area. \"We navigated through the forest using a map and compass.\"","near":"Close by, not far away. \"My school is near my house.\"","nectar":"Sweet liquid inside flowers used by bees. \"A hummingbird ate nectar from the flowers.\"","never":"Not ever, at no time. \"I have never flown in a helicopter.\"","next":"Coming immediately after. \"What is the next step in the directions?\"","nicely":"In a pleasing, polite manner. \"She thanked me nicely for the gift.\"","night":"Darkness between sunset and sunrise. \"Bats hunt for insects at night.\"","noise":"Sound, especially loud or unpleasant. \"The construction crew was making noise.\"","north":"Direction to the left when facing the rising sun. \"We drove north to go camping.\"","notebook":"Book with blank lined pages for writing. \"Please open your science notebooks.\"","nothing":"Not anything. \"There was nothing left to eat!\"","noun":"Word naming a person, place or thing. \"Apple is a noun.\"","numerator":"Top number in a fraction. \"In 3/5 the numerator is 3.\"","nutrients":"Substances that nourish and sustain growth. \"Broccoli contains vitamins, minerals and other important nutrients.\"","object":"A thing that can be seen or touched. \"The rock is a solid object.\"","ocean":"Vast body of salt water covering most of Earth. \"The ocean contains many fish and mammals.\"","office":"Room or building where business is conducted. \"My dad works in an office.\"","often":"Frequently, many times. \"We often walk in the evenings.\"","once":"One time only. \"We can go to the movies once you finish homework.\"","open":"Not closed or blocked off. \"Please leave the door open.\"","orbit":"Move in a circular or oval path around something. \"Earth orbits around the sun.\"","orchestra":"Group of musicians playing instruments together. \"The orchestra played beautiful, harmonized music.\"","organize":"Arrange methodically into groups. \"I organized my sweater collection by color.\"","outcome":"Final result or end product. \"The outcome was a very tasty cake.\"","outdoors":"Outside of a building. \"My mom planted flowers and veggies outdoors.\"","own":"To have control over something. \"I got a new bike of my very own!\"","painfully":"Causing emotional or physical pain. \"The nurse removed the bandage painfully slowly.\"","paper":"Thin sheet material made of wood pulp or plant fibers. \"I wrote my story on lined paper.\"","paragraph":"Group of sentences about one topic. \"Each paragraph should focus on a single idea.\"","pardon":"Forgive or excuse someone. \"Please pardon my sneeze during the concert.\"","particle":"Extremely tiny piece of matter. \"Dust particles floated through the air.\"","parties":"Fun gatherings with food, games and friends. \"I love going to birthday parties!\"","party":"A social gathering or celebration. \"Birthday parties are fun.\"","pause":"Stop temporarily. \"Lets pause the movie and eat snacks.\"","pelt":"The raw skin of an animal with fur. \"The hunter dried the beavers pelt.\"","pencil":"Writing tool containing graphite. \"I used my pencil to complete the worksheet.\"","pennies":"Plural of penny, coins worth 1 cent. \"One dollar equals 100 pennies.\"","penny":"Coin worth 1 cent, 1/100 of a dollar. \"This penny was minted in 1980.\"","perfect":"Without flaws or defects. \"A perfect score on the test is 100%.\"","perimeter":"Outer boundary enclosing a space. \"What is the perimeter of a square with sides 15 feet long?\"","permission":"Approval or consent to do something. \"May I have your permission to leave class early?\"","person":"A human being. \"That person looks familiar to me.\"","personally":"As an individual, in a personal manner. \"I personally prefer dogs over cats.\"","phase":"A stage or aspect of development. \"The moon passes through phases from new to full.\"","photograph":"Image captured with a camera. \"This photograph of my mom is my favorite.\"","piano":"Musical instrument played using keys and pedals. \"I take piano lessons every Tuesday after school.\"","picked":"Selected or chose something. \"Sally picked an apple from the tree.\"","plains":"Large flat areas of land with few trees. \"Pioneers traveled across the Great Plains in wagon trains.\"","planets":"Large spherical celestial bodies orbiting stars. \"Mars is one of the planets in our solar system.\"","plant":"Living organism that grows in soil and makes its own food. \"The plant grew large green leaves.\"","playful":"Full of fun, playful. \"The playful kittens chased each other.\"","please":"Used to politely ask for something. \"Please pass the salt.\"","police":"Civil force responsible for law enforcement. \"The police kept the traffic moving safely.\"","pond":"Small body of still water. \"We skipped stones across the pond.\"","poor":"Not having much money. \"They were so poor they could barely afford food.\"","portable":"Able to be easily moved or carried. \"We brought a portable grill for the picnic.\"","portrait":"Painting, drawing or photo of a person. \"The portrait hung in the museum gallery.\"","position":"Place where someone or something is located. \"Line up in starting position.\"","potato":"Starchy, edible tuber. \"French fries are made from sliced potatoes.\"","pounds":"Units of weight and mass. \"This dog weighs about 50 pounds.\"","poured":"Emptied liquid from a container. \"She poured milk on her cereal.\"","prepare":"Make ready in advance. \"They prepared for the dinner by cooking and decorating.\"","prettier":"More pleasing to look at. \"I think lilies are prettier than daisies.\"","price":"Amount of money something costs. \"The price of the shirt was discounted 20%.\"","product":"Something made or grown for sale. \"We sell only high quality products.\"","pulled":"Used force to move something closer. \"The rope was pulled to raise the sail.\"","punish":"Impose a penalty for wrongdoing. \"Its not right to punish the whole class for one students actions.\"","puppy":"Young dog not fully grown. \"The playful puppy chewed up my shoe!\"","pushed":"Exerted force on something to move it away. \"I pushed open the heavy door.\"","quarter":"One fourth or 25 percent. \"She ate one quarter of the pizza.\"","question":"Sentence that seeks information. \"Does anyone have a question before the quiz?\"","quiet":"With little or no noise. \"I read quietly in the library.\"","quotation":"Repeat of spoken or written words. \"Thats a quotation from Shakespeare.\"","quotient":"Result of dividing one number by another. \"10 divided by 5 equals a quotient of 2.\"","rainbow":"Arc of colorful light in sky. \"We saw a beautiful rainbow after the rainstorm.\"","rainfall":"Amount of precipitation over a time period. \"The area had record rainfall this month.\"","raise":"Lift or move to a higher position. \"Raise your hand if you have a question.\"","rapidly":"Quickly, speedily. \"The river was flowing rapidly after the rains.\"","reached":"Arrived at a destination. \"We finally reached the mountain summit.\"","real":"Actually existing; not imaginary. \"Seeing whales in real life was amazing.\"","reflect":"Throw or bounce back light or an image. \"The mirror reflects my image so I can see myself.\"","remainder":"Amount left over after division. \"15 divided by 4 leaves a remainder of 3.\"","repair":"Fix or mend something broken. \"Well repair the leaky roof tomorrow.\"","reusable":"Able to be used again. \"We pack reusable water bottles instead of plastic ones.\"","review":"Look at or examine again. \"Lets review the vocabulary words.\"","rewind":"Wind backwards to original position. \"Rewind the cassette tape when youre done listening.\"","richest":"Most abundant or valuable. \"The chocolate cake was the richest Ive ever tasted!\"","river":"Large, natural freshwater stream. \"We fished for salmon in the river.\"","rolling":"Turning over and over while moving. \"The ball kept rolling down the hill.\"","round":"Shaped like a circle or sphere. \"Earth is round like a giant ball.\"","royal":"Relating to a king, queen or monarch. \"The royal carriage was pulled by white horses.\"","rule":"Regulation governing actions. \"A rule of the game is you cant touch the ball with your hands.\"","safe":"Free from harm or danger. \"Wearing a seatbelt keeps you safe in the car.\"","save":"Rescue from harm; keep protected. \"Remember to save your work frequently so you dont lose it.\"","school":"Place for teaching and learning. \"I learn reading, writing and math at school.\"","science":"Study of the natural world and universe. \"Biology, physics and chemistry are sciences.\"","scream":"Cry out loudly in pain or fear. \"She screamed when she saw the spider.\"","sea":"Large salty body of water. \"Whales live in the sea.\"","season":"One of the four divisions of the year - spring, summer, fall, winter. \"Winter is my favorite season.\"","second":"One sixtieth of a minute; unit of time. \"There are 60 seconds in 1 minute.\"","seem":"Give the impression of being something. \"The summer seemed to go by very quickly.\"","settled":"Established a home in a new place. \"In the 1600s Europeans settled along North Americas east coast.\"","settlers":"People who migrate to colonize new territory. \"The settlers built communities on the frontier.\"","shadow":"Dark shape made from blocking light. \"The trees shadow kept us cool.\"","shall":"Will or must; used to express intent. \"You shall go to the ball, Cinderella!\"","sharp":"Having a very thin and potentially cutting edge. \"Be careful, that knife is very sharp!\"","shed":"She would or she had. \"Shed like to visit Paris someday.\"","shell":"She will. \"Shell be here soon, Im sure.\"","shes":"She is. \"Shes my best friend.\"","shirt":"Garment for the upper body. \"He buttoned his dress shirt.\"","shoes":"Coverings worn on the feet. \"Those new shoes look very comfortable.\"","shock":"Sudden upsetting or surprising event. \"The shock of the cold water made me gasp.\"","shook":"Shaken or quivered. \"The ground shook during the earthquake.\"","shoulder":"Joint connecting arm and torso. \"I hurt my left shoulder exercising.\"","shouted":"Yelled loudly. \"The coach shouted instructions to the team.\"","showed":"Displayed or presented something. \"She showed me photos from the trip.\"","shower":"Brief fall of rain. \"Lets wait out this rain shower before we walk home.\"","sign":"Object conveying information. \"The sign said there was danger ahead.\"","signal":"Sign used to communicate or direct. \"The crossing guard held out his hand as the signal to stop.\"","simple":"Easy, not complex. \"Baking a cake is simple with this easy recipe.\"","simplify":"Make simpler or more straightforward. \"We simplify fractions by reducing them to lowest terms.\"","singing":"Producing musical sounds with the voice. \"I enjoy singing along to the radio.\"","sir":"Term of respect for a man. \"Yes sir, I will get right on that task.\"","sister":"Female sibling or close female friend. \"I went shopping with my big sister.\"","skirt":"Garment hanging from the waist worn by girls and women. \"She wore a pretty floral print skirt.\"","sleep":"Natural periodic rest state of body and mind. \"I slept soundly through the night.\"","slip":"Slide out of position or grasp. \"My pen slipped out of my hand and fell.\"","smarter":"More intelligent or clever. \"Crows are considered one of the smarter birds.\"","smell":"Detect an odor or scent. \"I woke up smelling bacon and eggs.\"","solar":"Relating to the sun. \"The solar panels converted sunlight into electricity.\"","something":"An unknown or unspecified thing. \"Something sure smells delicious!\"","sometimes":"Occasionally, rather than all the time. \"Sometimes I like to eat dessert before dinner.\"","source":"Where something originates from. \"What is the source of that information?\"","south":"Direction to the right when facing east. \"In the US, Florida is located in the south.\"","space":"Area empty of matter. \"Outer space lies between the planets.\"","species":"A group of similar organisms that share common traits. \"Lions and housecats belong to the same species.\"","speech":"Communicating through language. \"Martin Luther King Jr. gave his famous 'I Have a Dream' speech.\"","stage":"Raised platform for performances. \"The actor walked onto the stage.\"","stairs":"Set of steps between floors in a building. \"We walked up the stairs to the top floor.\"","stand":"Rise up on ones feet. \"Please stand for the national anthem.\"","star":"A luminous celestial body like the sun. \"Stars twinkled brightly in the night sky.\"","stars":"Bright points of light in the night sky. \"The stars twinkled above our campsite.\"","start":"Begin or originate. \"Lets start our project by gathering materials.\"","started":"Began doing something. \"We started our homework right after school.\"","state":"A governed territory or province. \"Sacramento is the capital of the state of California.\"","steel":"Alloy of iron and carbon, known for strength. \"The steel beams supported the bridge.\"","stone":"Small piece of rock. \"The ancient buildings walls were made of stone.\"","story":"Account of events or experiences. \"Let me tell you a story about my summer vacation.\"","strangest":"Most odd, unusual or extraordinary. \"It was the strangest dream Ive ever had.\"","stream":"Steady flowing body of water smaller than a river. \"We fished in the cold mountain stream.\"","street":"Public road in a city or town. \"Our street is lined with tall oak trees.\"","strip":"A long, narrow section or length. \"The reflective strip enhanced visibility at night.\"","strong":"Sturdy, robust, powerful. \"Elephants have very strong leg muscles.\"","suddenly":"Unexpectedly, all at once. \"Suddenly it started raining heavily.\"","sugar":"Sweet crystalline substance from plants. \"I like a spoonful of sugar in my tea.\"","sum":"Total obtained by addition. \"What is the sum of 17 + 25?\"","sundial":"Device that shows time by shadows from the sun. \"The ancient sundial required sunshine to work.\"","sunset":"Time when sun disappears below horizon. \"We watched the beautiful orange sunset.\"","sunshine":"Light and warmth that comes from the sun. \"The sunshine felt nice after so many cloudy days.\"","swim":"Propelling oneself through water. \"I can swim across the entire pool without stopping.\"","swimming":"Moving through water by moving your body. \"I love swimming on hot summer days.\"","syllable":"A unit of speech with one vowel sound. \"The word computer has three syllables.\"","table":"Piece of furniture with flat top surface on legs. \"We ate dinner together at the table.\"","talk":"Communicate by speaking. \"Lets talk about what to do next.\"","talked":"Spoke words out loud. \"My friend and I talked about our favorite animals.\"","tallest":"Of greatest height. \"The tallest tree in the forest was over 100 feet high.\"","taught":"Provided instruction or lessons. \"My dad taught me how to ride a bike.\"","telescope":"Instrument for viewing distant objects. \"The astronomer peered through the telescope.\"","temperature":"Degree of heat present. \"The temperature dropped below freezing overnight.\"","tenderly":"Gently, with care or affection. \"She tenderly cared for the abandoned kitten.\"","terms":"Conditions under which an agreement is made. \"Do you accept these terms?\"","thankfully":"With gratitude. \"Thankfully, no one was hurt in the accident.\"","theme":"Main subject or idea. \"The theme of our party is under the sea.\"","theres":"There is. \"Theres a spelling test tomorrow.\"","thermometer":"Device for measuring temperature. \"The thermometer said it was 85 outside.\"","theyll":"They will. \"Theyll be here soon, Im sure.\"","theyre":"They are. \"Theyre my favorite band!\"","theyve":"They have. \"Theyve gone on vacation this week.\"","thick":"Having a large distance between sides. \"The walls were a foot thick solid concrete.\"","those":"Referring to specific but distant people or objects. \"Could you please pass me those apples?\"","thought":"An idea formed by thinking. \"A thought just occurred to me!\"","thump":"Heavy dull sound. \"I heard a loud thump upstairs.\"","tied":"Fastened or secured. \"I tied my shoes so they wouldnt come untied.\"","tiger":"Large feline animal with orange fur and black stripes. \"The tiger prowled through the jungle.\"","tiny":"Extremely small. \"A ladybug is a tiny insect.\"","together":"With each other, as a group. \"Lets put our money together to buy a gift.\"","tomato":"Round red fruit often used as a vegetable. \"Tomatoes are excellent on sandwiches and in salads.\"","took":"Past tense of take; went with or transported. \"She took the bus to school.\"","total":"The complete amount. \"What is the total with tax added?\"","trade":"Exchange of goods and services. \"The early settlers traded with native tribes.\"","traditional":"Based on long-established customs. \"For Thanksgiving we make all the traditional fixings.\"","travel":"Go to places away from home. \"When Im older I want to travel around Europe.\"","tribal":"Of or relating to a tribe. \"The indigenous tribal people knew the land well.\"","trying":"Making effort, striving. \"Keep trying and youll get it!\"","tube":"Long hollow cylinder. \"We floated down the river in an inner tube.\"","tundra":"A cold, treeless Arctic biome. \"Reindeer live on the Arctic tundra.\"","uncle":"Brother of ones parent. \"My uncle loves to tell funny stories.\"","under":"Below or underneath something. \"The dog slept under the porch during the storm.\"","understood":"Comprehended the meaning. \"I finally understood those algebra equations, thanks!\"","until":"Up to a certain time or event. \"I read quietly until it was time for dinner.\"","upon":"On top of something. \"The cat curled up upon the pillow.\"","useful":"Providing utility, helpful. \"A flashlight is useful during a power outage.\"","value":"Worth in terms of usefulness or importance. \"Family heirlooms have sentimental value.\"","vegetable":"Edible plant grown for food. \"Broccoli is a healthy green vegetable.\"","verb":"Word used to describe an action. \"Jump, walk and swim are verbs.\"","verdict":"Decision or judgment in a trial. \"The jury reached a verdict after deliberating.\"","village":"Small rural settlement or community. \"The quaint village had lovely flower gardens.\"","vision":"Sense of sight. \"Use protective eyewear to avoid damage to your vision.\"","visit":"Go see someone, stop by a place. \"My friend visited from out of town last weekend.\"","vitamins":"Organic compounds necessary for health. \"Oranges contain vitamin C.\"","voice":"Sound produced by speaking or singing. \"She had a beautiful singing voice.\"","volts":"Unit measuring electrical force or pressure. \"This AA battery provides 1.5 volts.\"","walk":"Move by placing one foot after another. \"We went for a long walk after dinner.\"","war":"Armed conflict between nations. \"They studied the Civil War in school.\"","wasnt":"Was not. \"I wasnt talking during class, honest.\"","watch":"Look at closely, observe over time. \"I like to watch the ducks in the pond.\"","wave":"Raised ridge of water moving across surface. \"We jumped over the waves crashing on shore.\"","way":"Method or path for traveling. \"Which way should we drive to your house?\"","wed":"We would. \"Wed like more time to complete the assignment.\"","weigh":"Determine mass or heaviness. \"Lets weigh these watermelons to find the heaviest.\"","welcome":"Greet someone kindly upon arrival. \"Welcome to our home!\"","well":"We will. \"Dont worry, well help you finish up.\"","were":"We are. \"Were almost there, just a short walk left.\"","west":"Cardinal direction left when facing north. \"We drove west to see the Pacific Ocean.\"","wheel":"Circular device that rotates for movement. \"The wagon wheel was worn and creaky.\"","whether":"If it be the case that; or. \"I wonder whether she got my message.\"","while":"During the time that. \"Talk quietly while others are studying please.\"","whole":"Complete, entire. \"Eat the whole apple - core and all!\"","whose":"Belonging to whom. \"Whose book is this on the desk?\"","width":"Distance from side to side. \"The width of the room was 15 feet.\"","wife":"A married woman. \"He went to the movies with his wife.\"","willow":"Tree with long, thin leaves. \"The willows branches swayed gracefully in the breeze.\"","winter":"Coldest season of the year. \"Everything is covered in snow during winter.\"","without":"Not having or including. \"I left without my wallet by mistake.\"","women":"More than one female adult. \"Those women are world-class athletes.\"","wont":"Will not. \"I wont be able to attend the party tonight.\"","worn":"Damaged from use. \"My worn out sneakers have holes now.\"","worried":"Troubled, concerned. \"I was worried about you when you didnt call.\"","worth":"Having value equal to cost or importance. \"This antique vase is worth hundreds of dollars.\"","wrap":"Enclose or fold something in paper, cloth, etc. \"Please wrap the gift before you bring it to the party.\"","wrinkle":"A crease, line or ridge in something. \"The shirt was wrinkled so I had to iron it.\"","wrist":"Joint connecting the hand to the arm. \"She wore a bracelet around her wrist.\"","wrong":"Not correct, mistaken. \"Oops, my answer was wrong - let me try again.\"","yard":"Unit of length equal to 3 feet. \"Our backyard is about 50 yards wide.\"","youll":"You will. \"Youll really enjoy this movie!\"","young":"In early life or growth stages. \"Lion cubs are young lions.\"","youre":"You are. \"Youre my best friend!\"","youve":"You have. \"Youve gotten so tall since I last saw you!\"","zero":"The number 0, nothing. \"Zero is the result when you subtract 5 from 5.\""},{"absolute":"Complete and total. \"His absolute refusal to eat vegetables was frustrating.\"","abuse":"To use wrongly or improperly. \"The abuse of the environment has caused many problems.\"","academic":"Relating to school and education. \"She excelled in all her academic subjects.\"","achieve":"To successfully reach a goal. \"With hard work, he was able to achieve his dreams.\"","across":"From one side to the other. \"We walked across the field.\"","acrylic":"A type of paint or plastic. \"The acrylic paint dried quickly.\"","actor":"A person who performs in plays or movies. \"Her favorite actor was in the new movie.\"","actress":"A female actor. \"The actress gave an emotional performance.\"","acute":"Very serious or severe. \"He had an acute case of the flu.\"","adage":"An old saying or proverb. \"The adage 'Haste makes waste' warns against rushing.\"","address":"The location at which someone lives. \"I wrote my address on the letter.\"","adoption":"The act of legally taking another's child as one's own. \"The adoption agency helped match children with new parents.\"","advance":"To move forward. \"The soldiers advanced toward the battlefield.\"","adventure":"An exciting experience. \"Climbing the mountain was quite an adventure!\"","affection":"Fondness or caring. \"She showed affection to the new puppy.\"","afford":"To have enough money for something. \"He could not afford a new bike.\"","against":"In opposition to. \"She argued against the rule change.\"","alarm":"A warning sound or signal. \"The fire alarm rang loudly.\"","alligator":"A large reptile with a long snout. \"The alligator swam quietly through the swamp.\"","allowance":"Money given regularly to a child by parents. \"He spent his allowance at the candy store.\"","alone":"By oneself, not with others. \"She preferred to study alone rather than in a group.\"","aloof":"Indifferent or distant. \"She seemed aloof and unfriendly at the party.\"","already":"Prior to some time or event. \"We had already eaten dinner when you called.\"","although":"Despite the fact that. \"Although it was cold, we went swimming.\"","amuse":"To entertain or make laugh. \"The clown amused the children at the birthday party.\"","angle":"The space between two intersecting lines. \"The angle was 45 degrees.\"","ankle":"The joint between the foot and leg. \"She sprained her ankle during the game.\"","antonym":"A word opposite in meaning to another. \"Hot is an antonym of cold.\"","anyone":"Any person at all. \"Has anyone seen my keys?\"","anything":"Any object, event or idea. \"Is there anything more I can do to help?\"","appoint":"To choose or assign officially. \"The mayor appointed a new police chief.\"","apricot":"An orange fruit with a pit. \"She made an apricot pie for dessert.\"","archer":"Someone who shoots with a bow and arrow. \"The archer hit the center of the target.\"","architecture":"The design of buildings. \"Chicago is famous for its architecture.\"","arithmetic":"Math dealing with addition, subtraction and so on. \"Learning arithmetic is important.\"","array":"An orderly arrangement. \"The array of flowers was beautiful.\"","artistic":"Having skill or taste in creative arts. \"Her artistic talent was obvious from a young age.\"","Asia":"The largest continent on Earth. \"China is a country in Asia.\"","askew":"Crooked or slanted. \"The picture on the wall was askew.\"","assure":"To tell someone confidently. \"I assure you everything will be alright.\"","astronomy":"The study of outer space. \"She was fascinated by astronomy.\"","attraction":"Something interesting that attracts attention. \"The Ferris wheel was the main attraction.\"","Australia":"A country that is also a continent. \"Kangaroos come from Australia.\"","average":"Typical or usual. \"His grades were average.\"","axis":"An real or imaginary line around which objects rotate. \"Earth rotates around its axis.\"","backpack":"A bag carried on the back. \"He packed his lunch in his backpack.\"","balance":"To weigh equally or stay upright. \"She struggled to balance on one foot.\"","ballot":"A ticket used for voting. \"Many people submitted ballots by mail.\"","banana":"A long, yellow fruit. \"Bananas are rich in potassium.\"","bandage":"Material used to wrap wounds. \"The bandage helped stop the bleeding.\"","bandit":"Someone who steals things. \"The bandit robbed the bank.\"","banquet":"A large, formal dinner. \"The charity banquet raised money to build a new hospital.\"","barber":"Someone who cuts hair. \"The barber gave him a short haircut.\"","bargain":"A very low price. \"She found a bargain on shoes at the sale.\"","barking":"The loud sound dogs make. \"The barking kept us awake at night.\"","barrel":"A large cylindrical container. \"Apples were stored in the barrel for winter.\"","basin":"A bowl for washing. \"She filled the basin with warm water.\"","battery":"A device that produces electricity. \"The battery powered the flashlight.\"","became":"To change into, develop into. \"He became a fine young man.\"","become":"To come to be something or someone. \"She will become a doctor someday.\"","believe":"To accept something as true. \"I believe it might snow tonight.\"","berry":"A small, edible fruit. \"Strawberries are a delicious berry.\"","beside":"At the side of. \"Stand beside me in line.\"","bitter":"Having a sharp, unpleasant taste. \"He disliked the bitter medicine.\"","blanket":"A warm cover for a bed. \"They picnicked on a soft blanket.\"","bleacher":"Stands at sports events. \"The crowd roared from the bleachers.\"","blown":"Moved by wind or air. \"The leaves were blown off the trees.\"","boast":"To brag about oneself. \"He liked to boast about his fast car.\"","boomtown":"A town growing very quickly. \"The gold rush turned it into a boomtown.\"","bother":"To annoy or disturb. \"Loud noises bother me when I'm trying to read.\"","bracket":"A carved support or a symbol []. \"The heavy shelf was held up with a bracket.\"","brass":"An alloy made of copper and zinc. \"The brass instruments shone in the sunlight.\"","breeze":"A light, gentle wind. \"A cool breeze came from the lake.\"","bridal":"Related to a wedding. \"She wore a lovely bridal gown.\"","bridge":"A structure that spans over a river, road, etc. \"We walked across the bridge.\"","broken":"Separated into pieces. \"The broken plate cut her finger.\"","brotherhood":"The fellowship between brothers or close friends. \"They treasured their brotherhood.\"","brought":"Carried from one place to another. \"He brought snacks to the party.\"","browser":"Software to access the internet. \"She used a browser to search the web.\"","bubble":"A floating ball of air or gas. \"The child blew bubbles with the wand.\"","bucket":"An open container with a handle. \"Fill the bucket with water.\"","bugle":"A brass musical instrument. \"The bugle played a military tune.\"","building":"A structure with a roof and walls. \"The building had ten floors.\"","burden":"Something difficult to carry or endure. \"The heavy load was a burden.\"","bureau":"A chest of drawers or government agency. \"He stored clothes in the bureau.\"","button":"A small disc fastened to cloth. \"The button popped off her shirt.\"","bytes":"Units of digital information. \"The file was several megabytes in size.\"","cabbage":"A vegetable with green or purple leaves. \"We had cooked cabbage with dinner.\"","cable":"A thick rope or wire. \"The cable supported the bridge.\"","calendar":"A chart of days, weeks, and months. \"He marked the date on his calendar.\"","calf":"A young cow or other cattle. \"The playful calf frolicked in the meadow.\"","calm":"Quiet, peaceful and still. \"The lake was calm and smooth as glass.\"","camera":"A device to take photographs. \"I used my new camera on vacation.\"","camouflage":"Coloring or patterns for concealment. \"Its camouflage made the moth hard to spot.\"","cannon":"A large mounted gun. \"The cannon fired a loud boom.\"","canvas":"A sturdy cloth for painting on. \"The artist stretched the canvas before starting to paint.\"","canyon":"A deep gorge between cliffs. \"The hikers climbed out of the canyon.\"","capture":"To catch someone and make a prisoner. \"The suspect was captured by the police.\"","carbon":"A common element found in all living things. \"Carbon is an important building block of life.\"","career":"A profession or occupation. \"She studied medicine and had a career as a doctor.\"","carnivore":"An animal that eats meat. \"Lions are carnivores that hunt antelope.\"","carriage":"A vehicle pulled by horses. \"The princess arrived in an elegant carriage.\"","carrot":"An edible orange root. \"Bunnies love to eat carrots.\"","carton":"A box made of stiff paper. \"The milk carton was empty.\"","cartridge":"A container of ink or toner. \"The printer was out of the black cartridge.\"","carve":"To cut into a hard material. \"Jack used his knife to carve a piece of wood.\"","castle":"A large fortified building or complex. \"The castle had tall stone walls and a moat.\"","catch":"To capture or grab. \"He tried to catch the ball.\"","catcher":"The baseball player behind home plate. \"The catcher threw the ball back to the pitcher.\"","cattle":"Cows, bulls, or steers. \"The cattle grazed calmly in the meadow.\"","caution":"Care taken to avoid danger. \"Drive with caution in the rain.\"","celebrate":"To honor with festive rites. \"They celebrate their anniversary each year.\"","cello":"A large musical instrument. \"She started playing the cello when she was young.\"","centimeter":"A metric unit of length. \"The pencil was fifteen centimeters long.\"","century":"One hundred years. \"It had been a century since the historic event.\"","certain":"Definite or sure. \"I'm certain that is the right choice.\"","chain":"A series of connected links or rings. \"He locked his bike with a chain.\"","channel":"A path for water or TV signals. \"They watched the news channel.\"","chapel":"A small church. \"The chapel hosted weddings and baptisms.\"","character":"The traits and morals of a person. \"He was known for his kind character.\"","charcoal":"A drawing material made by burning wood. \"The barbecue used charcoal to cook the food.\"","charge":"To ask payment for goods or services. \"They didn't charge much for the room.\"","charm":"An object worn to bring good luck or fortune. \"The charm on her bracelet was an antique.\"","cherub":"A winged angel or child. \"The mural featured happy cherubs.\"","chicken":"A common farm bird raised for meat or eggs. \"We had roasted chicken for dinner.\"","choir":"A group of singers. \"The choir sang carols at Christmas.\"","chord":"A combination of musical tones. \"She practiced playing different chords on the piano.\"","citizenship":"The status of being a citizen. \"Citizenship comes with rights and responsibilities.\"","claim":"To say something is true without proof. \"He claimed it wasn't his fault, but had no evidence.\"","clause":"Part of a sentence with a subject and verb. \"The dependent clause could not stand alone.\"","closure":"An end or conclusion. \"The criminal's capture brought closure to the case.\"","clothes":"Garments and apparel. \"I hung my clothes up to dry.\"","coach":"To train someone, or a bus. \"The coach taught the players new skills.\"","coastal":"Near the coast or shoreline. \"It was a lovely coastal town.\"","collection":"A group of objects or works. \"She had an impressive insect collection.\"","college":"An institution of higher learning. \"After high school, she went to college.\"","colon":"Punctuation with two dots (:). \"There was a colon before the list of items.\"","comedy":"A story with a happy ending. \"The play was a lighthearted comedy.\"","comment":"To express an opinion or observation. \"Please comment on the new proposal.\"","community":"A group who live and interact in the same area. \"It was a very close-knit community.\"","commute":"To regularly travel between work and home. \"His commute took over an hour each way.\"","compass":"A device that shows directions. \"We used a compass so as not to get lost.\"","compassion":"Deep caring and sympathy for others. \"She showed compassion by volunteering at the hospital.\"","compatible":"Able to exist together in harmony. \"The roommates had compatible personalities.\"","complete":"With all parts, total. \"She made a complete list of what to pack.\"","completion":"The act of finishing. \"We celebrated the completion of the project.\"","compose":"To create or make up. \"She composed a beautiful melody.\"","computer":"An electronic device that processes data. \"I used my computer to write an essay.\"","concern":"Worry, care, or interest. \"Safety was their main concern.\"","conductor":"The leader of an orchestra. \"The conductor waved the baton enthusiastically.\"","congress":"The national legislative body. \"Congress voted on the law.\"","conservation":"The protection of nature. \"Conservation of forests is important.\"","construction":"The building of structures. \"The high-rise construction will finish next year.\"","contact":"The act of communicating or touching. \"Please contact me with any questions.\"","contain":"To hold or include. \"The bottle contained juice.\"","contest":"A competition or race. \"He won first place in the pie-eating contest.\"","continent":"A large landmass like Africa or Asia. \"There are seven continents.\"","control":"To direct or regulate. \"The experiment was under control.\"","cookies":"Small, sweet, baked treats. \"Chocolate chip cookies are my favorite.\"","copper":"A reddish-brown metal that conducts electricity. \"The wires were made of copper.\"","corner":"The point where two lines meet. \"The spider waited in the corner.\"","corona":"The outer atmosphere of the sun. \"The corona was visible during the eclipse.\"","corruption":"Dishonesty, bribery. \"The mayor resigned due to corruption.\"","cotton":"A soft, fluffy fiber used to make cloth. \"She wore a comfortable cotton shirt.\"","couldn't":"Could not. \"He couldn't run any further.\"","council":"A group that makes rules or gives advice. \"The student council made plans for a dance.\"","courage":"Bravery in the face of fear. \"She had the courage to speak her mind.\"","course":"Part of a meal or a path. \"For the main course, I'll have chicken.\"","cousin":"The child of a parent's sibling. \"My cousin and I played tag together as kids.\"","covered":"Sheltered or hidden by something on top. \"The pool was covered when not in use.\"","creature":"Any living thing, animal or human. \"The strange creature had wings like a bat.\"","credit":"Praise, approval or borrowed money. \"She got credit for the group project.\"","crew":"A group working together. \"The road crew repaired the potholes.\"","crocodile":"A large reptile with sharp teeth. \"The crocodile lunged at its prey.\"","crooked":"Bent or not straight. \"The crooked branch couldn't support much weight.\"","crowd":"A large group of people. \"A huge crowd gathered to hear the musician.\"","crumble":"To fall apart into small pieces. \"The cookies started to crumble.\"","crusher":"A machine that breaks material into smaller pieces. \"The crusher turned the concrete into gravel.\"","crust":"The outermost layer. \"The crust of the pie was flaky.\"","curb":"The edge of a street next to the sidewalk. \"The curb was painted red at the corner.\"","customary":"Normal way of behaving. \"It is customary to shake hands when you meet someone.\"","damage":"Harm or injury. \"The storm caused damage to the roof.\"","debris":"Scattered fragments or rubble. \"After the storm there was debris scattered everywhere.\"","decade":"A period of ten years. \"She taught at the school for over a decade.\"","deceive":"To mislead or trick. \"Try not to deceive people with your words.\"","decide":"To make up one's mind. \"I can't decide what to order for lunch.\"","decode":"To figure out the meaning of. \"She tried to decode the secret message.\"","delete":"To remove or erase. \"Be careful not to delete any important files.\"","demand":"To strongly ask for or require. \"The workers demand fair wages.\"","dental":"Relating to teeth. \"Brush your teeth to maintain good dental hygiene.\"","departure":"The act of leaving. \"Our departure time is 7:30am.\"","depend":"To rely or count on. \"I depend on my alarm clock to wake me up.\"","deposit":"To put money into an account. \"She made a deposit at the ATM.\"","depression":"Extreme sadness or gloom. \"After losing his job, he felt depression.\"","describe":"To tell characteristics or give an account. \"Please describe your experience.\"","destroy":"To ruin completely, demolish. \"The building was destroyed by the earthquake.\"","determine":"To find out definitively. \"We need to determine the cause of the problem.\"","develop":"To grow or progress. \"They developed a cure for the disease.\"","devotion":"Deep commitment or dedication. \"She had great devotion to her family.\"","diamond":"A clear gemstone made of carbon. \"The diamond ring sparkled brightly.\"","dictionary":"A book of words and definitions. \"I looked up the word in the dictionary.\"","diet":"The food a person or animal eats. \"She followed a healthy diet.\"","digestion":"The process of breaking down food. \"Eating slowly aids digestion.\"","digital":"Relating to electronic technology. \"Digital cameras are convenient.\"","dimension":"A measurement such as length or height. \"The box had three dimensions - height, width and depth.\"","dimple":"A small indentation on the cheek or chin. \"Her smile revealed the cute dimples on her cheeks.\"","dining":"Relating to eating dinner. \"The dining room had a lovely chandelier.\"","dirty":"Soiled, unclean. \"My clothes got dirty after playing outside.\"","discuss":"To talk about or exchange ideas. \"We will discuss the issue at the meeting.\"","dispersal":"The spreading or distribution. \"The pollen dispersal caused her allergies to flare up.\"","disruption":"Disturbance or problems preventing something. \"The power outage caused disruption to the trains.\"","distraction":"Something that diverts your attention. \"Loud noise was a distraction during the test.\"","district":"An area or region. \"Our district has several elementary schools.\"","dolphin":"An intelligent, aquatic mammal. \"The dolphin leapt gracefully from the water.\"","dragon":"A mythical monster, often able to breathe fire. \"The brave knight fought the dragon.\"","drama":"A play or theater performance. \"The school drama club put on several plays.\"","drill":"To pierce a hole or practice. \"We did evacuation drills at school.\"","duet":"A piece of music for two performers. \"The singers performed a beautiful duet.\"","during":"Throughout the course of. \"He napped during the movie.\"","dwelling":"A place to live, house or residence. \"They lived in a modest dwelling.\"","early":"Near the beginning of time or at the start. \"We arrived early to get good seats.\"","earthquake":"Shaking or trembling of the earth. \"The earthquake toppled buildings.\"","earthworm":"A worm that lives in and improves soil. \"Earthworms help enrich the soil.\"","echolocation":"A technique bats use to locate objects by sound echoes. \"Bats use echolocation to navigate and find prey.\"","eclipse":"An eclipse occurs when the Earth, sun and moon align. \"We could see a lunar eclipse in the night sky.\"","ecology":"The study of how organisms interact with their environment. \"The class learned about forest ecology.\"","ecosystem":"A community of living things interacting in an environment. \"The pond was a thriving ecosystem.\"","eighteen":"The number 18. \"My brother turned eighteen last week.\"","eighty":"The number 80. \"It was a very hot day, nearly eighty degrees.\"","either":"One or the other of two things. \"Either choice seems good to me.\"","elbow":"The joint between the arm and forearm. \"He rested his elbows on the table.\"","elected":"Chosen by voting. \"She was elected president of the club.\"","electricity":"A form of energy used for power. \"Electricity powered the lights in the room.\"","elephant":"A very large mammal with a long trunk. \"The elephant used its trunk to pick up food.\"","elevation":"Height above sea level. \"The elevation made breathing difficult.\"","elevator":"A compartment that moves up and down in a building. \"We took the elevator to the top floor.\"","eleven":"The number 11. \"There are eleven players on a soccer team.\"","emerald":"A green gemstone. \"She wore an emerald necklace.\"","emotion":"A strong feeling like love or anger. \"Winning stirred up emotions of joy and pride.\"","endure":"To suffer patiently or last for a long time. \"They had to endure the bitter cold.\"","energy":"Power used to provide electricity and do work. \"The city relied on renewable energy sources.\"","engineer":"Someone who designs or builds engines, machines, etc. \"The engineer designed the bridge.\"","English":"The language we are speaking now. \"I am fluent in English.\"","envelope":"A folded paper container for a letter. \"She mailed the envelope to her friend.\"","equation":"A mathematical statement of equality. \"The equation balanced the variables on both sides.\"","equator":"The imaginary circle around the middle of the Earth. \"The equator divides the globe into north and south.\"","erosion":"The gradual wearing away of rock or soil. \"Wind and water led to erosion of the riverbanks.\"","erratic":"Irregular or unpredictable. \"The printer was working fine before the erratic error messages.\"","Europe":"A continent with many countries like France, Germany, etc. \"We went on a tour of Europe last summer.\"","everything":"All things. \"She documented everything in her diary.\"","evil":"Immoral and wicked. \"The evil queen was cold-hearted.\"","except":"Not including or other than. \"I eat everything except brussels sprouts.\"","executive":"A senior manager in an organization. \"He was promoted to executive vice president.\"","exercise":"Physical activity to improve fitness. \"Daily exercise is important for good health.\"","explain":"To make something clear or understandable. \"Can you explain the directions again?\"","expression":"A phrase or statement. \"Her facial expression showed surprise.\"","extend":"To stretch out or lengthen. \"They decided to extend the deadline.\"","factory":"A building where goods are manufactured. \"The factory produced appliances and electronics.\"","fatal":"Causing death. \"The fatal wound was too severe to treat.\"","fault":"Responsibility for something bad. \"It wasn't your fault - don't blame yourself.\"","feature":"To showcase or highlight. \"The new model features voice controls.\"","field":"An open grassy area or realm of study. \"The soccer teams played on the field.\"","fifteen":"The number 15. \"There were fifteen cookies left.\"","fifty":"The number 50. \"His speed was fifty miles per hour.\"","figure":"A number, shape, or bodily form. \"Can you figure out the answer?\"","filled":"Full, made complete. \"The glass was filled to the rim with water.\"","finally":"At last, in the end. \"She finally finished her homework.\"","finger":"One of five digits on the hand. \"He cut his finger while slicing vegetables.\"","finish":"To complete or reach the end. \"They were excited to finish the marathon.\"","fixture":"Something securely attached. \"The light fixture illuminated the room.\"","flamingo":"A pink or reddish aquatic bird. \"Flamingos stand on one leg while resting.\"","flasher":"A blinking light. \"The police car's flasher was spinning.\"","flooding":"An overflow or inundation of water. \"The heavy rains caused flooding in the city.\"","footprint":"An imprint of a foot. \"We followed the footprints along the beach.\"","force":"Strength or power. \"She hit the ball with force.\"","format":"The structure or layout of something. \"The essay had the correct format.\"","forty":"The number 40. \"A human pregnancy normally lasts forty weeks.\"","forward":"Toward the front, in the direction ahead. \"Walk forward between the cones.\"","fossil":"Remains or traces of ancient life. \"The fossil was embedded in the rock.\"","fourteen":"The number 14. \"There are fourteen days in a fortnight.\"","fragile":"Easily broken or damaged. \"She packed the fragile ornament carefully.\"","frame":"A structure that surrounds and supports. \"The picture was mounted in an ornate frame.\"","freckle":"A small brownish spot on the skin. \"He had freckles across his cheeks and nose.\"","fresh":"Newly made or harvested. \"We picked fresh apples from the orchard.\"","fresher":"More fresh, newer. \"Open the box with the fresher eggs first.\"","friend":"A person you like and enjoy spending time with. \"She met her best friend in kindergarten.\"","furniture":"Chairs, tables, beds, etc in a room. \"The furniture was arranged nicely in the living room.\"","gadget":"A useful device or invention. \"The latest gadgets were on display at the conference.\"","gallon":"A unit of volume equal to four quarts. \"The milk jug held one gallon.\"","garbage":"Trash or waste. \"Please take the garbage out.\"","garlic":"A pungent, onion-like seasoning. \"Garlic powder added flavor to the pasta sauce.\"","generalize":"To make a broad, sweeping statement. \"It's wrong to generalize about whole groups of people.\"","generate":"To produce or create. \"The factory generates a lot of pollution.\"","gerbil":"A small, tailed rodent kept as a pet. \"The gerbil ran quickly on its exercise wheel.\"","ghost":"The spirit of a dead person. \"She dressed up as a ghost for Halloween.\"","glacier":"A large mass of slow moving ice. \"The glacier carved out the valley.\"","globe":"A spherical model of the Earth. \"He pointed to Australia on the globe.\"","goal":"Something you hope to achieve, an aim. \"Scoring a goal won the soccer match.\"","golden":"Made of gold or having a gold color. \"The golden retriever happily fetched the stick.\"","goose":"A common waterfowl with a long neck. \"The mother goose watched over her goslings.\"","gorilla":"A large, strong ape from Africa. \"The gorilla beat its chest loudly.\"","gram":"A metric unit of mass and weight. \"The package weighed one gram.\"","grapefruit":"A large, sour citrus fruit. \"She cut the grapefruit in half before eating it.\"","guest":"A visitor or someone invited. \"We prepared the guest room for Grandma's visit.\"","gusher":"A strong, spurting flow. \"Oil shot from the well in a high-pressure gusher.\"","habit":"A regular behavior or custom. \"Going to bed early was her habit.\"","habitat":"The natural environment of a plant or animal. \"The coral reef was the habitat for tropical fish.\"","half":"One of two equal parts. \"She ate half the pizza.\"","hammer":"A tool with a heavy metal head for pounding. \"Use a hammer to nail in the picture frame.\"","happened":"Took place or occurred. \"An amazing thing happened yesterday!\"","harbor":"A sheltered port or haven. \"The boats were safe in the harbor.\"","heard":"Detected sound with the ear. \"We heard the bell ring.\"","heart":"The organ that pumps blood through your body. \"My heart was beating quickly with excitement.\"","heaven":"The sky or realm believed to be God's dwelling place. \"She imagined heaven to be peaceful and full of joy.\"","heavy":"Having great weight, not light. \"Be careful, that box looks too heavy to lift.\"","hemisphere":"Half of the Earth, divided into north and south. \"We live in the Northern hemisphere.\"","herbivore":"An animal that only eats plants. \"Deer are herbivores that feed on leaves and grasses.\"","herd":"A large group of animals that live together. \"The herd of cattle roamed across the plains.\"","hermit":"Someone who lives alone and apart from society. \"The hermit lived alone in the woods.\"","homework":"Schoolwork done at home. \"I have to do my homework before dinner.\"","hostile":"Unfriendly, antagonistic. \"The hostile crowd shouted angrily at us.\"","hotel":"An establishment providing lodging for travelers. \"We stayed at a nice hotel on our vacation.\"","hundredths":"Units equal to one part in a hundred. \"The calculation was carried out to two hundredths of a percent.\"","husband":"A married man. \"Her husband surprised her with flowers.\"","iceberg":"A large floating mass of ice. \"The enormous iceberg floated slowly out to sea.\"","igloo":"A dome-shaped shelter made of blocks of snow. \"The Inuit people built igloos to live in.\"","illegal":"Against the law, unlawful. \"Stealing is an illegal act that can result in arrest.\"","illusion":"Something that deceives by producing a false impression. \"The magician used illusion to make the rabbit disappear.\"","illustrate":"To draw pictures or provide examples. \"She illustrated her point with a graph.\"","image":"A visual representation of something. \"The mirror showed her image.\"","imitate":"To copy the actions, appearance, or speech of someone. \"The bird learned to imitate human words.\"","immature":"Not fully grown or developed. \"He acted in an immature way.\"","immigrant":"A person who comes to live permanently in a new country. \"His great-grandparents were immigrants from Italy.\"","include":"To contain as part of something. \"My homework includes reading two chapters.\"","infection":"A disease or illness caused by germs. \"The cut healed slowly due to infection.\"","inflation":"An overall increase in prices. \"Inflation made everything more expensive.\"","inflection":"Change in the tone or pitch of your voice. \"The inflection in her voice conveyed her sadness.\"","injure":"Hurt physically. \"I hope I don't injure myself riding my bike.\"","inside":"Within or internal. \"It was cold outside but warm inside.\"","inspection":"A close examination or formal evaluation. \"The vehicle passed its annual safety inspection.\"","instead":"In place of or as an alternative. \"Let's go bowling instead of to the movies.\"","instruments":"Tools or devices used for a specific purpose. \"The dentist used various instruments to fill the cavity in my tooth.\"","interest":"Curiosity or concern about something. \"Reading is one of her interests.\"","intersecting":"Crossing or meeting at a point. \"The intersecting lines crossed in the middle.\"","invasion":"An attack by military force. \"The invasion was an act of war.\"","invention":"Something new that someone created or thought up. \"The light bulb was a useful invention.\"","invitation":"A request to attend or participate. \"She was happy to accept the invitation to the party.\"","irritation":"The state of being annoyed or angry. \"The itchy rash was an irritation.\"","island":"Land surrounded by water. \"We sailed to a small island for a picnic.\"","itself":"Reflexive form of it. \"The plant could reproduce itself from a cutting.\"","jewel":"A precious stone like a diamond. \"The jewel sparkled in the light.\"","joined":"Became a member of, connected together. \"He joined the soccer team.\"","judicial":"Relating to courts of law or judges. \"He works in the judicial system as a lawyer.\"","jungle":"Dense tropical forest with lush vegetation. \"The jungle was filled with the sounds of exotic birds.\"","juvenile":"Young, childish, or relating to youth. \"His juvenile behavior embarrassed his older siblings.\"","kangaroo":"An Australian mammal that hops and carries young in a pouch. \"The baby kangaroo peeked out from its mother's pouch.\"","kept":"Maintained possession of, looked after. \"She kept all her old photos in an album.\"","keyboard":"The keys used to type on a computer or piano. \"The keyboard had 108 keys.\"","kilogram":"A metric unit of mass equal to 1000 grams. \"The package weighed three kilograms.\"","kilometer":"A metric measure equal to 1000 meters. \"We jogged five kilometers this morning.\"","kingdom":"A country ruled by a king or queen. \"The kingdom was filled with castles and knights.\"","kitchen":"A room used for storing, cooking, and eating food. \"She baked cookies in the kitchen.\"","knight":"An honored defender or champion. \"The knight wore a suit of armor.\"","knuckle":"A joint of a finger. \"She cracked her knuckles before typing.\"","landscape":"Natural outdoor scenery or a painting depicting this. \"The landscape photo showed mountains and trees.\"","language":"A system of communication through speech or signs. \"She was fluent in three languages.\"","latitude":"Distance north or south from the equator. \"Sailing the high latitudes required warm clothing.\"","lecture":"An informative speech or talk. \"The professor was brilliant at delivering lectures.\"","ledge":"A narrow horizontal surface along a wall. \"The ledge held a neat row of potted plants.\"","legislative":"Relating to enacting laws. \"Congress has legislative powers, like passing new laws.\"","leisure":"Free time for enjoyment. \"Gardening was her favorite leisure activity.\"","lemon":"A sour, yellow citrus fruit. \"When life gives you lemons, make lemonade.\"","lettuce":"A salad plant with edible leaves. \"He put lettuce, cucumbers and tomatoes into the salad.\"","listening":"Paying attention to sound. \"Careful listening is a valuable skill.\"","liter":"A metric unit of volume, equal to 1000 cubic cm. \"The milk carton held one liter.\"","literature":"Writings on a subject, especially creative works. \"She studied English literature in college.\"","locally":"Within a neighborhood or town. \"We bought all our produce locally.\"","lodge":"A small house or cottage. \"The ski lodge was cozy after a day on the slopes.\"","longitude":"Distance east or west from the prime meridian. \"Sailing different longitudes led to circumnavigating the globe.\"","lower":"More near the bottom or ground. \"She lowered the blind to let less light in.\"","luggage":"Suitcases or bags for carrying belongings when traveling. \"They packed their luggage the night before.\"","machine":"A device with moving parts that performs work. \"The machine stamped out shapes from metal.\"","magnetic":"Having a force that attracts certain metals. \"The crane used a magnetic lifting system.\"","marble":"A spherical glass toy or stone statue. \"The marble statue was carved from white stone.\"","margin":"A border or edge. \"Notes filled the margins of her textbook pages.\"","marriage":"The union of two people as partners. \"The happy couple celebrated their twentieth marriage anniversary.\"","marvelous":"Wonderful, amazing. \"Seeing the pyramids was a marvelous experience.\"","mathematics":"The study of numbers, shapes, and quantities. \"She excelled at mathematics.\"","mature":"Fully grown or developed. \"Tomatoes take months to mature from a small seed into full-sized fruits.\"","maybe":"Possibly. \"Maybe it will snow this weekend.\"","medium":"Middle, average, or neither small nor large. \"She ordered her steak cooked medium.\"","member":"A part of a group or one of the elements. \"He was a member of the soccer league.\"","memory":"Something remembered, or the ability to remember. \"Looking at old photos brought back happy memories.\"","mental":"Related to the mind. \"Creative thinking engages the mental faculties.\"","merchant":"A business person who sells goods. \"The merchant sold beautiful handmade crafts.\"","mercy":"Kindness, forgiveness, or restraint. \"Luckily the other team showed mercy and didn't run up the score.\"","merely":"Only, just. \"It was merely a simple misunderstanding.\"","merge":"To blend together into one. \"The lanes merge just ahead.\"","merit":"Worth, excellence, or virtue. \"Her hard work and dedication was of great merit.\"","metal":"An element like iron or copper that is a shiny solid. \"The robot was made of metal.\"","metaphor":"A figure of speech making a comparison between two unlike things. \"He used the metaphor as busy as a bee to describe her.\"","method":"An established or systematic way of doing something. \"Follow the recipe method exactly for best results.\"","milligram":"One thousandth of a gram. \"The dose was 250 milligrams.\"","millimeter":"One thousandth of a meter. \"The pencil was 5 millimeters wide.\"","million":"The number 1,000,000. \"It's hard to visualize such a huge number as a million.\"","miner":"Someone who works in a mine. \"The coal miner headed down into the tunnels.\"","miniature":"Representing something on a very small scale. \"She collected miniature model cars.\"","minus":"The operation of subtraction. \"Six minus two is four.\"","mistook":"Incorrect, misunderstood. \"She mistook his meaning.\"","mitten":"A glove with a thumb but no fingers. \"Her mittens helped keep her hands warm.\"","mixture":"Something made by combining different items. \"The trail mix was a mixture of nuts, seeds, and raisins.\"","mobile":"Able to move around, not fixed. \"Since it was a mobile health clinic, it could travel to remote areas.\"","moisture":"Slight wetness or dampness. \"The plants thrived in the moisture from the rain.\"","moment":"A brief period of time. \"Wait a moment while I grab my keys.\"","monitor":"Observe carefully, or a screen display. \"Please monitor the temperature gauge.\"","monkey":"A small primate with long arms and tail. \"The zoo had several energetic monkeys.\"","monster":"An imaginary frightening creature. \"The actor wore a costume to portray the monster.\"","moody":"Given to frequent changes of mood. \"She felt moody before her morning coffee.\"","mortal":"Certain to die one day. \"To err is human, to forgive divine.\"","movement":"Motion, change of position. \"The movement of the line was unpredictable.\"","movie":"A film shown in a theater or on TV. \"Lets watch a funny movie tonight.\"","muffin":"A small, dome-shaped quick bread. \"Blueberry muffins are my favorite kind.\"","musket":"An early type of long gun with a smooth bore. \"The Revolutionary War soldiers carried muskets.\"","mute":"Silent, no sound. \"Please mute your microphone when not speaking.\"","nail":"A small metal spike used to join materials. \"Use nails to construct the frame.\"","nasal":"Related to the nose. \"The nasal spray relieved her stuffy nose.\"","negative":"Expressing 'no' or refusal. \"We received a negative response to our proposal.\"","neighbor":"Someone living nearby. \"Our neighbor kindly collects our mail when we're away.\"","neither":"Not either of two things. \"Neither choice seems quite right to me.\"","nervous":"Easily worried, anxious. \"She felt nervous before her piano recital.\"","neutral":"Impartial or unbiased. \"As mediator, she remained neutral and helped both sides.\"","nineteen":"The number 19. \"Her daughter turned nineteen last weekend.\"","ninety":"The number 90. \"The test scores ranged from zero to ninety.\"","normal":"Usual or ordinary. \"For breakfast she ate a normal bowl of cereal.\"","nugget":"A small lump of something valuable like gold. \"The miner discovered a gold nugget.\"","numerical":"Relating to numbers or counting. \"Put the answers in numerical order.\"","obscure":"Not well known, vague. \"The obscure reference was unclear to me.\"","obtuse":"Lacking in insight or discernment. \"It was obtuse to overlook the obvious solution.\"","occasion":"A special event or activity. \"Graduation was a joyous occasion.\"","official":"Authorized by position or authority. \"The official report came from the government agency.\"","omnivore":"An animal that eats both plants and animals. \"Humans are omnivores.\"","onion":"A vegetable with many layers and a strong scent. \"Chopped onions made his eyes water when he cut them.\"","opinion":"A view, judgment or valued belief. \"In my opinion, this is the best approach.\"","orange":"A citrus fruit or its color. \"Orange is a mix of red and yellow.\"","order":"A command or sequence. \"The soldiers followed the captain's orders.\"","organism":"A living thing such as an animal, plant, or fungus. \"The organism evolved over many generations.\"","origin":"The source, start or beginning of something. \"Research the origin of your family name.\"","ornament":"Something used for decoration. \"We hung colorful glass ornaments on our Christmas tree.\"","orphan":"A child whose parents have died. \"The compassionate couple adopted an orphan.\"","ounce":"A unit of weight equal to about 28 grams. \"The package weighed 13 ounces.\"","outside":"The external side or surface of something. \"It was cold and windy outside.\"","oval":"Elliptical or egg-shaped. \"Draw an oval shape.\"","owner":"A person who owns something. \"The pet store helps connect lost pets with their owners.\"","oxen":"Plural of ox, meaning cattle or buffalo. \"In pioneer days, oxen were used to pull heavy wagons.\"","package":"Something wrapped or boxed for carrying. \"The package will be delivered tomorrow.\"","pantry":"A room or closet for storing food. \"The canned goods were kept in the pantry.\"","parallel":"Side by side and equally spaced. \"The railroad tracks ran parallel to the highway.\"","parentheses":"( ) Round brackets used in pairs in writing. \"Put parentheses around any unnecessary words.\"","parsley":"A herb used to flavor cooking. \"He chopped parsley to sprinkle on the potatoes.\"","partial":"Incomplete or favoring one side. \"She had only a partial view of the stage.\"","participate":"To take part in something. \"Everyone is encouraged to participate in the talent show.\"","partridge":"A small game bird with a plump body. \"They saw a covey of partridge take flight in the field.\"","passage":"A section of writing or a corridor. \"The passage was so moving it brought tears to her eyes.\"","pastel":"A pale, soft toned chalk used for drawing. \"She used pastels to capture the sunset colors.\"","pasture":"Grassland for grazing livestock. \"The sheep grazed peacefully in the rolling pastures.\"","pattern":"A repeated design or recurring sequence. \"The wallpaper had a floral pattern.\"","peanut":"A legume that grows underground, eaten as a snack. \"Peanut butter and jelly is a classic sandwich.\"","penguin":"An aquatic, flightless bird found in the Southern Hemisphere. \"The penguin waddled on the icy ground.\"","percent":"Out of 100, a fraction like 25%. \"Only a small percent of applicants are admitted.\"","perch":"A place where a bird rests, or a high place. \"The owl nested on a high tree perch.\"","percussion":"Musical instruments played by striking or shaking. \"Drums are percussion instruments that you hit.\"","perhaps":"Possibly. \"Perhaps I'll apply for that job after all.\"","perish":"Suffer death or ruin. \"Without water, crops will perish.\"","permanent":"Lasting forever, not temporary. \"The permanent collection is always on display at the museum.\"","perpendicular":"At right angles to another line. \"The two sides meet at a perpendicular angle.\"","phrase":"A small group of related words. \"The phrase was beautifully written.\"","piece":"A part of a whole. \"Would you like a piece of cake?\"","pineapple":"A tropical fruit with a spiky skin and sweet flesh. \"Pineapple chunks taste good in fruit salad.\"","pint":"Half a quart or about 500 milliliters. \"The recipe called for a pint of cream.\"","pioneer":"An innovator, founder or early settler. \"The famous pioneers ventured west in covered wagons.\"","pitcher":"A container for pouring liquids. \"Please refill the water pitcher.\"","plateau":"A flat elevated landform. \"They drove across the wide plateau.\"","pleasure":"Joy or happiness. \"It was a pleasure to meet you.\"","pledge":"A solemn promise or guarantee. \"All members took a pledge to support the organization.\"","plenty":"More than enough. \"There's plenty of food, so take as much as you want.\"","plural":"More than one. \"The plural form of mouse is mice.\"","plus":"With the addition of, positive. \"Two plus two equals four.\"","poet":"Someone who writes poetry. \"The poet recited a few of his nature-inspired poems.\"","poison":"A harmful substance that can cause injury or death. \"The dangerous plant secretion was a poison.\"","polite":"Having good manners, courteous. \"He was very polite and held the door for us.\"","pollution":"Contamination of air, soil or water by harmful substances. \"Pollution in the lake killed the fish.\"","population":"All the inhabitants of a place. \"The city population grew rapidly.\"","porch":"A covered platform attached to a building. \"The porch swing invited us to sit outside and enjoy the evening.\"","porridge":"Oatmeal or cereal boiled in milk or water. \"The porridge was topped with sliced fruit.\"","portal":"A doorway, gate, or entrance. \"The portal to the fortress was flanked by columns.\"","positive":"Certain, without doubt. \"I'm positive I turned the oven off.\"","postal":"Relating to the mail delivery system. \"She took the postal service exam, hoping to become a mail carrier.\"","prairie":"An extensive area of flat grassland. \"The wild prairie stretched to the horizon.\"","preacher":"A member of the clergy who gives sermons. \"The preacher delivered a passionate sermon.\"","predator":"An animal that hunts other animals for food. \"Lions are predators that hunt zebra and antelope.\"","present":"Existing now, current. \"The present time is a gift, that's why they call it the present.\"","presentation":"A speech or demonstration about a topic. \"She prepared a presentation about recycling.\"","president":"The leader of a country, organization, group. \"The president lived in the White House.\"","pressure":"The force exerted by something. \"The gas was under high pressure.\"","prevention":"Keeping something from happening. \"Prevention is the best medicine.\"","prey":"An animal hunted by a predator for food. \"The coyote chased the prey through the grassland.\"","prime":"Best or most rewarding time. \"In the prime of her career, she achieved great success.\"","prince":"The son of a monarch. \"The prince married a beautiful princess.\"","principal":"Most important or head administrator of a school. \"The principal made morning announcements.\"","principle":"A fundamental truth that guides behavior. \"He refused to compromise his principles.\"","private":"Confidential, not public. \"Private documents should be shredded before disposal.\"","probably":"Likely to be true but not certain. \"She probably won't be late.\"","produce":"To make or grow food. \"Local farmers produce cheese and wine.\"","profession":"An occupation requiring special training. \"She chose social work as her profession.\"","program":"Code that runs on a computer or a plan. \"I wrote a simple program.\"","promotion":"An advancement in position or opportunity. \"He earned a promotion to district manager.\"","proposal":"A plan presented for consideration. \"Her proposal was accepted by the committee.\"","protection":"Keeping someone or something safe. \"Seat belts offer vehicle crash protection.\"","protractor":"A device for measuring angles. \"Use a protractor when drawing the triangle.\"","proverb":"A short, wise saying. \"That old proverb contains good advice.\"","public":"Communal, for the people. \"The public library loaned books free of charge.\"","publish":"To print and distribute writing. \"Her articles were published in magazines.\"","pueblo":"Homes constructed of adobe or clay. \"The ancient pueblo was built into the rock cliffs.\"","pumpkin":"Large, round fruit with an edible inside. \"Carving pumpkins is part of Halloween tradition.\"","puncture":"A hole made by piercing something. \"He got a puncture in his bicycle tire.\"","pupil":"A student or the center of the eye. \"The pupil raised her hand when she knew the answer.\"","puppet":"A figure animated by hand or strings. \"The puppet show entertained the children.\"","purchase":"To buy or acquire something. \"We made a big purchase of new office furniture.\"","purple":"A color between red and blue. \"Purple is made by combining red and blue light.\"","purpose":"A goal or intention. \"The experiment's purpose was to gather data.\"","puzzle":"A challenging problem or jigsaw game. \"She loved doing crossword puzzles.\"","quantity":"An amount or volume. \"Buy a large quantity to get the discount.\"","queen":"Female ruler of a country or territory. \"The queen wore a golden crown studded with jewels.\"","quite":"Rather, somewhat. \"It's quite cold today - bring your jacket.\"","quiz":"Short test of knowledge. \"We took a geography quiz.\"","rabbit":"A small mammal with long ears. \"The rabbit hopped quickly through the grass.\"","raccoon":"A masked nocturnal mammal. \"A raccoon got into our garbage last night.\"","railroad":"Tracks for trains. \"We stopped at a railroad crossing for a train to pass.\"","rainforest":"A lush, tropical forest with high rainfall. \"The rainforest had incredible biodiversity.\"","rancher":"Someone who raises livestock like cattle. \"The veteran rancher managed a large herd.\"","range":"The area of variation between limits. \"This oven's temperature range is 150-500 degrees F.\"","rather":"Somewhat, to a certain extent. \"I would rather stay home than go out.\"","ration":"A limited amount allocated to each person. \"Water was rationed during the drought.\"","ray":"A beam of sunlight or radiation. \"The sun's rays felt warm on our faces.\"","reaction":"An instinctive response. \"His quick reaction caught the vase before it hit the floor.\"","ready":"Prepared and available for use. \"Dinner's ready, so please wash up.\"","really":"Truly, genuinely. \"Do you really think so?\"","reason":"A cause or explanation. \"The reason we're late is traffic was terrible.\"","receive":"To get or be given something. \"I was happy to receive her letter in the mail.\"","recycle":"Convert waste into reusable material. \"Remember to recycle your empty bottles.\"","reflection":"Serious thought or mirror image. \"After some reflection, I think you're right.\"","region":"An area with common features. \"The region was known for its fertile farmland.\"","reject":"Refuse to accept or use. \"The builder rejected substandard materials.\"","relax":"Rest and relieve tension. \"Try to relax - everything will be fine!\"","release":"To free or let go. \"The doves were released at the ceremony.\"","relief":"Easing of pain or distress. \"It was a relief when the storm passed.\"","remember":"Retain memories or keep in mind. \"I'll try to remember to call you tonight.\"","remote":"Distant, far away. \"The cabin was in a remote valley.\"","remove":"Take away or eliminate. \"Please remove your shoes before entering.\"","reply":"Respond to a question or message. \"I'll reply to your email as soon as I can.\"","represent":"To serve as an example. \"This painting represents the artist's style.\"","reproduce":"Make a copy or image of something. \"The magazine reproduced her photograph without permission.\"","reptile":"Cold-blooded vertebrates like snakes, lizards, turtles. \"The reptile sunned itself on a warm rock.\"","request":"Politely ask for something. \"I request a vegetarian meal, please.\"","resist":"Refuse to accept, withstand. \"We must resist injustice wherever it occurs.\"","responsibility":"A duty or obligation. \"Taking out the trash was his responsibility.\"","result":"An outcome or consequence. \"Flat tires can result from low tire pressure.\"","retain":"Keep possession of something. \"I will retain these records for at least a year.\"","return":"Go back, give back, or respond. \"Please return unused items for a full refund.\"","revise":"Modify and improve something. \"She revised her essay to make it better.\"","revision":"Updated or edited version. \"This is the third revision of the proposal.\"","rhombus":"A four-sided figure with equal sides and angles. \"They identified the rhombus among the other shapes.\"","ribbon":"A long, narrow strip of fabric. \"She tied a ribbon around the gift box.\"","richer":"More nutritious, abundant or wealthy. \"The cake batter was richer with extra eggs and butter.\"","ridge":"An elevated crease or fold. \"They hiked along the mountain ridge.\"","robin":"A reddish-breasted migratory songbird. \"The early spring robin was gathering nesting material.\"","robot":"A machine capable of automatic or remote-controlled movement and tasks. \"The robot was programmed to vacuum the floor.\"","rodeo":"A sporting event featuring bronco riding, bull riding and roping contests. \"Every summer they held the rodeo and fair.\"","rolled":"Formed into a cylindrical shape. \"Grandma rolled out the dough before cutting the cookies.\"","rotation":"Circular movement around a center point. \"The rotation of the tires enabled motion.\"","rupture":"A break or split. \"The earthquake caused a rupture in the ground.\"","saddle":"A seat for a rider on an animal or bike. \"She secured the saddle tightly before riding.\"","satin":"A smooth, glossy fabric. \"The satin gown shimmered brightly.\"","scale":"Graduated markings indicating weight or measurement. \"He weighed himself on the bathroom scale.\"","scan":"Examine carefully or electronically. \"Please scan these documents into the computer.\"","scarf":"A strip of cloth worn around the neck. \"Her colorful scarf complemented her outfit.\"","scarlet":"A vivid red color. \"The scarlet macaw had brilliantly colored feathers.\"","scientist":"Someone learned in science and who performs research. \"The scientist gave a lecture about her latest discovery.\"","score":"Points gained in a game or test. \"Our basketball team earned a high score.\"","scorpion":"An arachnid with large pincers and a venomous sting. \"The scorpion crawled along the desert sand.\"","sculpture":"A three-dimensional work of art. \"The bronze sculpture depicted a hero of ancient myth.\"","section":"A segment or portion. \"This section of the book covered the Civil War.\"","sediment":"Material like sand or soil particles that settle at the bottom of a liquid. \"Sediment accumulated in the harbor over time.\"","seizure":"A sudden attack or taking of something. \"The seizure left him temporarily paralyzed.\"","sentence":"A grammatical unit of words. \"A declarative sentence makes a statement.\"","sequence":"A succession of things in order. \"List the events in chronological sequence.\"","series":"A number of related things in order. \"He read the entire series of fantasy novels.\"","sermon":"A talk on a religious or moral theme. \"The pastor delivered a thought-provoking sermon.\"","seventeen":"The number 17. \"There were seventeen candles on the cake.\"","seventy":"The number 70. \"It was a record-breaking seventy degrees in December.\"","several":"More than two but not many. \"He made several mistakes on the test.\"","sheriff":"The law officer of a county. \"The sheriff and her deputies patrolled the streets.\"","shoreline":"The edge of land along a sea, lake or river. \"During high tide the shoreline was flooded.\"","shorten":"Make shorter in length or duration. \"We can shorten the meeting to 30 minutes.\"","shown":"Displayed, revealed or explained. \"As shown on the map, our destination is just ahead.\"","signature":"Your written name. \"Please sign your signature on the line.\"","simile":"A comparison using 'like' or 'as'. \"Her eyes shone like stars.\"","since":"From a specific time in the past until now. \"I've been waiting since two o'clock for the bus to arrive.\"","sincere":"Genuine and earnest. \"I appreciate your sincere words - thank you!\"","site":"A location or place. \"The campsite was near the lake.\"","sixteen":"The number 16. \"There are sixteen ounces in one pound.\"","sixty":"The number 60. \"A minute has sixty seconds.\"","sketch":"A quick, rough drawing. \"She sketched the scene with pencil.\"","skill":"An ability developed through training. \"Drawing takes artistic skill.\"","slide":"To move smoothly over a surface. \"The children slid down the playground slide.\"","slowly":"Not quickly, at a low speed. \"She drove slowly on the winding mountain road.\"","snuggle":"Cuddle or nestle closely. \"The kittens snuggled together for warmth.\"","soccer":"A game played with a round ball by two teams trying to kick goals. \"We played soccer every Saturday morning.\"","solo":"Alone, by oneself. \"For his guitar solo he was the only one playing.\"","solve":"Find an answer or explanation. \"It took perseverance to solve the puzzle.\"","special":"Exceptional or unusual. \"This necklace is very special to me.\"","speed":"The rate something moves at. \"The car gained speed going down the hill.\"","spelling":"Forming words letter by letter correctly. \"Her good spelling helped on the quiz.\"","spinach":"A healthy green leafy vegetable. \"Spinach salad is rich in nutrition.\"","split":"Separate into parts or divide. \"Let's split up and search both sides of the building.\"","sprinkle":"Scatter lightly or spray fine drops. \"Sprinkle some salt and pepper on the food.\"","squash":"To crush or press with force. \"Be careful not to squash the bread in your lunchbox.\"","squirt":"Spray out liquid in a sudden stream. \"She squirted lemon on her fish dinner.\"","staircase":"A set of stairs with railings and landings. \"They climbed the spiral staircase to reach the top.\"","stampede":"A sudden panicked rush. \"The cattle stampede thundered across the plains.\"","stencil":"A thin sheet with a pattern or letters cut out. \"She used a stencil and paint to decorate the wall.\"","stern":"Strict, severe or grim. \"The captain had a stern demeanor.\"","stock":"Supply or inventory of goods. \"We need to restock these popular items.\"","stolen":"Taken illegally. \"The stolen car was found abandoned.\"","storage":"Keeping items in a safe place. \"Photo storage helps protect old pictures.\"","storm":"Severe weather with strong winds. \"The storm brought pouring rain and howling wind.\"","strawberry":"A sweet red fruit with seeds on the outside. \"Strawberry ice cream is pink.\"","stretcher":"A portable frame for carrying the injured. \"They brought the sick man in on a stretcher.\"","strike":"Hit forcefully, refuse to work, or discover gold. \"Lightning can strike suddenly during a storm.\"","stroller":"A chair on wheels for a small child. \"The baby took a nap in her stroller.\"","structure":"Something built or constructed. \"The Eiffel Tower is an iconic structure.\"","subject":"A topic or branch of knowledge to study. \"Science is my favorite school subject.\"","suggestion":"An idea or proposal offered. \"Do you have any suggestions for improvement?\"","surely":"Definitely or certainly. \"Surely you can stay a little longer!\"","surface":"The outer part or uppermost layer. \"The rocket burst through the water's surface.\"","surgeon":"A doctor who performs operations. \"The skilled surgeon saved many lives during the war.\"","sweet":"Having a pleasant, sugary taste. \"Bananas are sweet and tasty.\"","swings":"Hanging seats that swing back and forth. \"The playground had swings and a slide.\"","sword":"A bladed weapon with a long handle. \"The knight carried a mighty sword.\"","symmetry":"Balanced proportions. \"The butterfly's wings had perfect symmetry.\"","synonym":"A word with the same meaning as another. \"Happy is a synonym of joyful.\"","system":"A set of connected things working together. \"The solar system includes the Sun, planets and moons.\"","tardy":"Late, not on time. \"I was tardy to school because I missed my bus.\"","tariff":"A tax on imported or exported goods. \"The tariff made foreign goods more expensive.\"","technology":"Machinery and electronics developed from scientific knowledge. \"Technology continues to advance rapidly.\"","temporary":"Lasting only a limited time. \"This parking permit is temporary - it expires next week.\"","tenths":"Each of ten equal parts. \"The ruler was marked in tenths of inches.\"","theater":"A building for dramatic performances or movies. \"Have you seen any good shows at the theater lately?\"","themselves":"The reflexive form of 'they' or 'them.' \"The students made the props themselves.\"","thirteen":"The number 13. \"There are thirteen players on a basketball team.\"","thirty":"The number 30. \"One minute has thirty seconds.\"","thorn":"A sharp pointed spine or prickle. \"The thorn bush snagged my sweater as I walked by.\"","thousand":"The number 1000. \"One thousand pennies make ten dollars.\"","ticket":"A voucher granting admission or travel. \"Keep your ticket to get back into the museum later.\"","tinsel":"Thin, glittering metallic strips. \"Tinsel sparkled on the Christmas tree.\"","toaster":"An appliance that toasts bread. \"I made toast using the toaster.\"","today":"This present day. \"Today is Monday.\"","tomorrow":"The day following today. \"I have a dentist appointment tomorrow.\"","tonsil":"A mass of lymphoid tissue in the throat. \"My swollen tonsils made my throat sore.\"","totally":"Completely, fully. \"I totally agree with you.\"","toward":"In the direction of something. \"She walked toward the door.\"","towel":"A cloth used for drying or bathing. \"After swimming, dry off with a towel.\"","tragedy":"A disastrous event causing great sadness. \"The tragedy shocked the whole community.\"","train":"Connected railcars or coaches. \"We traveled across the country by train.\"","tranquil":"Peacefully calm and quiet. \"The tranquil lake reflected the sunset colors.\"","translation":"Converting from one language to another. \"She provided a Spanish translation of the letter.\"","transmit":"Send from one place to another. \"The radio station transmitted the concert live.\"","transportation":"Means of carrying or moving people and goods. \"Buses provide public transportation.\"","treasure":"Valuable or precious things. \"The pirates buried the treasure on the island.\"","tremor":"An involuntary quiver or shake. \"The earth tremor knocked plates off the shelf.\"","trio":"A group of three people or things. \"The piano trio played a Mozart composition.\"","tropical":"Relating to the Tropics, the region near Earth's equator. \"The tropical island was warm all year.\"","tunnel":"A passageway going under or through something. \"The tunnel connected the two buildings.\"","twelve":"The number 12. \"There are twelve months in one year.\"","twenty":"The number 20. \"She celebrated her twentieth birthday yesterday.\"","type":"A kind, sort or classification. \"What type of art do you enjoy - painting, music, drama?\"","ultrasound":"High-frequency sound waves used for imaging. \"The ultrasound let doctors view the baby before birth.\"","umbrella":"A device providing shade or protection from rain. \"Take an umbrella in case it starts raining.\"","understand":"Comprehend or grasp an idea. \"I understand the homework now, thanks.\"","unemployment":"Lack of jobs for those seeking work. \"The epidemic caused widespread unemployment.\"","unite":"Join together. \"The colonies united to form a new nation.\"","university":"An institution for higher education. \"She will start university in the fall semester.\"","usher":"An attendant who seats people at an event. \"The usher led us to our orchestra seats.\"","usually":"Normally, typically. \"I usually have cereal for breakfast.\"","utensil":"An implement or tool used for eating. \"Spoons, knives, and forks are common utensils.\"","vertex":"The highest point, the apex or summit. \"The monument marked the vertex where two trails intersected.\"","veteran":"Someone long experienced in an occupation. \"The veteran police officer trained the rookie.\"","video":"Recorded images shown on a screen. \"We watched a funny cat video online.\"","view":"Sight or visible scene. \"The view from the mountain was breathtaking.\"","villain":"A wicked, evil person. \"In the story, the villain was foiled by the brave heroine.\"","violin":"A stringed musical instrument played with a bow. \"She began playing the violin at age five.\"","vocal":"Relating to the human voice. \"Her vocal range allowed her to sing both low and high notes.\"","voucher":"A document representing a credit or discount. \"This voucher is redeemable for one free coffee.\"","vowel":"A, E, I, O or U - letters representing speech sounds. \"The word has three vowels: ea-gle.\"","vulture":"A large bird that feeds on dead animals. \"Vultures circled in the sky above the desert.\"","wagon":"A vehicle with four wheels pulled by an animal or tractor. \"The pioneers traveled west in covered wagons.\"","wedge":"A piece tapering to a thin edge. \"The wedge split the log in half.\"","whine":"Complain in an annoying way. \"The puppy whined and scratched at the door.\"","whom":"Objective case of 'who' when used as the object. \"Whom should I contact about this issue?\"","wigwam":"A small, rounded hut used by some Native Americans. \"The wigwam was made of tree saplings covered with animal skins or birch bark.\"","window":"An opening in a wall with glass panes. \"The window let in sunlight.\"","within":"Inside or not beyond. \"She will call you back within an hour.\"","wolves":"Wild canines that hunt in packs. \"The wolves howled at the full moon.\"","wonderful":"Extremely good. \"You baked a wonderful cake - thank you!\"","woodland":"Land that is covered with trees and bushes. \"Deer live in the dense woodland.\"","wrench":"A hand tool used for gripping and turning nuts and bolts. \"Use the wrench to loosen that bolt.\"","written":"Set down in writing. \"Please get your agreement in written form.\"","yesterday":"The day before today. \"Yesterday it was raining, but today is sunny.\"","yourself":"Reflexive form of 'you' when the subject. \"You should be yourself, not try to imitate others.\"","youth":"The time of being young. \"Volunteering helps youth become active citizens.\""},{"abacus":"An instrument used for counting and calculating that consists of a frame holding rods with beads that move along the rods. \"She used an abacus to add up the cost of the items.\"","absent":"Not present, missing. \"John was absent from school yesterday because he was sick.\"","accompany":"To go somewhere with someone. \"My brother accompanied me to the movies.\"","according":"In agreement with, consistent with. \"According to the weather report, it will be sunny today.\"","active":"Engaged in action, lively. \"The kids were active and played tag at recess.\"","adaptation":"A change made to become suitable for a new use or purpose. \"The bird's hollow bones are an adaptation for flying.\"","addict":"One who is dependent on something habit forming. \"The addict went to rehab to end his drug addiction.\"","adhere":"To stick fast or cleave to something. \"The stamp adhered firmly to the envelope.\"","adhesive":"A sticky substance used to join objects together. \"I used adhesive tape to seal the package.\"","adjacent":"Next to, adjoining, neighboring. \"Our house is adjacent to the park.\"","adjective":"A word naming an attribute of a noun. \"Big, slow, yellow, and loud are adjectives.\"","adjourn":"To close or suspend a meeting or session. \"The judge adjourned the hearing until the next day.\"","adjustment":"A modification to make something fit or work better. \"I made adjustments to the recipe to make it less spicy.\"","admission":"The act of permitting to enter, or the fee paid to enter. \"Admission to the museum is free on Thursdays.\"","admitted":"Allowed to enter, confessed, acknowledged. \"He admitted taking the last cookie.\"","adverb":"A word used to modify a verb, adjective, or other adverb. \"She sang loudly and beautifully at the concert.\"","advertisement":"A paid public notice promoting a product or service. \"I saw an advertisement for a new car on TV.\"","advocate":"To publicly support or argue for something. \"Martin Luther King Jr. advocated for civil rights.\"","aerobics":"Exercise done to music that increases heart and breathing rates. \"Jenny does aerobics for 30 minutes to stay fit.\"","aerodynamic":"Designed to reduce drag and airflow resistance. \"The car has an aerodynamic shape to improve gas mileage.\"","aeronautics":"The science or practice of building and flying aircraft. \"Aeronautics helped advance the space program.\"","aerosol":"Fine spray or mist. \"The air freshener released an aerosol when sprayed.\"","aerospace":"Relating to both aviation and spaceflight. \"Aerospace projects can be very complex and costly.\"","afraid":"Feeling fear. \"The little girl was afraid of the dark.\"","Africa":"The second largest continent on Earth located south of Europe and surrounded by major bodies of water. \"Africa is home to diverse cultures, landscapes, and wildlife.\"","afterwards":"At a later or succeeding time. \"We had cake afterwards to celebrate.\"","agility":"Ability to move quickly and easily. \"The gymnast demonstrated exceptional agility.\"","agreement":"A negotiated and mutually accepted arrangement between parties. \"They reached an agreement to end the dispute.\"","ahead":"In front, in advance. \"There are challenges ahead we must prepare for.\"","allow":"Permit, give consent. \"My mom said I can allow a friend to come over.\"","allowable":"Permitted or permissible within limits or rules. \"The allowable limit is one checked bag per passenger.\"","alternate":"Every second one in a series, taking turns. \"Alternate walking and running intervals when exercising.\"","alto":"Low female singing voice range. \"She sang alto in the choir.\"","alumni":"Graduates of an educational institution. \"The alumni donors funded a new library.\"","alumnus":"A male graduate of a school, college, or university. \"He was a proud alumnus of the university.\"","ambidextrous":"Able to use both hands equally well. \"The ambidextrous pitcher could throw well with either arm.\"","ambient":"Relating to the surrounding environment. \"The restaurant had ambient lighting to create a relaxed mood.\"","ambiguity":"Lack of clarity leaving something open to more than one interpretation. \"The ambiguity of the directions caused confusion.\"","ambition":"A strong desire to achieve something. \"Her ambition is to be a doctor someday.\"","ambivalent":"Simultaneously having conflicting reactions or feelings about something. \"He felt ambivalent about his job offer and couldn't decide what to do.\"","ambulance":"Emergency vehicle used to transport ill or injured people. \"The ambulance rushed the patient to the hospital.\"","ancestor":"A person from whom one is descended. \"Some ancestors used horse-drawn carriages as transportation.\"","ancient":"Belonging to the distant past, very old. \"The ancient ruins date back thousands of years.\"","animation":"The act of making inanimate things appear to move. \"They used claymation to create the animation.\"","anniversary":"The yearly return of the date of a past event. \"We celebrate our wedding anniversary in June.\"","annual":"Happening or returning yearly. \"The fair is an annual event here.\"","Antarctica":"Continent surrounding the South Pole and mostly covered in thick ice. \"Penguins inhabit the icy lands of Antarctica.\"","antelope":"An African or Asian ruminant mammal similar to and related to deer. \"The pronghorn is an antelope found in western North America.\"","antenna":"A slender, rod-like sensory appendage on the head of insects, crustaceans, and some other arthropods. \"The beetle's left antenna was torn off in the fight\"","antennae":"The plural form of antenna. \"Some insects have two antennae on their head that serve as sensory organs.\"","anthropology":"The study of human beings, their societies and cultures. \"Anthropology seeks to understand how humans change over time.\"","antibiotic":"Medicine that inhibits the growth of or destroys microorganisms. \"The antibiotic cured my bacterial infection.\"","antibody":"Protein produced by the body to combat disease. \"Once exposed to a virus, your body produces antibodies to fight it.\"","antidote":"Medicine used to counteract poison. \"The antidote will counteract the venom from the snakebite.\"","antifreeze":"Substance added to liquids to lower freezing point. \"Add antifreeze to your car's radiator in winter.\"","antiseptic":"Substance that prevents infection by killing germs. \"Use an antiseptic to clean and disinfect wounds.\"","antisocial":"Avoiding the company of others, unfriendly. \"His antisocial behavior alienated his classmates.\"","apology":"Expression of regret for something done wrong. \"She offered a sincere apology for being late.\"","apostrophe":"Mark used to indicate possession or omission. \"The student's' lockers were over there. Rock 'n roll.\"","apparently":"As far as one knows or can see. \"Apparently it's going to rain today.\"","appearing":"Coming into view, becoming visible. \"The first stars were appearing in the night sky.\"","applicant":"One who applies or requests something. \"The job applicant submitted her resume.\"","application":"A formal request or document applying for something. \"Submit your college application by January 5th.\"","appreciate":"Be thankful for and value something. \"I really appreciate you helping me with this.\"","apprentice":"One who works for an expert to learn a trade or craft. \"She was apprenticed to a master carpenter.\"","approach":"Come near or nearer to someone or something. \"Let's approach the deer slowly and quietly.\"","approximate":"Close to the actual but not completely accurate. \"The approximate time is between 3 and 4 o'clock.\"","April":"The fourth month of the year. \"April often brings rainy spring weather.\"","archaeology":"The study of cultures through analyzing recovered artifacts and ruins. \"The team made an exciting new archaeological discovery.\"","archery":"Skill of shooting with bow and arrow. \"Archery requires good focus and precision.\"","arrive":"Reach a destination or finish a journey. \"We arrived at the airport an hour before our flight.\"","article":"A piece of writing about a particular topic. \"The article was about how to recycle.\"","articulate":"Speak or express thoughts clearly. \"She was articulate and made her points eloquently.\"","ashamed":"Embarrassed or guilty. \"I was ashamed for judging someone unfairly.\"","assistant":"One who provides help or support. \"The magician's assistant participated in the show.\"","associate":"Connect or partner with something. \"I always associate hot dogs with baseball games.\"","astrology":"Studying how stars and planets influence human affairs and behavior. \"She enjoys reading the astrology forecasts for entertainment.\"","astronaut":"Person trained to travel into space. \"Neil Armstrong was the first astronaut to walk on the moon.\"","astronomical":"Enormous, regarding astronomy. \"The astronomical costs make space travel only possible for governments.\"","astrophysics":"Physics relating to celestial objects and space. \"Astrophysics explores things like supernovae and black holes.\"","atmosphere":"The envelope of gases surrounding a planet. \"The Earth's atmosphere is made up mostly of nitrogen and oxygen.\"","attribute":"A quality or characteristic of something. \"Wisdom is an attribute I admire in others.\"","auction":"Public sale where items are sold to the highest bidder. \"Antiques and artwork are often sold at auction.\"","audible":"Able to be heard. \"A dog's audible barking warns away intruders.\"","audio":"Relating to sound, especially recordings. \"The audio was very clear during the lecture.\"","audit":"Official examination of finances or performance. \"The IRS will audit tax returns with questionable deductions.\"","audition":"Try out for a position or role. \"I have an audition for the school musical today.\"","auditor":"Person who conducts an audit or auditory examination. \"The auditor thoroughly inspected the company's spending.\"","auditorium":"Large room or hall for public gatherings. \"The auditorium seats 500 people.\"","auditory":"Of or relating to the sense of hearing. \"Dogs have excellent auditory perception of high frequency sounds.\"","August":"The eighth month of the year. \"It's very hot and humid here in August.\"","authenticity":"Genuine originality. \"The authenticity of the artifact was verified by experts.\"","autobiography":"Account of someone's life written by that person. \"He wrote his autobiography after retiring.\"","autograph":"Person's signature, especially that of a celebrity. \"She asked the singer for an autograph after the concert.\"","autumn":"The season between summer and winter. \"Autumn is the time when tree leaves change color.\"","avenue":"Wide city street or thoroughfare. \"Fifth Avenue has lots of upscale shops.\"","aware":"Having knowledge or understanding of something. \"I wasn't aware that the store was closed today.\"","awkward":"Clumsy or ungraceful. \"The awkward silence made everyone uncomfortable.\"","axiom":"A universally accepted principle or rule. \"He based the logic of his theory on a few simple axioms.\"","bacteria":"Tiny, one-celled organisms, some of which cause disease. \"Antibiotics kill bacteria that cause infection.\"","baritone":"Male singing voice between tenor and bass. \"In the choir, John sang baritone.\"","bass":"Lowest male vocal range or instrument. \"The bass guitar player plucked the deep, low notes.\"","beetle":"An insect with hard protective wings. \"The Japanese beetle is a common pest for gardens.\"","beginning":"The start of an event or story. \"This is just the beginning of an epic adventure!\"","beige":"Light brownish-grey color. \"Sand has a beige color.\"","benefiting":"Receiving aid, assistance, or an advantage. \"Proper nutrition benefits the immune system.\"","bicycle":"Two-wheeled vehicle powered by pedaling. \"My bicycle has fat tires so I can ride off-road trails.\"","biography":"Account of a person's life written by someone else. \"The biography documented the famous musician's life.\"","biology":"The science of living organisms. \"In biology we learned about cells and DNA.\"","blizzard":"Severe snowstorm with high winds and poor visibility. \"The blizzard dumped two feet of snow and we couldn't leave the house for days.\"","bottom":"Lowest or under part of something. \"The seeker looked at the bottom of the canyon for the lost hiker.\"","brace":"Something that holds parts together or in place. \"The brace supported his injured left knee.\"","branches":"Parts extending from a main woody stem of a tree. \"The wind made the branches sway back and forth.\"","Brazil":"The largest country in South America. \"Brazil's capital is Brasilia and its largest city is Sao Paulo.\"","breakable":"Capable of being broken. \"Be careful, those dishes are breakable!\"","breakfast":"First meal of the day, usually eaten in the morning. \"Eggs, toast, and fruit make a healthy breakfast.\"","breathe":"Inhale and exhale air. \"I had trouble breathing during my bout of influenza.\"","brilliant":"Exceptionally talented or intelligent. \"The brilliant mathematician solved the problem quickly.\"","bruise":"Injury or mark where the skin is unbroken but underlying tissue is damaged. \"I got some bad bruises after falling off my bike.\"","burglar":"One who illegally breaks into a building to steal things. \"The burglar wore a black mask and crept around quietly at night.\"","business":"Commercial enterprise or trade. \"The family business was a local restaurant.\"","cacti":"Plural of cactus, a plant adapted to arid climates. \"Cacti store water in their thick stems.\"","cactus":"Succulent plant with a thick, fleshy stem with spines instead of leaves. \"Cacti thrive in hot, dry desert climates.\"","cadence":"Rhythm or tempo, especially in music or poetry. \"Marching band music has a distinct strong, regular cadence.\"","calico":"Cloth or cat with patches of brown, black, orange and white. \"The calico fabric pattern was popular for quilts.\"","California":"A state on the west coast of the United States. \"Los Angeles and San Francisco are major cities in California.\"","calories":"Units measuring energy provided from food. \"The average adult needs about 2000 calories per day.\"","Canada":"Country occupying the northern part of North America. \"Canada has ten provinces and three territories.\"","canine":"Relating to or resembling dogs or wolves. \"The fox has an elongated canine snout.\"","canter":"A three-beat gait of a horse or other equine, faster than a trot but slower than a gallop. \"The horse broke into a canter as it rounded the bend.\"","capacity":"Maximum amount or volume something can contain. \"The stadium has a capacity to seat 70,000 people.\"","capital":"City or town that is the official seat of government. \"Ottawa is the capital city of Canada.\"","captain":"Leader or commanding officer of a ship or unit. \"The captain commanded the starship on its journey through the galaxy.\"","carbohydrates":"Sugars, starches, and cellulose that are main dietary energy sources. \"Bread, pasta, and potatoes contain lots of carbohydrates.\"","cartographer":"One who practices cartography, which is the science of making maps and charts. \"The cartographer carefully plotted all the streets and landmarks on the city map.\"","cartoon":"Simple drawing representing or caricaturing something. \"He drew funny cartoons for the school newspaper.\"","casual":"Informal, relaxed in manner or dress. \"Jeans provide a casual look.\"","category":"A division or class. \"The hurricane was upgraded to a Category 5.\"","cathedral":"Large, important church. \"The ornate cathedral had beautiful stained glass windows.\"","caught":"Past tense of catch; captured or seized. \"The firefighter caught the baby dropped from the burning building.\"","centennial":"100th anniversary or birthday. \"The city is celebrating its centennial this year.\"","certificate":"A document certifying completion of something. \"I earned a certificate for completing the first aid course.\"","chapter":"Main division of a book. \"His favorite chapter was about knights and chivalry.\"","chief":"One who is highest in rank or office. \"The chief of police oversees law enforcement for the city.\"","China":"Large country in eastern Asia with over 1 billion people. \"China has the world's largest population.\"","choreography":"Art of composing dance by arranging and combining movements. \"Creating choreography takes imagination and skill.\"","chromosome":"Strand of DNA that contains the genes. \"Chromosomes contain the genetic material that is passed on when cells divide.\"","chronology":"Arrangement of events in time sequence. \"The chronology listed the major events from the past year.\"","circumstantial":"Indirect or incidental, not conclusive. \"The circumstantial evidence was not enough to solve the crime.\"","cliff":"High, steep rock face or ridge. \"The hawk nested on the edge of the seaside cliff.\"","climb":"Ascend or scale something. \"We plan to climb to the mountain summit this weekend.\"","clinic":"Office for examining and treating patients. \"My doctor's clinic is right around the corner.\"","cloudiness":"State of being cloudy, obscured. \"The cloudiness made it hard to see the eclipse.\"","cluster":"Closely grouped. \"The cluster of grapes grew on the vine.\"","coast":"Land along or near a sea shore. \"We lived on the California coast.\"","collapse":"Fall down or cave in suddenly. \"The old shed finally collapsed after years of neglect.\"","collate":"Assemble in proper order. \"I will collate the pages before stapling the report.\"","colleague":"Co-worker or associate. \"Let me introduce you to my colleague, Jane.\"","collide":"Crash together with violent, direct impact. \"The two cars collided in the intersection.\"","collision":"Instance of colliding or crashing. \"The collision caused a traffic jam.\"","colonel":"An army officer ranking above lieutenant colonel. \"Colonel Mustard was a Clue game character.\"","colony":"Place settled by people from a governing country. \"The early American colonies were ruled by Great Britain.\"","Colorado":"A western state of the United States known for the Rocky Mountains. \"Colorado is nicknamed the Centennial State.\"","column":"Vertical pillar or stacked list. \"The temple had tall marble columns.\"","comet":"Small icy object orbiting the sun. \"Halley's Comet returns about every 76 years.\"","comic":"Book or strip telling a funny story through pictures. \"I enjoy reading the Sunday comics.\"","comma":"Punctuation marking a slight pause in text. \"Please put a comma between each item in the list.\"","commercial":"Paid advertisement promoting a business or product. \"Did you see that funny new commercial?\"","commission":"Fee for selling something or formal group directive. \"The real estate agent works on commission.\"","committee":"Group of people appointed to do a particular job. \"The fundraising committee met every Tuesday after school.\"","committing":"Doing or perpetrating something. \"He is committing fraud by lying on his tax return.\"","communication":"Exchange of information between people. \"Clear communication is critical to success.\"","compact":"Closely and neatly packed together. \"New York City is very compact.\"","companion":"Person sharing experiences with another. \"My best friend has been my companion on many adventures.\"","company":"Business organization selling goods or services. \"Many people worked for the railroad company.\"","comparison":"Examining similarities and differences. \"Let's do a comparison of these two phones' features.\"","compensate":"Make amends to someone for loss or damage. \"The airline compensated passengers for canceled flights.\"","competition":"Rivalry between those seeking the same thing. \"There is fierce competition between companies.\"","complaining":"Expressing dissatisfaction or annoyance. \"Constant complaining really gets on my nerves.\"","complaint":"Expression of dissatisfaction, protest. \"The customer wrote a formal complaint about the broken product.\"","completely":"Totally, entirely. \"I completely agree with your idea.\"","compliant":"Obeying rules or requests. \"A compliant employee follows instructions well.\"","composite":"Made up of various parts or elements. \"The composite material was strong and lightweight.\"","compound":"Made up of multiple parts. \"Water is a compound of hydrogen and oxygen.\"","comprehensible":"Understandable, able to grasp. \"His explanation was clear and comprehensible.\"","compulsory":"Mandatory, required. \"School is compulsory for kids under 16.\"","conceive":"Imagine, develop an idea. \"She conceived a brilliant plan to solve the problem.\"","concentration":"Focusing closely on something. \"Reading requires concentration.\"","concept":"Idea or abstract notion. \"Freedom is a concept central to democracy.\"","concession":"Something conceded or yielded. \"The union fought hard against any concession.\"","conditions":"Circumstances or factors. \"Dangerous driving conditions caused accidents.\"","conflict":"Clash or dispute between opposing forces. \"The Israeli-Palestinian conflict seems intractable.\"","conjunction":"Joining words or phrases in a sentence. \"The kids walked and talked on their way to school.\"","Connecticut":"A small state on the northeastern coast of the United States. \"Hartford is the capital of Connecticut.\"","connection":"Relationship or link between things. \"Investigators study connections between evidence and suspects.\"","conquest":"Act of conquering and taking control. \"European conquest shaped the Americas for centuries.\"","conscience":"Inner sense of morality and right conduct. \"Let your conscience guide you to make the right choice.\"","consequently":"As a result, therefore. \"He didn't study hard. Consequently, he failed the exam.\"","considerable":"Rather large in size, amount, or degree. \"A considerable amount of money was donated to charity.\"","consonant":"Speech sound that is not a vowel. \"B, D, F, and K are consonants.\"","constant":"Continuing without pause or change. \"The dog's constant barking was annoying.\"","container":"Receptacle that holds goods or material. \"Please put all your liquids in your carry-on container before going through airport security.\"","contestant":"One who competes in a contest or competition. \"Each contestant hopes to win the grand prize.\"","continue":"Persist in an activity without interruption. \"Let's continue this discussion after lunch.\"","controlled":"Restrained, managed, regulated. \"The experiment is done in a carefully controlled environment.\"","convention":"Formal meeting of members or representatives. \"The political party held its national convention.\"","convict":"Find or declare guilty of an offense. \"The infamous criminal was convicted on multiple counts.\"","coordinate":"Bring into common action or condition. \"Let's coordinate our class projects so we don't overlap.\"","corresponding":"Similar, equivalent, or accompanying. \"Check your work against the corresponding examples.\"","cougar":"Large wild cat species also known as puma or mountain lion. \"The cougar silently stalked its prey through the canyon.\"","coward":"One who lacks courage or bravery. \"No coward would risk his life to help others as he did.\"","create":"Cause something new to exist, originate. \"Edison helped create many useful inventions.\"","criminology":"Scientific study of crime and criminals. \"She studied criminology and psychology in college.\"","criticize":"Point out faults and flaws. \"It's easy to criticize others but harder to improve yourself.\"","cruel":"Causing pain or suffering. \"Child abuse is a very cruel act.\"","cyclone":"Violently rotating storm system. \"The cyclone turned into a huge hurricane.\"","daisy":"A small flower with white petals and a yellow center. \"She made a daisy chain necklace.\"","debatable":"Open to dispute or argument. \"It's debatable whether homework is helpful or harmful.\"","December":"The twelfth and last month of the year. \"December 21 is the winter solstice.\"","deception":"The act of deceiving or tricking someone. \"The Trojan horse was a deception used in war.\"","declaration":"A formal statement or announcement. \"The Declaration of Independence was an act of defiance.\"","dedication":"Commitment and devotion to a task or purpose. \"Years of dedication led to her success.\"","defendant":"The person defending or denying allegations in a lawsuit. \"The defendant pleaded not guilty to the charges.\"","Delaware":"A small state located on the eastern coast of the United States. \"Delaware was the first state to ratify the U.S. Constitution.\"","delegate":"A person appointed to act as representative for others. \"Each state sends delegates to the national convention.\"","delight":"Great pleasure, joy, or satisfaction. \"The children took delight in making snowmen.\"","delivery":"The act of taking goods to a destination. \"We waited all day for the package delivery.\"","dermatology":"The branch of medicine dealing with skin. \"The dermatologist treated my skin rash.\"","description":"An account in words of someone or something. \"His description of the movie left me wanting to see it.\"","design":"A drawing or outline used as a pattern. \"She made a design before sewing the dress.\"","desirable":"Worth having or wanting; appealing. \"It is desirable to eat a balanced, nutritious diet.\"","details":"Small, specific facts or features. \"Police investigated the details of the crime.\"","developing":"Coming into being or existence. \"Developing good habits takes time and effort.\"","difficult":"Hard to do or understand. \"Finding her house at night was difficult without street lights.\"","digestive":"Relating to digesting food. \"The digestive system breaks down food and absorbs nutrients.\"","dimensional":"Having physical space and measurements. \"Draw the box showing height, width, and depth - its three dimensions.\"","dioxide":"An oxide containing two oxygen atoms. \"Carbon dioxide is a gas emitted from combustion.\"","direct":"Straightforward; obvious. \"Her direct instructions were easy to follow.\"","disadvantage":"A negative condition or circumstance. \"Being short can be a disadvantage in basketball.\"","disappoint":"Fail to meet the hopes or expectations of someone. \"The weather report disappointed the hikers by predicting rain.\"","disapprove":"Consider someone or something wrong or unacceptable. \"Parents disapprove of bad behavior.\"","discard":"Get rid of something as no longer useful. \"Be sure to discard old batteries properly.\"","disengage":"Release from attachment; detach. \"The climber carefully disengaged from the safety rope.\"","dislike":"Lack of enjoyment; distaste. \"I dislike loud noises when I am trying to concentrate.\"","disposal":"Process of discarding or getting rid of something. \"Hazardous waste requires careful disposal.\"","dissatisfied":"Displeased; not content. \"The customer was dissatisfied with poor service.\"","dissolve":"Cause to pass into solution. \"Salt and sugar easily dissolve in water.\"","distinct":"Clearly different or distinguished. \"Each of the triplets had a distinct personality.\"","distinguishable":"Able to be perceived as different. \"Two distinct bird calls were distinguishable.\"","divisible":"Capable of being divided. \"All numbers are divisible by 1.\"","doctor":"Physician; practitioner of medicine. \"When you are sick, go see a doctor.\"","domination":"Power and control over others. \"World domination was his evil plan.\"","dozen":"Twelve items. \"A dozen eggs is the standard carton size.\"","duplex":"A house divided into two apartments. \"We rented an upper duplex.\"","duplicate":"Make an exact copy of something. \"Keep duplicates of all important paperwork.\"","eagle":"A large bird of prey with sharp talons and a curved beak. \"The eagle soared high above the mountains.\"","editing":"Preparing text by revising and correcting it. \"Editing the essay greatly improved its quality.\"","effect":"A result or consequence of an action or cause. \"The effects of climate change can be seen worldwide.\"","Egypt":"A country in northeast Africa home to one of the earliest great civilizations. \"The ancient pyramids were built in Egypt.\"","elasticity":"Ability of an object or material to return to its normal shape after being stretched or compressed. \"Rubber bands have high elasticity and can stretch a lot without breaking.\"","element":"Fundamental part of a whole. \"Oxygen and hydrogen are key elements that make water.\"","elf":"Mythical being, typically described as small, mischievous, and magical. \"The elf lived in the forest and made shoes for the fairy queen.\"","elves":"Plural of elf, a mythical being. \"Santa's magical elves help make toys.\"","encounter":"Unexpected meeting or confrontation. \"On the hike we had an unpleasant encounter with an angry bear.\"","engage":"Involve someone in an activity or discussion. \"We hope to engage the community in recycling programs.\"","England":"A country occupying most of the southern part of the island of Great Britain. \"London is the capital of England.\"","enjoy":"Take pleasure in an activity or experience. \"I enjoy reading fiction, especially fantasy novels.\"","entered":"Went into or joined something. \"The dog entered quickly when called.\"","entering":"Coming or walking into. \"No yelling when entering the library.\"","entire":"Whole, full, complete. \"I read the entire book in one sitting.\"","entrance":"Opening, doorway, or entry point. \"The theater entrance was around the corner.\"","environment":"Surroundings, including living and nonliving things. \"Protecting the environment is important.\"","equine":"Relating to or resembling a horse or horse family animals. \"An equine veterinarian cares for horses.\"","equinox":"The two days of the year when day and night are equal length. \"The spring equinox signals increasing daylight hours.\"","equipping":"Providing tools, clothing, or other equipment needed for an undertaking. \"Equipping the astronauts required much preparation.\"","escape":"Break free from confinement or control. \"The prisoners dug a tunnel to escape from jail.\"","esophagus":"Muscular tube connecting the mouth to the stomach. \"Swallowed food passes through the esophagus.\"","essential":"Fundamentally important or necessary. \"Regular exercise and healthy eating are essential to good health.\"","estimate":"Rough guess at a number value. \"Let's estimate about 50 people attended the event.\"","ethnicity":"Particular racial, national, or cultural group. \"The school celebrates the ethnic diversity of its students.\"","evaluating":"Carefully consider and judge the qualities of something. \"Before purchasing we should research and evaluate different product options.\"","evening":"Later part of the day from late afternoon until nighttime. \"We relaxed in the evening after a busy day sightseeing.\"","eventually":"In the end, after some time has passed. \"He eventually succeeded through perseverance.\"","exactly":"Precisely, completely accurately. \"Can you tell me exactly what you mean?\"","excellent":"Extremely good of the highest quality. \"The restaurant serves excellent food.\"","exchange":"Trade one thing for another. \"We decided to exchange gifts.\"","excitable":"Easily aroused to strong emotion. \"The crowd grew excitable as the concert neared.\"","exciting":"Causing great enthusiasm and eagerness. \"Space travel is exciting to think about.\"","exclamation":"Sudden outcry or emphatic expression. \"She shouted in exclamation when surprised by the cake.\"","exhausting":"Very tiring, draining of energy. \"Moving heavy furniture was exhausting work.\"","exiting":"Going out or away from something. \"When exiting a bus, wait for it to fully stop before standing.\"","exodus":"Mass departure of people. \"The exodus from the drought-stricken area was sad but necessary.\"","expect":"Regard something as likely to happen. \"I expect you to do your best on the test.\"","expelling":"Forcibly ejecting or banishing someone. \"The student was expelled for cheating.\"","expensive":"Costing a lot of money. \"That fancy sports car is very expensive!\"","experience":"Event personally lived through or encountered. \"Seeing the Grand Canyon was an amazing experience.\"","explaining":"Making an idea, situation, or process clear. \"The teacher was explaining how to solve the math problems.\"","explanation":"A statement making something clear or understandable. \"His explanation finally helped me understand physics.\"","exploration":"Act of traveling to unknown places to learn about them. \"Space exploration yields knowledge about the solar system.\"","exponent":"A number placed above and to the right of another number to indicate repeated multiplication. \"In the expression x^3, the exponent is 3.\"","external":"On the outside or outer surface. \"The external damage looked minor after the accident.\"","extravagant":"Going far beyond what is reasonable or necessary in action or expenditure. \"The lavish party seemed extravagant when people were struggling.\"","factor":"One of several elements contributing to a whole. \"Poor nutrition is one risk factor for heart disease.\"","famous":"Well-known and recognized by many people. \"Michael Jackson was a famous pop singer.\"","fantastic":"Extraordinarily good or attractive. \"The movie's special effects were fantastic.\"","fashion":"Popular style during a time period. \"Bell bottoms were an iconic 1970s fashion.\"","February":"The second month of the year. \"February is the shortest month.\"","feline":"Relating to or resembling a cat. \"The feline moved silently when stalking its prey.\"","finance":"Management of money and assets. \"Finance deals with things like banking, investments, and taxes.\"","financial":"Relating to money and the management of money. \"Her financial goal is to eliminate debt.\"","flavor":"The particular taste of something. \"This chili has a spicy, smoky flavor.\"","Florida":"A state located in the southeastern United States, known for its beaches and warm climate. \"Orlando, Florida is home to many amusement parks.\"","forbidding":"Discouraging, causing reluctance to do something. \"The rickety bridge over the canyon looked forbidding.\"","forecast":"A prediction about the future, especially the weather. \"The forecast calls for sunny skies tomorrow.\"","forgetting":"Unable to recall or remember something. \"I kept forgetting my locker combination.\"","formation":"Arrangement of people or things in a group. \"The marching band lined up in formation on the field.\"","fortress":"A fortified stronghold or protected building. \"The imposing medieval fortress stood atop the hill.\"","fracture":"The cracking or splintering of a hard object or bone. \"The ice caused me to slip and fracture my wrist.\"","freeze":"Turn from liquid into solid ice and become hard. \"Water freezes at 32Fahrenheit.\"","freight":"Goods carried by transport vehicles. \"The freight train hauled a variety of commercial goods.\"","French":"Relating to France, its people or culture. \"We learned some basic French phrases before traveling there.\"","frequent":"Happening often. \"Blinking and yawning can be frequent when you're tired.\"","frustrating":"Causing irritation or annoyance. \"This frustrating math homework left me ready to be done with school!\"","function":"The natural purpose or role something serves. \"The heart's function is to pump blood through the body.\"","fungi":"Kingdom which includes mushrooms, molds, and yeasts. \"Mushrooms and molds are types of fungi.\"","fungus":"Any of the members of the kingdom Fungi, lacking chlorophyll and vascular tissue. \"Athlete's foot is caused by a fungal infection.\"","furthermore":"In addition, besides that. \"I don't care for adrenaline rides. Furthermore, I'm afraid of heights.\"","galaxy":"Large system of billions of stars held together by gravity. \"Our solar system is part of the Milky Way galaxy.\"","gallop":"Running gait of a quadruped faster than a canter. \"The horse broke into a gallop around the track.\"","gaseous":"Existing as or having characteristics of a gas. \"Oxygen, nitrogen, and carbon dioxide are gaseous elements.\"","gauge":"An instrument for measuring or indicating quantity. \"The fuel gauge showed the car's tank was nearly empty.\"","gene":"Unit of heredity transferred from parent to offspring. \"Eye color is determined by genes inherited from your parents.\"","generation":"All people born in about the same date range. \"The Baby Boom generation refers to those born 1946-1964.\"","genuine":"Real and authentic, not fake. \"Pearls can be tested to determine if they are genuine.\"","geometry":"Branch of mathematics concerned with shapes and their properties. \"We learned about triangles, circles, and angles in geometry class.\"","Germany":"A country in central Europe with over 80 million people. \"Berlin is the capital of Germany.\"","giant":"Of exceptionally great size or extent. \"Jack climbed a giant beanstalk that stretched up into the clouds.\"","gopher":"A burrowing rodent with pocket-like cheek pouches. \"The gopher dug tunnels across the yard.\"","graduate":"Earn an academic diploma or degree. \"After years of hard work she finally graduated from medical school.\"","graphic":"Relating to visual art and design. \"The graphic artist illustrated the children's book.\"","graphite":"Mineral used for pencil lead. \"When graphite marks paper, it leaves behind a shiny gray line.\"","greatest":"Ranking above all else in quality or intensity. \"Giving brings me the greatest joy.\"","Greek":"Relating to Greece, its people, language or culture. \"Democracy originated in ancient Greek city-states.\"","grinned":"Smiled broadly. \"He grinned from ear to ear when he unwrapped the gift.\"","grumble":"Complain or protest about something in a bad-tempered way. \"I grumble about having to walk the dog in the cold rain.\"","gullible":"Easily tricked or convinced. \"Don't be so gullible as to believe everything you read online.\"","Hawaii":"A state comprised of islands in the Pacific Ocean west of California. \"Hawaii has beautiful beaches, volcanoes, and tropical forests.\"","headache":"Pain or discomfort in the head. \"Staring at screens too long gives me a headache.\"","heritage":"Practices or qualities passed down the generations. \"My Hispanic heritage influences my culture and traditions.\"","hesitate":"Pause before acting or speaking. \"She hesitated before answering the difficult question.\"","horizon":"The line where the earth or sea and sky appear to meet. \"The sun dipped below the horizon at dusk.\"","horrible":"Extremely unpleasant or disagreeable. \"Getting stuck in an elevator was a horrible experience.\"","hospital":"Institution providing medical care. \"Doctors in the hospital raced to save hist life after the accident.\"","human":"Relating to people or the species Homo sapiens. \"Humans have advanced cognitive abilities compared to other animals.\"","hundredth":"Coming after ninety-nine others. \"Today is the hundredth day of school!\"","hurricane":"Severe tropical storm with high winds and heavy rain. \"The hurricane caused major flooding up the coast.\"","hurry":"Move or act quickly. \"I had to hurry to catch the bus on time!\"","hydrogen":"Colorless, highly flammable gaseous chemical element, the simplest and lightest element. \"Hydrogen and oxygen combine to form water.\"","hyena":"Mammal in Africa and Asia noted for scavenging and opportunistic preying on animals. \"The hyena scrounged for scraps to eat.\"","ignorant":"Lacking education or knowledge. \"I was ignorant of how computers worked before my information technology class.\"","ignore":"Refuse to pay attention to. \"I ignored the bully's unkind remarks.\"","Illinois":"A midwestern state in the United States; its capital is Springfield. \"Chicago is the largest city in Illinois.\"","impartial":"Treating all sides equally and fairly. \"A good referee is impartial and does not favor one team over another.\"","impatient":"Restless from waiting, wanting something to happen quickly. \"I grew impatient while Grandma searched for her keys.\"","imply":"Suggest indirectly. \"His angry tone implied that he was unhappy with me.\"","improvement":"An enhancement or increase in positive qualities. \"Regular exercise leads to improvement in heart and lung health.\"","improving":"Making or becoming better. \"I look forward to improving my chess skills.\"","inaccurate":"Incorrect, imprecise. \"The first measuring attempt was inaccurate.\"","inadequate":"Not sufficient for a purpose. \"The old computer proved inadequate for running new software.\"","incidentally":"By the way, used to introduce an unrelated topic. \"Incidentally, did you hear that Jessica is moving?\"","income":"Money gained or earned from work, investments, etc. \"Her income supports her basic needs.\"","increase":"Rise incrementally in size, amount, etc. \"Turn up the volume knob to increase the loudness.\"","incredible":"Unbelievable, extraordinary. \"It's incredible that a kangaroo can jump 30 feet!\"","indeed":"Truly, in fact. \"Indeed, learning new abilities stretches your brain.\"","indefinite":"Not precisely limited in time or space. \"His retirement date is still indefinite.\"","indicate":"Point out, signal, show. \"A flashing red traffic light indicates to stop.\"","industry":"Businesses producing goods or services. \"Many jobs were lost when the factory closed and the industry moved.\"","ineffective":"Not producing a desired effect, result, or outcome. \"The medicine was ineffective at curing his illness.\"","inefficient":"Wasteful of time or energy. \"This old oven is inefficient and uses too much electricity.\"","ineligible":"Not qualified to be chosen or permitted. \"Children under 13 are ineligible to create social media accounts.\"","inequality":"Lack of equality, unevenness. \"Racial inequality persisted despite laws intended to prevent discrimination.\"","inferred":"Implied or concluded even though not directly expressed. \"From his angry tone, I inferred he was upset.\"","influential":"Having great influence on someone or something. \"Martin Luther King Jr. was an influential civil rights activist.\"","information":"Facts or details about something or someone. \"Please provide contact information like your name and phone number.\"","infraction":"Violation of a law, rule, or agreement. \"The umpire warned the pitcher after his first infraction of throwing near the batter's head.\"","inherit":"Receive money or possessions from someone after their death. \"The eldest son will inherit the family business.\"","inquiry":"A question or query seeking information. \"After further inquiry, I learned more details about the accident.\"","insect":"Small six-legged invertebrate animal like a beetle, fly, or bee. \"Ants and bees are fascinating social insects.\"","insecure":"Uncertain or anxious due to lack of confidence. \"She felt insecure speaking in front of large groups of people.\"","instant":"Occurring immediately, without delay. \"Add hot water for instant oatmeal.\"","instruction":"Information provided about how to do something correctly. \"Follow the recipe instructions carefully.\"","insult":"A disrespectful or scornful remark or act. \"Shouting was an insult to her intelligence.\"","insurance":"Protection from financial loss. \"Car insurance covers damages from an accident.\"","interesting":"Engaging the attention and curiosity. \"That is an interesting idea you should pursue.\"","internal":"On or relating to the inside. \"The internal components of the clock were intricate.\"","internet":"Global computer network system providing access to online information. \"The internet provides endless knowledge if used responsibly.\"","interstate":"Relating to travel between states. \"We drove on the interstate highway to visit family out of state.\"","intestine":"Long, coiled tube organ where digestion is completed. \"The small intestine is over 20 feet long in humans.\"","introduction":"Presenting something newly brought to notice. \"Let me make introductions and acquaint you both.\"","investigating":"Carefully examining in detail to uncover facts. \"Detectives are investigating the robbery to identify the thieves.\"","invisible":"Unable to be seen. \"Bacteria are invisible to the naked eye.\"","irritate":"Annoy, provoke, or cause impatience. \"Loud noises irritate me when I'm trying to concentrate.\"","Italy":"A country extending into southern Europe bordering the Mediterranean Sea. \"Rome is the capital of Italy.\"","January":"The first month of the year. \"January is the coldest winter month here.\"","jewelry":"Ornaments like necklaces, rings, and bracelets worn for decoration. \"The jewelry store had beautiful diamond rings on display.\"","journeyman":"Skilled worker who has served an apprenticeship. \"He became a journeyman electrician after four years of training.\"","July":"The seventh month of the year. \"July is hot and humid here.\"","June":"The sixth month of the year. \"We celebrate my birthday in early June.\"","Jupiter":"The largest planet in our solar system, fifth from the sun. \"Jupiter has distinctive colorful bands circling the planet.\"","killed":"Caused the death of something living. \"The extreme cold killed many plants in the garden.\"","knitting":"Making fabric from yarn using two needles. \"Knitting takes coordination and practice to master.\"","laughter":"The act of laughing or strong expression of amusement. \"Jokes inspire laughter and smiles.\"","launch":"Start or propel something with force. \"The rocket will launch into space today.\"","lavender":"Fragrant purple flower used in perfumes and aromatherapy. \"Lavender essential oil has a calming effect.\"","leopard":"Large wild cat with yellowish fur and black spots. \"The leopard stealthily stalked its prey through the brush.\"","level":"Flat horizontal position or degree of intensity. \"Make sure the picture is perfectly level on the wall.\"","library":"Collection of books and other material organized for use. \"Let's go to the library and check out some new books!\"","limiting":"Imposing restrictions or constraints. \"A curfew is a limiting rule but it keeps kids safe.\"","lizard":"Cold-blooded reptile, usually having four legs and a tapering tail. \"The lizard did push-ups to regulate his temperature.\"","locate":"Find or establish the exact place or position of something. \"Use the GPS to help locate the museum.\"","logic":"Reasoning conducted according to strict principles. \"In logic, conclusions must follow logically from premises.\"","Louisiana":"A southern state in the United States on the Gulf of Mexico. \"New Orleans, in Louisiana, is known for its lively jazz scene.\"","loyal":"Steadfast in allegiance or duty. \"A dog is a loyal friend.\"","magenta":"A vivid reddish purple color. \"Magenta paint comes from mixing red and blue.\"","major":"Greater in importance or significance. \"A major advantage is that the bus stop is close by.\"","mall":"Large shopping area with many stores. \"We spent the afternoon walking around the mall.\"","mandatory":"Required by authority, compulsory. \"School attendance is mandatory for children until age 16.\"","mansion":"Large, impressive house. \"The mansion had over 20 rooms.\"","Massachusetts":"A state in the northeastern United States. \"Boston is the capital of Massachusetts.\"","matter":"Physical substance that occupies space. \"Matter has mass and takes up space.\"","measuring":"Finding dimensions, capacity or quantity. \"We learned about measuring length in math class.\"","media":"Means of mass communication like TV, radio, and newspapers. \"Social media allows connecting online.\"","melody":"Sequence of musical notes producing a pleasing sound. \"She hummed a cheerful melody.\"","melon":"Fruit with a rind and sweet juicy flesh like cantaloupe. \"We cubed the melon to make a fruit salad.\"","merciless":"Having or showing no mercy. \"The dictator was merciless and ruled by fear.\"","Mercury":"The first and smallest planet in our solar system, closest to the sun. \"Mercury is about 3,000 miles in diameter.\"","mesosphere":"The layer of the atmosphere extending from the stratosphere to about 50 miles up. \"Meteors burn up in the mesosphere.\"","meteorology":"The study of the weather and climate. \"Meteorology helps predict major storms so people can prepare.\"","methodology":"System or procedures used to accomplish something. \"We developed a methodology to analyze the data.\"","Mexico":"A country extending southeast from the southern United States border to Guatemala and Belize. \"Mexico City is the capital and largest city in Mexico.\"","migration":"Periodic movement from one region to another. \"Bird migration routes cover huge distances.\"","millennium":"Period of 1,000 years. \"We rang in the start of the third millennium on January 1, 2001.\"","millionth":"Being number one million in a countable series. \"This car is the millionth one made at our factory!\"","Minnesota":"A state in the upper midwestern United States. \"The capital of Minnesota is St. Paul.\"","misconception":"Incorrect understanding or false impression about something. \"He had the misconception that bats are blind.\"","Mississippi":"A major river of the south-central United States flowing south to the Gulf of Mexico. \"The port city of New Orleans sits near the mouth of the Mississippi River.\"","Missouri":"A midwestern state with the capital Jefferson City and large cities of St. Louis and Kansas City. \"The Missouri River's headwaters start in Montana.\"","modern":"Related to the present or recent times. \"Laptop computers are indispensable modern devices.\"","molecule":"The smallest unit of matter comprising one or more bonded atoms. \"Water molecules are made of two hydrogen atoms and one oxygen atom.\"","motion":"The act of moving or changing position. \"The motion of the swing made me feel dizzy.\"","museum":"Building used for storing and exhibiting objects of interest. \"We saw dinosaur skeletons at the natural history museum.\"","mustard":"Spicy yellow condiment made from mustard seeds. \"A hot dog topped with ketchup and mustard is a classic.\"","mythology":"Collection of myths of a culture or religion. \"Greek and Roman mythology included many gods and heroes.\"","nautical":"Relating to seafaring ships and navigation. \"Using stars for nautical navigation dates back centuries.\"","navigation":"Determining position and planning travel routes, especially on water. \"Learning navigation involves compass reading and chart plotting skills.\"","necessary":"Absolutely needed or required. \"Food, water, and shelter are necessary for survival.\"","needle":"Thin, pointed metal tool used for sewing. \"Thread the needle before you start stitching.\"","Neptune":"The eighth and most distant major planet in our solar system. \"Neptune appears blue because of methane gas in its atmosphere.\"","noisily":"In a loud, noisy manner. \"The kids noisily rushed in from recess.\"","noodle":"Long, thin, ribbon-like pasta or another dough. \"Ramen noodles make a quick, easy meal.\"","northern":"Of, relating to, or located in the north. \"During winter, northern areas get less sunlight and colder weather.\"","notable":"Worthy of attention, important, remarkable. \"His notable achievement deserves recognition.\"","notation":"System of symbols used to represent information. \"Musical notation indicates pitch and rhythm.\"","notify":"Inform someone of something officially. \"Please notify the office if you will be late or absent.\"","novel":"Fiction book long enough to fill a complete book. \"Over winter break I read two fantasy novels.\"","November":"The eleventh month of the year. \"Thanksgiving is celebrated in November in the United States.\"","nuclei":"Plural of nucleus, the center of an atom. \"The nuclei of atoms contain protons and neutrons.\"","nucleus":"The positively charged central core of an atom. \"The nucleus contains nearly all an atom's mass.\"","obligation":"A duty, responsibility or commitment. \"Jury duty is an important civic obligation.\"","oblong":"Elongated, elliptical. \"An egg has an oblong shape.\"","obnoxious":"Extremely unpleasant or objectionable. \"Fingernails screeching down a chalkboard is an obnoxious sound.\"","obsessed":"Preoccupy the thoughts, feelings, or desires of someone excessively. \"He was obsessed with collecting comic books.\"","obsolete":"No longer used, out of date. \"That old computer is now obsolete.\"","obstruct":"Block or impede the progress of something. \"The fallen tree obstructs the roadway.\"","obvious":"Easily perceived, plain and evident. \"It's obvious the child is very smart.\"","occupation":"Work, job or principal activity. \"Her occupation was engineering.\"","octave":"Interval of eight tones between two musical notes. \"The first and last notes are an octave apart.\"","October":"The tenth month of the year. \"Halloween is celebrated in October.\"","opposite":"Completely different, contrary. \"Up is the opposite of down.\"","orchard":"Area of land where fruit trees are cultivated. \"The orchard was filled with blooming apple trees.\"","ostrich":"Large, fast-running flightless bird native to Africa. \"Ostriches have long legs and a long neck.\"","otherwise":"If not, except. \"I have to leave now, otherwise I'll be late.\"","oxygen":"Colorless, odorless gas necessary for animal life. \"We cannot survive without breathing oxygen.\"","palatial":"Magnificent and imposing like a palace. \"The palatial mansion had 40 rooms.\"","panel":"Flat section forming part of a surface. \"The wood panel covered the hole in the wall.\"","participle":"Verb form used as an adjective. \"Broken and swollen are past participles.\"","particular":"One specific or certain thing. \"This particular apple is bruised.\"","passive":"Accepting without resistance, not active or engaged. \"After the long day I was in a passive mood.\"","pathology":"Scientific study of diseases. \"Pathology involves studying the cause and effects of disease.\"","pelican":"A large water bird with a huge pouch-like beak. \"Pelicans plunge into water to catch fish in their elastic pouches.\"","Pennsylvania":"A state in the northeastern United States. \"The capital of Pennsylvania is Harrisburg.\"","perennial":"Lasting or active through many years or seasons. \"Tulips are not perennial flowers.\"","performance":"Act of carrying out an action or role. \"The orchestra's performance was flawless.\"","period":"A length of time with definite beginnings and endpoints. \"This elliptical sentence has too many words between periods.\"","perishable":"Likely to decay or spoil quickly. \"We transported the perishable groceries in a cooler.\"","permissible":"Allowable within limits or rules. \"The permissible noise level was exceeded.\"","permitted":"Allowed based on authorization or rules. \"Turning right on red is permitted at most intersections.\"","persecution":"Mistreatment or harassment due to race, religion, or politics. \"Religious persecution led many to flee the country.\"","petroleum":"Naturally occurring flammable liquid found in rock used for fuel. \"Petroleum is used to make many products like plastic, asphalt, and gasoline.\"","pharmacy":"Place where medicinal drugs are prepared and dispensed. \"We dropped off the prescription at the pharmacy.\"","picnic":"Enjoying a meal outdoors. \"We packed sandwiches for a picnic at the park.\"","pilgrim":"One who journeys to a sacred or sentimental place. \"Pilgrims voyage to the holy temple.\"","plaster":"A smooth coating made of lime, sand, and water applied to walls and ceilings. \"We repainted the old plaster walls.\"","playwright":"One who writes plays. \"William Shakespeare was a famous playwright.\"","pleasant":"Agreeable, enjoyable, friendly. \"Sitting under the shady tree on a breezy day was pleasant.\"","plentiful":"Existing in great quantities. \"After the rains, the flower bloomed in plentiful numbers.\"","plugged":"Inserted a plug into an opening. \"She plugged her phone into the charger.\"","plunge":"Sudden falling or diving into water. \"There is a rope swing to plunge from near the waterfall.\"","politician":"Person experienced in politics or government. \"The politician gave a speech to appeal to voters.\"","porcupine":"Rodent with a covering of quills for defense. \"The porcupine shot its quills at the predator.\"","possible":"Capable of happening or being true. \"Reaching an agreement with him seems possible.\"","powerful":"Having great power, force, or potency. \"Elephants are very powerful and strong.\"","practice":"Carry out or perform an activity repeatedly to improve skill. \"Daily violin practice strengthens technique.\"","preferable":"More desirable or worthy of choice. \"Reading is preferable to watching TV.\"","prejudice":"Preconceived opinion formed without reason. \"We must combat racial prejudice in our society.\"","preposition":"Word used to link nouns, pronouns, or phrases to other words. \"Above is a preposition indicating higher position.\"","prescription":"Doctor's written instruction for a medicine or treatment. \"The prescription directions must be followed carefully.\"","printed":"Impressed words and images on paper or other material. \"She printed her homework assignment neatly.\"","process":"Series of actions conducted in a certain order. \"Making soup involves a process of preparation, cooking, and blending.\"","production":"Process of manufacturing goods or entertainment. \"Automobile production involves assembly line techniques.\"","projection":"An estimate of future possibilities based on current data. \"Sales projections help businesses plan for the coming year.\"","prompt":"On time, punctual. We arrived promptly at 9:00 to start the meeting.\"","pronouncing":"Declaring or saying aloud clearly. \"She had difficulty pronouncing the word correctly.\"","property":"Possessions or assets owned by someone. \"They purchased a summer vacation property.\"","protein":"Nutrients that build and maintain body tissue and muscle. \"Meat, eggs, beans, and nuts contain protein.\"","provide":"Give, supply, or make available. \"Teachers provide guidance and instruction.\"","psychology":"Scientific study of mental processes and behavior. \"She majored in psychology in college.\"","publicity":"Information to bring something to public notice and attention. \"Good publicity really boosted sales.\"","quadrangle":"Four sided shape, rectangle. \"The quadrangle field was perfect for sports.\"","quadrant":"One quarter of a circle or sphere. \"The first quadrant contains positive x and y values.\"","quadruple":"Four times as many or much. \"The new highway has quadruple the lanes.\"","quarrel":"Angry dispute or altercation. \"The quarrel between the normally friendly neighbors was unexpected.\"","quartet":"Four musicians playing together. \"The string quartet played a lovely classical piece.\"","questionable":"Doubtful, suspect. \"His questionable behavior caused suspicion.\"","racial":"Related to someone's race or ethnicity. \"Racial discrimination is illegal.\"","radio":"Device that receives broadcast audio signals. \"We listened to music on the radio.\"","realize":"Become fully aware of something. \"I suddenly realized I forgot my homework at home!\"","recent":"Happening or beginning not long ago. \"In recent years the trend has shifted.\"","recession":"Period of reduced economic activity and production. \"The recession caused businesses and jobs to be lost.\"","reduction":"The act of making something smaller in size or amount. \"Turning down the heat caused a reduction in the gas bill.\"","referred":"Recommended or directed for information. \"My doctor referred me to a specialist.\"","refraction":"Bending of waves like light due to changing speeds. \"Refraction causes light to bend through prisms and lenses.\"","refrigerator":"Appliance that keeps food cold. \"The refrigerator keeps milk, fruits, and veggies fresh.\"","register":"An official record documenting details. \"I used the log book to register my hours worked.\"","regrettable":"Unfortunate and causing disappointment or sadness. \"His regrettable behavior caused the team to lose.\"","regretting":"Feeling sad or disappointed over something. \"I regretted yelling instead of talking calmly.\"","rehearse":"Practice and prepare a performance. \"The play rehearses every night before opening night.\"","reindeer":"Mammal named for their branched antlers, familiar as Santa's sleigh pullers. \"Reindeer live in cold arctic climates.\"","rely":"Depend on with confidence. \"I rely on my alarm clock to wake me up on time.\"","remain":"Stay in place, continue to exist. \"Only a minute remained before summer vacation started!\"","remarkable":"Extraordinary, arousing admiration. \"The chess player's remarkable skill amazed everyone.\"","renaissance":"Period of rebirth in art and learning in Europe about 1400-1600. \"Leonardo da Vinci lived during the Renaissance.\"","renewable":"Capable of being remade or restored. \"Solar power is a renewable energy source.\"","repeated":"Said, done, or occurring again. \"His repeated mistakes were frustrating.\"","replacing":"Taking the place of something removed. \"We are replacing the broken window.\"","representation":"Likeness, picture, model, or substitute form. \"This sculpture is a representation of a real person.\"","require":"Need something as mandatory or essential. \"Baking cookies requires flour, sugar, and eggs.\"","residential":"Relating to private houses and apartments. \"This residential neighborhood has only single-family homes.\"","respiratory":"Relating to breathing. \"The respiratory system brings air to the lungs.\"","restaurant":"Place where meals are prepared and served to customers. \"Let's eat at the new Italian restaurant downtown.\"","reverent":"Feeling or showing profound awe and respect. \"The reverent worshipers knelt quietly.\"","revolution":"Overthrow and replacement of an established government or system. \"The American colonies revolted against British rule.\"","rhythm":"Movement or variation characterized by a patterned repetition or flow. \"Snapping his fingers to the rhythm, he sang along cheerfully.\"","ridiculous":"Absurd, silly, or unreasonably extreme. \"Wearing sunglasses at night is ridiculous.\"","rivalry":"Competition between opponents or rivals. \"The schools had a long football rivalry.\"","route":"Fixed course for travel. \"What's the best route to the airport from here?\"","rubbing":"Moving something repeatedly over a surface. \"Rubbing the cloth removed the stain.\"","running":"Moving rapidly by foot. \"I go running every morning to stay fit.\"","sacrificial":"Offered or dedicated in sacrifice. \"The altar fire consumed the sacrificial offerings.\"","salmon":"Large pink fish that swims upstream to spawn. \"Catching a big salmon makes for an exciting fishing trip!\"","sandwich":"Two slices of bread with a filling in between. \"For lunch I packed a peanut butter and jelly sandwich.\"","saturated":"Soaked with liquid to the point of being unable to absorb more. \"The sponge was saturated after being in the spill.\"","Saturn":"Sixth planet from the sun known for its rings. \"Saturn is made mostly of hydrogen and helium gases.\"","saucer":"Small dish for serving tea or coffee cups. \"Please place the saucer under the teacup.\"","sausage":"Highly seasoned minced meat stuffed in casings. \"Chorizo is a spicy Spanish sausage.\"","scissors":"Tool for cutting paper, cloth, etc with two crossing blades. \"Use scissors to carefully cut fabric.\"","scowl":"Facial expression of anger, displeasure, or concentration. \"Her scowling face showed she wasn't happy.\"","secret":"Something kept hidden, unknown, or private. \"We kept our treehouse a secret by hiding it in the woods.\"","secretary":"Person who handles correspondence, keeps records, makes appointments. \"The secretary answered the phone and scheduled appointments.\"","sense":"Any of the ways humans and animals perceive stimuli about the body or surroundings. \"My senses of smell, taste, sight, hearing, and touch provide information about the world.\"","separate":"Set or keep apart, disunite. \"We separated the recyclables into bins by type.\"","September":"The ninth month of the year. \"September marks the start of autumn.\"","serious":"Grave in nature or manner, not trivial. \"A heart attack is a serious medical emergency.\"","servant":"Person who performs services for others. \"The lady had several servants who cooked and cleaned for her.\"","settlement":"Place newly settled or a legal resolution. \"The small settlement grew into a town.\"","shelf":"Flat board attached to a structure for holding objects. \"The shelf held colorful children's books.\"","shelves":"Plural of shelf, a flat board. \"The store shelves were stocked with sale items.\"","silent":"Making no sound, quiet. \"We tiptoed silently so as not to wake the baby.\"","similar":"Alike or comparable in some respects. \"Both trees are similar in shape and color.\"","single":"One only, not paired. \"A single shoe was left under the bunk bed.\"","situation":"Set of circumstances at a given moment. \"The situation was dangerous but we stayed calm.\"","skunk":"Mammal that can spray a strong bad smelling fluid. \"The skunk's foul odor kept predators away.\"","slamming":"Shut forcefully and noisily. \"Slamming doors shows poor self-control.\"","smile":"Arrange facial expression by raising the corners of the mouth. \"Flashing a big smile can make someone feel welcomed.\"","sociology":"Study of human society and social relationships. \"Sociology examines groups, cultures, and social institutions.\"","soldiers":"People serving in an army. \"The soldiers stood in formation for inspection.\"","solemn":"Deeply serious and sober. \"The judge's solemn verdict hushed the courtroom.\"","solidify":"Make solid, compact, or hard. \"Adding gelatin solidified the fruit juice into jelly.\"","solstice":"Time when the sun reaches its farthest point north or south of the equator marked by the longest and shortest days. \"In the northern hemisphere, the summer solstice marks the year's longest day.\"","solution":"A method or process for solving problems. \"Communication can be part of the solution.\"","someone":"An unspecified person. \"Someone left cookies for Santa!\"","soprano":"Highest female vocal range. \"She sang soprano with perfect pitch and tone.\"","southern":"Of, relating to, or located in the south. \"Sweet tea is a popular southern drink.\"","spaghetti":"Long, thin pasta often served with tomato sauce. \"We topped the spaghetti with Parmesan cheese.\"","Spain":"A country located mostly on the Iberian Peninsula in southwestern Europe. \"Madrid is the capital and largest city in Spain.\"","specific":"Clearly defined, definite. \"Can you provide more specific directions?\"","spectacle":"Something that is impressive to look at. \"The circus trapeze act was a spectacular spectacle.\"","speculating":"Theorize about a subject without firm evidence. \"I'm speculating, but I think it will snow tomorrow.\"","spherical":"Shaped like a sphere or ball. \"The spherical planets orbit the Sun in elliptical paths.\"","sprint":"Running at top speed for a short burst. \"She sprinted the last 100 meters of the race.\"","standard":"Level of quality or achievement generally accepted as normal or average. \"This essay does not meet our standard for excellence.\"","statement":"Something stated, a declaration. \"In the closing statement the attorney summarized his case.\"","station":"Place providing a public service. \"The train paused briefly at each station before continuing.\"","stomach":"Internal digestive organ and cavity. \"When I'm nervous I feel it in the pit of my stomach.\"","stopping":"Coming to rest, ceasing movement. \"Stopping at stop signs is the law.\"","straight":"Uncurved, direct, straightforward. \"Please cut the board into a straight line.\"","strange":"Unusual or surprising. \"Hearing noises at night, I got a strange feeling of being watched.\"","stratosphere":"Second layer of the atmosphere 10-30 miles up containing the ozone layer. \"Jet aircraft fly in the upper stratosphere.\"","stretched":"Extended in length or breadth. \"She stretched before running to warm up muscles.\"","stringent":"Imposing rigorous standards of performance. \"The coach's stringent demands improved the team.\"","student":"One who attends school to learn. \"The gifted student excelled academically.\"","studio":"Room for artists, photographers, or performers. \"The music studio had acoustic paneling.\"","subdivision":"Division into smaller parts or sections. \"Our neighborhood is part of a large residential subdivision.\"","subheading":"Title placed under or subordinate to the main title. \"Each chapter included informative subheadings.\"","submarine":"Naval vessel capable of operating underwater. \"The submarine submerged and traveled silently underwater.\"","submerge":"Put or go completely under water. \"We submerged the bottles in the stream to keep them cold.\"","submission":"Act of submitting or surrendering power to another. \"Rebels opposed the government's submission to foreign powers.\"","subordinate":"Placed in a lower rank or position. \"The cadet answered respectfully when addressed by a subordinate officer.\"","subscribe":"Arrange to receive something regularly. \"You can subscribe to get the newsletter by email monthly.\"","subscription":"Fee paid for media delivered regularly. \"I purchased a monthly magazine subscription.\"","substances":"Material with particular physical characteristics. \"Toxic substances must be disposed of properly.\"","substantial":"Large in importance, value, degree, amount or size. \"Winning the big contract represents substantial revenue for the company.\"","substitute":"Use or add in place of something. \"If you don't have buttermilk, substitute plain yogurt in the recipe instead.\"","succeed":"Achieve desired aims or results. \"I finally succeeded through perseverance.\"","suffering":"Experiencing pain, distress or hardship. \"The suffering refugees urgently needed food and shelter.\"","suffrage":"The right to vote. \"Women gained the right to vote through the suffrage movement.\"","suggested":"Proposed an idea or plan. \"She suggested taking a shortcut to get there faster.\"","suitable":"Appropriate, proper, well-matched. \"These shoes are not suitable for hiking on rugged trails.\"","supply":"An amount available for use. \"The Red Cross supplied food and blankets after the disaster.\"","suppose":"Assume something is true without evidence. \"I suppose it could be true, though there's no proof.\"","surprise":"An unexpected event. \"The birthday party was a surprise.\"","sustained":"Continued without interruption. \"His sustained effort paid off when he won first place.\"","sweater":"Knitted garment worn on the upper body. \"Her new sweater was red with a snowflake pattern.\"","symbol":"Sign representing something abstract. \"A heart shape is a symbol for love.\"","tangerine":"Citrus fruit like a small orange with loose, easily peeled skin. \"Tangerines make a healthy snack.\"","tangible":"Perceptible by touch, having actual form. \"The rough brick had a tangible texture.\"","taxes":"Compulsory monetary contributions levied by the government. \"Federal income taxes fund public services.\"","technique":"Method for completing a task or process. \"Using proper technique is key in sports.\"","tenant":"One who rents and occupies land, property or housing owned by another. \"The tenant rented an apartment in a busy downtown area.\"","Tennessee":"A state located in the south-central United States. \"Nashville, the capital, is located in the Middle Tennessee region.\"","tenor":"Highest natural adult male singing range. \"He sang tenor in the choir.\"","tentative":"Uncertain, not definite. \"Our tentative travel plans may change.\"","tenth":"Next after ninth, 1/10. \"One-tenth of one hundred is ten.\"","terminology":"Set of technical words used in a particular field. \"You'll need to learn some basic medical terminology.\"","terrier":"Breed of small to medium-sized dogs originally bred to hunt vermin. \"The energetic terrier chased squirrels in the park.\"","terrified":"Extremely frightened. \"She was terrified of spiders.\"","theology":"Study of religion and religious truth and principles. \"He studied theology for years before becoming a minister.\"","thermosphere":"Outermost layer of Earth's atmosphere from about 56 miles up. \"The aurora shimmers in the gases of the thermosphere.\"","thorough":"Covering all details, comprehensive. \"She conducted a thorough review of the documents.\"","thousandth":"Coming after nine hundred ninety-nine others. \"This car is the ten thousandth one we've manufactured this year.\"","threatening":"Expressing impending danger or harm. \"Dark storm clouds have a threatening look.\"","throughout":"In or during every part, everywhere. \"I felt pain throughout my body after the workout.\"","thunder":"Loud crashing noise from lightning. \"The thunder boomed loudly during the storm.\"","thus":"As a consequence, in this way. \"He studied hard all semester. Thus, he earned excellent grades.\"","tolerable":"Capable of being endured or tolerated. \"The man had a tolerable amount of pain after taking medication.\"","tolerating":"Accepting without objection. \"We pride ourselves on tolerating diverse opinions.\"","torrential":"In the manner of a raging or violently rushing stream. \"Torrential rainfall caused dangerous flooding.\"","tortoise":"Reptile with domed shell found on land. \"The slow-moving tortoise lost the race to the hare.\"","trace":"Small amount left of something. \"There wasn't a trace of the missing items left behind.\"","track":"Path, route or trail. \"We followed the dirt track through the forest.\"","transfer":"Move from one place to another. \"Documents can be transferred between computer drives.\"","trilogy":"Set of three related works. \"The trilogy told an epic story over three books.\"","trinity":"Group of three closely related members. \"The trinity of spinach, strawberries, and pecans made a great salad.\"","triple":"Three times as many or as much. \"A triple scoop ice cream cone is a lot of ice cream!\"","trophy":"Prize awarded for victory or achievement. \"The champion basketball player held her trophy proudly.\"","troposphere":"Lowest layer of the atmosphere where weather occurs. \"Commercial airplanes fly in the troposphere.\"","trouble":"Difficulty, distress, or affliction. \"Engine trouble forced emergency landing of the aircraft.\"","trout":"Freshwater fish often caught for food. \"We caught a delicious rainbow trout for dinner.\"","tumble":"Fall suddenly with confusion. \"Slipping on the icy steps, he took a bad tumble.\"","turquoise":"Greenish-blue gemstone. \"She wore a beautiful turquoise pendant.\"","turtle":"Reptile with hard upper shell and soft lower parts. \"The sea turtle swam gracefully underwater.\"","typhoon":"Storm or hurricane in the western Pacific Ocean. \"The typhoon brought intense wind and rainfall.\"","underline":"Draw a line under for emphasis. \"Your name should be underlined at the top of the test.\"","unicycle":"One-wheeled vehicle ridden upright. \"Riding a unicycle takes coordination and balance.\"","uniform":"Consistent clothing worn by group members. \"Students wore blue and white school uniforms.\"","universe":"All of space and everything in it. \"The universe is constantly expanding.\"","unusual":"Not normal, uncommon. \"Seeing a monkey at the zoo was highly unusual.\"","upsetting":"Causing distress or worry. \"Losing the game was really upsetting for the players.\"","Uranus":"Seventh planet from the sun known for a rotational axis tilt. \"Uranus orbits the sun once every 84 years.\"","valley":"Low area of land between hills or mountains. \"The beautiful green valley had a winding river.\"","vanish":"Disappear suddenly and completely. \"The mist vanished as the sun rose higher.\"","various":"Several different kinds. \"We saw various species of birds on the nature walk.\"","velvet":"Cloth with a thick soft piled surface. \"The cake's red velvet flavor comes from cocoa.\"","Venus":"Second planet from the sun named for the Roman goddess of love and beauty. \"Venus is the brightest natural object in Earth's night sky.\"","vertex":"Point where two lines meet. \"Each vertex of a rectangle is a right angle.\"","vertices":"The Plural form of vertex. \"The cube has eight vertices where the edges meet.\"","vertical":"Aligned up and down perpendicular to level ground. \"The rock climbers scaled the sheer vertical cliff.\"","victory":"Winning a contest or battle. \"After a hard-fought game, it was sweet victory.\"","Virginia":"A state on the Atlantic coast of the eastern United States. \"Richmond is the capital city of Virginia.\"","virus":"Infectious agent that replicates within cells. \"The flu virus makes many people sick each winter.\"","visual":"Relating to seeing or sight. \"A vivid visual description engages the imagination.\"","vocabulary":"Set of words used in a particular language or field. \"I'm compiling a vocabulary list of new terms.\"","volume":"Amount of space occupied by something. \"Please turn down the volume on the radio.\"","volunteer":"Person who performs a service willingly without pay. \"After school she volunteers at the animal shelter.\"","voyage":"Long journey involving travel by sea or space. \"The voyage to discover new lands was risky and dangerous.\"","walrus":"Large flippered marine mammal with long tusks. \"The walrus dove into arctic waters looking for clams and fish.\"","Washington":"A state located in the Pacific Northwest region of the United States. \"Olympia is the capital of Washington.\"","webbed":"Connected by a thin sheet of skin. \"Ducks have webbed feet adapted for swimming.\"","western":"Located in or oriented toward the west. \"Many pioneers traveled out west by wagon train.\"","whisper":"Speak very softly using one's breath. \"We had to whisper during the movie so as not to disturb others.\"","winning":"Coming in first place in a contest. \"Our school soccer team is winning more games this season.\"","Wisconsin":"A state in the Great Lakes and Upper Midwest regions of the United States. \"Madison is the capital of Wisconsin.\"","wolf":"Large wild canine native to Eurasia and North America. \"The lone wolf howled at the full moon.\"","wolves":"Plural of wolf, wild predatory canines. \"The pack of wolves hunted deer.\"","wonder":"Feel curious or speculative about something. \"I wonder how rainbows form.\"","wouldn't":"Contraction of \"would not\". \"I wouldn't do that if I were you.\"","wound":"Injury causing tearing of tissue. \"The wound was bandaged to stop bleeding and prevent infection.\"","wrote":"Past tense of write. \"He wrote a long email to his friend.\"","yeast":"Microscopic fungus used to make bread rise or ferment beer. \"We proofed the yeast before adding it to the dough.\"","zoology":"Branch of biology dealing with animals. \"In zoology we studied the animal kingdom and species classifications.\""}]